[{"title": "Volkswagen plant closures 'not the right way', Germany's Scholz says", "pubDate": "2024-12-07 18:55:43", "link": "https://www.investing.com/news/stock-market-news/volkswagen-plant-closures-not-the-right-way-germanys-scholz-says-3760304", "description": "FRANKFURT (Reuters) - Factory shutdowns would be a wrong move by Volkswagen (ETR:VOWG_p), German Chancellor Olaf Scholz said, adding that Europe's largest carmaker had a responsibility to its employees.Volkswagen is in a bitter dispute with staff over pay cuts and possible plant closures aimed at countering high costs in Germany and massively cheaper Asian rivals entering Europe.Both sides go into a fourth round of negotiations on Monday.\"Specific decisions will be negotiated between the owners and labour representatives. My opinion is clear: closing locations would not be the right way to go,\" Scholz told the Funke Media Group.\"It would not be right because poor management decisions have contributed to the difficult situation,\" he added.The state of Lower Saxony is Volkswagen's second-largest shareholder, and its state premier, like Scholz, has urged the group to avoid site closures.  3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Should you invest $2,000 in VOWG_p right now?Before you buy stock in VOWG_p, consider this:\n\nProPicks AI are 6 easy-to-follow model portfolios created by Investing.com for building wealth by identifying winning stocks and letting them run. Over 150,000 paying members trust ProPicks to find new stocks to buy – driven by AI.\n\nThe ProPicks AI algorithm has just identified the best stocks for investors to buy now. The stocks that made the cut could produce enormous returns in the coming years.\n\nIs VOWG_p one of them?Reveal Undervalued Stocks Now", "tags": ["VOWG_p"]}, {"title": "NYC mayor says suspect identified in UnitedHealth executive's murder, NY Post reports", "pubDate": "2024-12-07 18:45:35", "link": "https://www.investing.com/news/stock-market-news/nyc-mayor-says-suspect-identified-in-unitedhealth-executives-murder-ny-post-reports-3760303", "description": "(Reuters) - Authorities have identified the man suspected of killing UnitedHealth (NYSE:UNH) executive Brian Thompson and are closing in on him, New York City Mayor Eric Adams was quoted as saying on Saturday by the New York Post.\"The net is tightening,\" Adams told reporters at a Police Athletic League holiday party in Harlem, according to the Post. He declined to name the suspect.Thompson, 50, who became CEO of UnitedHealth's insurance unit in April 2021, was shot in the back around 6:45 a.m. ET (1145 GMT) on Wednesday in what police described as a targeted attack by a masked assailant lying in wait.The murder occurred just before the company's annual investor conference at the Hilton hotel on Sixth Avenue.The shooting sparked a massive manhunt for the gunman, who fled on foot wearing a hooded jacket, balaclava and gray backpack before mounting an electric bike and riding into Central Park, police said.Adams was quoted by the Post as saying the police were withholding the suspect's name for now to deny him any advantage.“We don’t want to release that now,” the mayor said. “If you do, you are basically giving a tip to the person we are seeking and we do not want to give him an upper hand at all. Let him continue to believe he can hide behind the mask.\"\"We revealed his face,\" he continued, referring to security camera photos and video released after the murder. \"We’re going to reveal who he is and we’re going to bring him to justice.” 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.New York police said on Friday they believe the suspect had left New York City, after video emerged showing him climbing into a taxi that took him to a bus station.\"We have video of him entering the Port Authority Bus Terminal. We don't have any video of him exiting so we believe he may have gotten on a bus,\" New York Police Department Chief of Detectives Joseph Kenny told CNN. \"Those buses are interstate buses. That's why we believe he may have left New York City.\"The circumstances of the attack suggested it was premeditated and planned, police said, with video showing the gunman ignoring other pedestrians while appearing to wait for Thompson. The shooter's motive was not yet known.Security video showed the shooter behind Thompson, raising his handgun and firing at his back. Thompson, a married father of two, suffered gunshot wounds to his back and leg and was pronounced dead at a hospital shortly after the attack.UnitedHealth is the largest U.S. health insurer, providing benefits to tens of millions of Americans, who pay more for healthcare than people in any other country. UNH: A Bull or Bear Market Play?Don't miss out on the next big opportunity! Stay ahead of the curve with ProPicks – 6 model portfolios fueled by AI stock picks with a stellar performance this year..In 2024 alone, ProPicks' AI identified 2 stocks that surged over 150%, 4 additional stocks that leaped over 30%, and 3 more that climbed over 25%. That's an impressive track record.With portfolios tailored for Dow stocks, S&P stocks, Tech Stocks, and Mid Cap stocks, you can explore various wealth-building strategies.So if UNH is on your watchlist, it could be very wise to know whether or not it made the ProPicks lists.Unlock ProPicks now", "tags": ["UNH"]}, {"title": "UniCredit says ready to sit down with Credit Agricole over Banco BPM", "pubDate": "2024-12-07 18:35:57", "link": "https://www.investing.com/news/stock-market-news/unicredit-says-ready-to-sit-down-with-credit-agricole-over-banco-bpm-3760302", "description": "By Valentina ZaMILAN (Reuters) -UniCredit is ready to sit down with Credit Agricole (OTC:CRARY), a spokesperson for the Italian bank said in a LinkedIn post after the French lender increased its potential stake in Unicredit (BIT:CRDI)'s takeover target Banco BPM.UniCredit's bid for its smaller peer prompted Credit Agricole to say on Friday it had entered derivatives that would raise its stake in BPM to 15% from 9.9% once the European Central Bank gives its green light.\"Yesterday's news about Credit Agricole's increased stake in BPM changes nothing for UniCredit,\" the spokesperson for UniCredit said on social media network LinkedIn.\"We were always prepared to negotiate with CA, as this would have been necessary whatever the scale of their shareholding.\" Sources with knowledge of the French bank's strategy have told Reuters Credit Agricole's focus is to protect the commercial partnerships that allow it to sell its products in Italy. Credit Agricole has ruled out a full buyout of BPM, in which it is the single biggest shareholder.\"UniCredit's early move made Credit Agricole's investment more expensive and more complicated. BPM shareholders should not welcome this development,\" the UniCredit spokesperson said.UniCredit last month claimed a seat at Italy's bank consolidation table by launching a 10 billion euro ($11 billion) all-share unsolicited bid for Banco BPM.The move scuppered plans by the Rome government to broker a merger between BPM and state-backed Monte dei Paschi di Siena. Both banks partner with fund manager Anima Holding, which Banco BPM is in the process of taking over. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.On Saturday, sources told Reuters that Unicredit had got informal backing from the Rome government prior to announcing its increased stake in Banco BPM. The UniCredit spokesperson warned BPM shareholders they should be wary of a potential combination of BPM with the Italian business of Credit Agricole, or of any attempt to merge BPM with Monte dei Paschi.A bid for Monte dei Paschi is a possible defence strategy for BPM, which has spurned UniCredit's offer as too cheap.\"Credit Agricole's likely options would be to merge BPM with Credit Agricole Italia (on attractive terms for Credit Agricole) or face a complicated combination with Monte dei Paschi. Both of these routes would destroy BPM shareholder value,\" the UniCredit spokesperson said.($1 = 0.9463 euros)Should you invest $2,000 in CRDI right now?ProPicks AI are 6 model portfolios created by Investing.com which identify the best stocks for investors to buy now. The stocks that made the cut could produce monster returns in the coming years. Is CRDI one of them?Unlock ProPicks AI to find out", "tags": ["CRARY", "CRDI"]}, {"title": "Stellantis to rejoin ACEA auto manufacturers association", "pubDate": "2024-12-07 16:30:56", "link": "https://www.investing.com/news/stock-market-news/stellantis-to-rejoin-acea-auto-manufacturers-association-3759858", "description": "MILAN (Reuters) -Stellantis on Friday said it planned to rejoin European auto lobby  ACEA  (BIT:ACE), which it had left at the beginning of 2023, in a move that might flag a more cautious stance for the automaker on its electrification plans.\"Stellantis (NYSE:STLA), Europe's second largest carmaker, confirms that it intends to apply for membership of ACEA,\" the group said in a statement.The European Automobile Manufacturers Association, widely known by its French acronym ACEA, has been the industry's main lobbying group since its creation in 1991, uniting Europe's car, truck, van and bus makers.Stellantis had left the group following a decision by its former CEO Carlos Tavares. Tavares, who resigned early this week, recently opposed an ACEA proposal to delay European Union fines for automakers which fail to meet intermediate carbon reduction targets set for 2025.ACEA on Saturday welcomed Stellantis' application.\"Given Europe's unprecedented competitiveness crisis and collective need to master the challenges of the green transformation, it is more important than ever to stand united,\" it said in a statement. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Is STLA truely undervalued?With STLA making headlines, investors are asking: Is it truly valued fairly? InvestingPro's advanced AI algorithms have analyzed STLA alongside thousands of other stocks to uncover hidden gems with massive upside. And guess what? STLA wasn't at the top of the list.Unlock ProPicks AI", "tags": ["STLAM", "STLA"]}, {"title": "Jefferies on tanker stocks following U.S. sanctions on Iranian oil exports", "pubDate": "2024-12-07 16:02:02", "link": "https://www.investing.com/news/stock-market-news/jefferies-on-tanker-stocks-following-us-sanctions-on-iranian-oil-exports-432SI-3760291", "description": "Investing.com -- Tanker stocks rallied sharply on Tuesday after the U.S. Treasury imposed sanctions on 21 additional vessels transporting Iranian crude, including 10 very large crude carriers (VLCCs).The move signals a renewed push to enforce sanctions against Iran, which could significantly tighten global VLCC supply and bolster the tanker market, according to a note from Jefferies.Jefferies maintains a bullish outlook on tanker stocks, citing attractive valuations, improving sentiment, and a stronger winter demand season. The firm highlights DHT Holdings (NYSE:DHT), Frontline (NYSE:FRO), and International Seaways (NYSE:INSW) as top plays to benefit from potential tailwinds in the VLCC market.The latest sanctions bring the total number of VLCCs under restriction to 35, with an additional 85 vessels on a \"watchlist\" for potentially carrying Iranian oil. These 120 ships account for nearly 14% of the global fleet of 850 trading VLCCs, representing a substantial capacity risk if further enforcement escalates.Iran’s crude exports have risen to 1.7 million barrels per day (mb/d) in 2024, a sharp increase from 0.3 mb/d between 2019 and 2022, fueled by muted sanction enforcement and reliance on shadow fleets. Most of these exports head to China, pressuring other producers like Saudi Arabia, whose exports have declined to 6.0 mb/d in 2024 from 6.5 mb/d in 2023.Jefferies views the sanctions as a potential catalyst for the tanker market. Restricting Iran’s shadow fleet could reduce VLCC availability while driving demand for sanctioned-free vessels to meet global crude transportation needs. A repeat of 2019's market dynamics, when U.S. sanctions on Chinese firm COSCO removed 50 VLCCs from trading and sent rates soaring above $200,000/day, may be on the horizon. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Should sanctions further constrain Iran’s crude exports to levels seen from 2019-2022, global tanker utilization could rise from 85% to 95%, significantly tightening market conditions.The combination of stricter sanctions, reduced VLCC supply, and increased demand for non-sanctioned crude transport creates a favorable risk-reward dynamic for tanker equities, according to Jefferies.  DHT: is this perennial leader facing new challenges?With valuations skyrocketing in 2024, many investors are uneasy putting more money into stocks. Sure, there are always opportunities in the stock market – but finding them feels more difficult now than a year ago.\n\nUnsure where to invest next? One of the best ways to discover new high-potential opportunities is to look at the top performing portfolios this year.\n\nProPicks AI offers 6 model portfolios from Investing.com which identify the best stocks for investors to buy right now. For example, ProPicks AI found 9 overlooked stocks that jumped over 25% this year alone.\n\nThe new stocks that made the monthly cut could yield enormous returns in the coming years.\n\nIs DHT one of them?Unlock ProPicks AI to find out", "tags": ["DHT", "INSW", "FRO"]}, {"title": "US spending on TikTok Shop gains as TikTok faces threat of ban, data shows", "pubDate": "2024-12-07 15:01:19", "link": "https://www.investing.com/news/stock-market-news/us-spending-on-tiktok-shop-gains-as-tiktok-faces-threat-of-ban-data-shows-3760251", "description": "By Arriana McLymore and Sheila DangNEW YORK (Reuters) - U.S. TikTok users spent heavily to buy merchandise from a range of vendors on the e-commerce platform TikTok Shop so far this holiday shopping season, according to TikTok estimates and a Reuters analysis of spending patterns measured by data from Facteus.The patterns show that TikTok Shop, which launched in the U.S. in September 2023, has likely gained market share in e-commerce at a critical moment. TikTok Shop serves as an e-commerce channel for major brands such as e.l.f. Cosmetics, Ninja Kitchen, among other products. TikTok Shop said in a press release in late November that its sales had reached $100 million on Black Friday, the day after Thanksgiving, when bargain-hunting American consumers spent heavily online. Previously, it said the number of people purchasing goods on TikTok Shop each month had nearly tripled. Reuters could not independently verify its claims.A U.S. federal appeals court on Friday upheld a law requiring Chinese-based ByteDance to divest TikTok in the U.S. by early next year or face a ban. A ban of the popular short video app, if it happens, could extend to TikTok Shop, too.\"TikTok Shop is a new distribution channel and brands are doing really well on it,\" said Erik Huberman, CEO of marketing agency Hawke Media, which has clients that sell products through the feature. \"Honestly, there isn't an alternative. It will be a lost revenue stream.\" Like its rivals Shein and Temu, TikTok Shop showcases merchandise from third-party vendors, some which ship items from China, competing fiercely on price. Each of the platforms have tried to lure more U.S. sellers with lower fees to help with shipping speeds.  3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Capitalizing on the popularity of the TikTok social media app, TikTok Shop merchants typically use ads and sponsored \"influencers\" to market their products to TikTok's 170 million U.S. users. Merchants on TikTok Shop fulfill shoppers' orders directly, sometimes using third-parties or TikTok's e-commerce fulfillment services. For shoppers like Jasmine Whaley, 31, of York, Pennsylvania, TikTok Shop has provided a new place to find clothes, skin care products and  Crocs  (NASDAQ:CROX). She's spent almost $700 on the platform this year after seeing videos from influencers and advertisers about merchandise. TikTok has \"cracked the code\" on curating content and products that she likes, Whaley said. Her TikTok Shop orders often are delivered to her more quickly than orders she places on Amazon (NASDAQ:AMZN), she said.For merchants and influencers, TikTok Shop offers what it calls \"LIVE,\" live-video streams from which shoppers can purchase merchandise directly. Nico Le Bourgeois, head of U.S. Operations for TikTok Shop, said in a statement to Reuters that the number of Live sessions hosted monthly has nearly tripled over the past year in the U.S.According to third-party data firm Facteus, U.S. spending on TikTok Shop exceeded spending on Shein and Temu in the seven days leading up to Cyber Monday, Dec. 2, a heavy online shopping day. Facteus said its data comes from 140 million consumer debit and credit cards representing 7% to 10% of all U.S. spending.  Should you invest $2,000 in CROX right now?With CROX making headlines, savvy investors are asking: Is it truly valued fairly? In a market full of overpriced darlings, identifying true value can be challenging. InvestingPro's advanced AI algorithms have analyzed CROX alongside thousands of other stocks to uncover hidden gems. These undervalued stocks, potentially including CROX, could offer substantial returns as the market corrects. In 2024 alone, our AI identified several undervalued stocks that later surged by 30 or more. Is CROX poised for similar growth? Don't miss the opportunity to find out.Reveal Undervalued Stocks Now", "tags": ["CROX", "AMZN"]}, {"title": "Exclusive-Italy informally backed Credit Agricole's higher BPM stake, sources say", "pubDate": "2024-12-07 14:00:56", "link": "https://www.investing.com/news/stock-market-news/exclusiveitaly-informally-backed-credit-agricoles-higher-bpm-stake-sources-say-3760257", "description": "By Giuseppe Fonte and Valentina ZaROME (Reuters) - France's Credit Agricole (OTC:CRARY) had informal backing from the Italian government before it said on Friday it was raising its stake in Banco BPM, two sources close to the matter told Reuters.The increase intensifies a banking battle in Italy, begun when UniCredit last month made a takeover offer for Banco BPM, scuppering the government's plan to help bring about a merger between BPM and state-backed Monte dei Paschi di Siena.Credit Agricole declined to comment. Ruling out a full takeover bid, Credit Agricole said on Friday it had entered derivative contracts to raise its holding in BPM to 15.1% from 9.9%. It is seeking European Central Bank approval to buy up to 19.99%.Asking not to be named due to the sensitivity of the matter, the sources said that, before acting, the French bank had informed and obtained an informal nod from Italian Prime Minister Giorgia Meloni's government.Separately, a source familiar with Credit Agricole's strategy told Reuters the bank aims to strengthen its negotiating position to protect commercial agreements that generate revenues in its biggest market outside France.Credit Agricole became Banco BPM's main investor in 2022, shortly after an earlier aborted takeover attempt of BPM by UniCredit.Credit Agricole partners with BPM in consumer credit and insurance. Its asset management arm Amundi has a distribution contract with UniCredit that runs out in 2027.Present in Italy since 1972, Credit Agricole has grown steadily in the country, partly through small acquisitions. Officials in Rome have previously told Reuters it has always reassured the government about its strategy, ruling out any overly aggressive move to seize market share. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.The strategy has not changed, one of the sources said.Approval from the Italian government, as well as the European Central Bank, is necessary if Credit Agricole is to raise its stake in BPM.The Italian government has \"golden powers\" that allow it to block or set conditions on foreign and domestic corporate takeovers in strategic sectors such as energy, telecoms and banking.Under Italian rules, the cabinet office must approve share ownership in any Milan-listed strategic company when it crosses thresholds set at 3%, 5%, 10%, 15% and other intervals up to 50%.UniCredit CEO Andrea Orcel has said his bank could not afford to be sidelined as Italian banking consolidation sped up. Banco BPM had moved to buy fund manager Anima Holding and take a stake in Monte dei Paschi days before UniCredit launched its bid with a near zero premium.($1 = 0.9463 euros) CRARY: A Bull or Bear Market Play?Don't miss out on the next big opportunity! Stay ahead of the curve with ProPicks AI – 6 model portfolios fueled by AI stock picks with a stellar performance this year...\n\nIn 2024 alone, ProPicks AI identified 2 stocks that surged over 150%, 4 additional stocks that leaped over 30%, and 3 more that climbed over 25%. That's an impressive track record.\n\nWith portfolios tailored for Dow stocks, S&P stocks, Tech Stocks, and Mid Cap stocks, you can explore various wealth-building strategies.\n\nSo if CRARY is on your watchlist, it could be very wise to know whether or not it made the ProPicks AI lists.Unlock ProPicks AI now", "tags": ["CRARY"]}, {"title": "US TikTok content creators warn followers to find them on Instagram, YouTube", "pubDate": "2024-12-07 12:06:08", "link": "https://www.investing.com/news/stock-market-news/us-tiktok-content-creators-warn-followers-to-find-them-on-instagram-youtube-3760252", "description": "By Seher Dareen(Reuters) - American content creators on TikTok asked followers to subscribe to their channels on rival platforms like Meta-owned Instagram and Alphabet (NASDAQ:GOOGL)'s YouTube after a federal appeals court ruled that the social media app could be banned if it is not sold to a U.S.-based company by Jan. 19.TikTok has become a major U.S. digital force as it has grown to 170 million U.S. users, especially younger people drawn to its short, often irreverent videos. It has sucked away advertisers from some of the largest U.S. players and added commerce platform TikTok Shop, which has become a marketplace for small businesses.The U.S. Congress, fearing TikTok's Chinese owners are gathering information about American consumers, has passed a law requiring its owner, Chinese-backed ByteDance, to divest its TikTok in the U.S. or face a ban. On Friday, a federal appeals court upheld the law. Threats by politicians and others to TikTok have been building for years, leading some users to brush off recent threats. That appeared to change on Friday, with the prospect of a ban in just six weeks. A Supreme Court appeal is still possible. \"For the first time I'm realizing that a lot of what I worked for could disappear,\" Chris Mowrey, a Democratic social media influencer with 470,000 TikTok followers, told Reuters. \"I don't think it's been talked about enough how damaging it will be from an economic standpoint for small businesses and creators.\"On the app, viewers and content creators voiced concerns and confusion, many saying they doubted the platform would survive, and that they were prepared for the worst. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Chris Burkett, a content creator on TikTok with 1.3 million people following his men's lifestyle videos, said he did not think the platform would last. \"I don't think there's longevity on this app in the United States,\" he said in a video post, asking his audience to follow him on other social media platforms, such as Instagram, YouTube, X and Threads.\"We've put so many years and so much time into building our community here,\" said food travel content creator SnipingForDom, who has 898,000 followers on the app. While he did not think the end was near for TikTok, he still told followers to reach out to him on his Instagram page.Others were also awaiting more information. Sarah Jannetti, a TikTok Shop consultant, said her clients are not worried about a potential TikTok ban and will not shift their businesses \"until they see something that's more concrete.\" Should you invest $2,000 in GOOGL right now?ProPicks AI are 6 model portfolios created by Investing.com which identify the best stocks for investors to buy now. The stocks that made the cut could produce monster returns in the coming years. Is GOOGL one of them?Unlock ProPicks AI to find out", "tags": ["GOOGL", "META"]}, {"title": "Expert shares 5 key thoughts on the impact of Trump 2.0 on autos", "pubDate": "2024-12-07 10:30:00", "link": "https://www.investing.com/news/stock-market-news/expert-shares-5-key-thoughts-on-the-impact-of-trump-20-on-autos-3754475", "description": "Investing.com -- In a Tuesday note to clients,  Deutsche Bank  (ETR:DBKGn) analysts shared their five key takeaways from their recent expert call with Curtis Dubay, the Chief Economist at the US Chamber of Commerce, where they discussed the impact of Trump 2.0 on the auto industry.1) The discussion highlighted that significant changes to electric vehicle (EV) tax credits are improbable before the end of 2025 due to the legislative process required for policy alterations.The expert call emphasized that any changes President-elect Trump may wish to implement would necessitate congressional review and approval, a process that could not be circumvented even by the Department of Government Efficiency (DOGE).2) This clarification comes amidst recent headlines suggesting a straightforward elimination of EV tax credits, which “may not be representative of the top priorities of the Trump administration,” Deutsche Bank’s note states.3) Furthermore, the analysis suggested that the Trump administration may not prioritize the removal of EV tax credits immediately. Instead, the topic is expected to surface during bipartisan negotiations over tax reform, especially with the expiration of the Tax Cuts and Jobs Act (TCJA) in 2025.4) Also, the DOGE's ability to act as a \"CEO\" of the government is limited by legal and procedural constraints. “Two years will likely not be enough time to implement major changes, but where it can scrutinize is likely related to waste, fraud, and abuse of spending,” analysts said.5) Lastly, the conversation addressed the topic of tariffs. While imposing a blanket tariff on all imported goods would necessitate a national security justification, which might be challenging to substantiate, the possibility of reinstating tariffs against China and Mexico was acknowledged as more likely to be considered. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.President-elect Trump announced last week to impose significant tariffs on the United States' three largest trading partners—Canada, Mexico, and China—aiming to fulfill campaign promises that could risk sparking trade conflicts.Trump, set to take office on January 20, proposed a 25% tariff on goods from Canada and Mexico, tying the measure to efforts to curb drug trafficking, particularly fentanyl, and reduce migrant crossings at the border. This approach appears to challenge the terms of an existing free-trade agreement.Regarding China, Trump unveiled plans for an \"additional 10% tariff, above any additional tariffs,\" though the implications remain unclear.He has previously vowed to revoke China's most-favored-nation trade status and impose tariffs exceeding 60% on Chinese imports, a level much higher than those seen during his first presidency.Is DBKGn truely undervalued?With DBKGn making headlines, investors are asking: Is it truly valued fairly? InvestingPro's advanced AI algorithms have analyzed DBKGn alongside thousands of other stocks to uncover hidden gems with massive upside. And guess what? DBKGn wasn't at the top of the list.Unlock ProPicks AI", "tags": ["DBKGn"]}, {"title": "Investing.com's stocks of the week", "pubDate": "2024-12-07 10:00:00", "link": "https://www.investing.com/news/stock-market-news/investingcoms-stocks-of-the-week-3759765", "description": "Investing.com -- With the first week of December drawing to a close, there were plenty of stocks making big moves, especially as the major US indices hit new record closes. Although it wasn’t positive for everyone. Here are Investing.com’s stocks of the week: Intel (NASDAQ:INTC), Rubrik and Marvell (NASDAQ:MRVL) Technology.Intel Intel was a stock that struggled this week. On Monday, it was announced that CEO Pat Gelsinger had retired from the company. While the stock initially rose on the news, it ended up closing the day 0.5% lower. It was reported by Reuters that Gelsinger had been forced out as directors felt hit “costly and ambitious plan to turn Intel around was not working.”Reacting to the news, BofA said: “Given Gelsinger's \"IDM 2.0\" strategy hasn't yielded much fruit to date (GM/FCF remain pressured into 1H25 at minimum, no volume Intel 18A wafer customer announced), the transition does not come as a complete surprise.” Later in the week, Intel shares fell further with the weakness tied to a disappointing investor presentation. Lynx Equity Strategies KC Rajkumar and Jahanara Ahmed said: \"In a disappointing presentation at an investor conference yesterday, the CFO, newly appointed as interim co-CEO, missed an opportunity to wipe the slate clean and start afresh.”RubrikFrom Tuesday this week, Rubrik shares began to gain ground. However, it was Friday that saw the surge. At the time of writing, it is up more than 26%. The leap in its share price comes on the back of its latest quarterly earnings. The company reported a narrower-than-expected loss per share of $0.21, compared to the consensus of $0.40 loss per share.  3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Meanwhile, revenue topped expectations for the quarter, coming in at $236.2 million versus the consensus of $217.5 million. The company’s raised guidance also impressed investors. \"RBRK reported an impressive October quarter against a broader backdrop of mixed software results, and the company beat our ARR growth estimate by about 4pts. We think organic demand remains strong,” said BMO Capital. “With strong execution and higher software valuations, we are raising our target price to $72 and reiterate our Outperform rating.\"Marvell TechnologyMarvell Technology was another stock that popped following its earnings release, with the company’s shares gaining an impressive 23,2% on Wednesday.The company posted Q3 EPS of $0.43, $0.02 better than the analyst estimate of $0.41, while revenue for the quarter came in at $1.52 billion versus the consensus estimate of $1.45 billion.Looking ahead, Marvell Technology said it sees Q4 2025 EPS of $0.59, plus or minus $0.05, versus the consensus of $0.52. Q4 2025 revenue is seen at $1.8 billion plus or minus 5%, versus the consensus of $1.646 billion.Goldman Sachs raised its price target for Marvell to %115 from $87 following the earnings release, maintaining a Buy rating on the stock. \"Marvell delivered its second consecutive beat/raise as revenue growth in core Data Center, driven by strength in AI Custom Compute and Optics, continues to accelerate,” the bank wrote.“[We] continue to view Marvell as one of the key beneficiaries of the ongoing build-out of AI infrastructure, particularly those that are custom-built for specific cloud/hyperscale applications.\"  3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.INTC: is this perennial leader facing new challenges?With valuations skyrocketing in 2024, many investors are uneasy putting more money into stocks. Sure, there are always opportunities in the stock market – but finding them feels more difficult now than a year ago.\n\nUnsure where to invest next? One of the best ways to discover new high-potential opportunities is to look at the top performing portfolios this year.\n\nProPicks AI offers 6 model portfolios from Investing.com which identify the best stocks for investors to buy right now. For example, ProPicks AI found 9 overlooked stocks that jumped over 25% this year alone.\n\nThe new stocks that made the monthly cut could yield enormous returns in the coming years.\n\nIs INTC one of them?Unlock ProPicks AI to find out", "tags": ["INTC", "MRVL"]}, {"title": "XRP Climbs 10% In a Green Day", "pubDate": "2024-12-07 16:05:58", "link": "https://www.investing.com/news/cryptocurrency-news/xrp-climbs-10-in-a-green-day-3760293", "description": "Investing.com - XRP was trading at $2.5663 by 11:04 (16:04 GMT) on the Investing.com Index on Saturday, up 10.21% on the day. It was the largest one-day percentage gain since December 2.The move upwards pushed XRP's market cap up to $145.2027B, or 3.95% of the total cryptocurrency market cap. At its highest, XRP's market cap was $155.2807B.XRP had traded in a range of $2.3874 to $2.5663 in the previous twenty-four hours.Over the past seven days, XRP has seen a rise in value, as it gained 35.3%. The volume of XRP traded in the twenty-four hours to time of writing was $12.2848B or 6.37% of the total volume of all cryptocurrencies. It has traded in a range of $1.8514 to $2.8928 in the past 7 days.At its current price, XRP is still down 22.00% from its all-time high of $3.29 set on January 4, 2018.Elsewhere in cryptocurrency tradingBitcoin was last at $99,670.3 on the Investing.com Index, up 0.36% on the day.Ethereum was trading at $3,999.43 on the Investing.com Index, a gain of 0.17%.Bitcoin's market cap was last at $1,975.2014B or 53.67% of the total cryptocurrency market cap, while Ethereum's market cap totaled $482.8456B or 13.12% of the total cryptocurrency market value. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Which stock should you buy in your very next trade?With valuations skyrocketing in 2024, many investors are uneasy putting more money into stocks. Unsure where to invest next? Get access to our proven portfolios and discover high-potential opportunities.\n \nIn 2024 alone, ProPicks AI identified 2 stocks that surged over 150%, 4 additional stocks that leaped over 30%, and 3 more that climbed over 25%. That's an impressive track record.\n \n With portfolios tailored for Dow stocks, S&P stocks, Tech stocks, and Mid Cap stocks, you can explore various wealth-building strategies.Unlock ProPicks AI", "tags": []}, {"title": "Bitcoin Bubble Top Might Be Near? Not Yet, Analyst Says", "pubDate": "2024-12-07 15:30:21", "link": "https://www.investing.com/news/cryptocurrency-news/bitcoin-bubble-top-might-be-near-not-yet-analyst-says-3760288", "description": "U.Today - Jordi Visser, former CIO and president of Weiss Multi-Strategy Advisors firm, is sure that Bitcoin (BTC) has not entered its \"bubble\" phase over $100,000. To hit the potential top, it first need to rally against MAG7, an index of major tech stocks in the U.S.No, BTC is not bubble, investing veteran Jordi Visser saysThe Bitcoin (BTC) price \"breakout or bubble top\" is not here, seasoned investor, markets commentator and podcaster Jordi Visser shares in his recent X thread. Even with the fact that Bitcoin (BTC) managed to double its price for the second year in a row, it is very far from what looks like a bubble for tech companies.For instance, the Bitcoin (BTC) price macro chart looks too different from the \"Internet bubble\" of 1990s that registered zero years in red. Neither overhyped MicroStrategy journey in crypto should be treated as a signal of a \"bubble phase.\"Instead, Visser recalled 2020-2021 NFT and early meme coin frenzies as textbook examples of what bubbles might look in crypto. They were accompanied by euphorias in media and splendid performance of all classes of altcoin assets:As such, altcoin statistics of this cycle also confirm that we are very far from reaching the top. As covered by U.Today previously, the ETH/BTC rate, a crucial indicator for the altcoin segment, set a multi-year low in recent weeks right before the Bitcoin (BTC) jump over $100,000.Ethereum (ETH) was not so cheap against Bitcoin (BTC) since April 2021. Visser admitted that despite ETH being back over $4,000, it still fails to revisit its ATH. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.All eyes on Magnificent 7Also, we are still in the middle of processes of capital injection into spot Bitcoin and Ethereum ETFs in the U.S. and Hong Kong. This monstrous inflow is also far from exhaustion, recent data says.Despite all controversy and regulatory hostility, crypto ETFs became the fastest-growing products in the entire ETF history.That being said, to register a proper \"bubble\" status, the Bitcoin (BTC) price needs to rally against MAG7, an index of top tech stocks including Apple (NASDAQ:AAPL), Microsoft (NASDAQ:MSFT), Alphabet (NASDAQ:GOOGL), Amazon.com (NASDAQ:AMZN), Nvidia (NASDAQ:NVDA), Meta Platforms (NASDAQ:META) and Tesla (NASDAQ:TSLA).This particular process — parabolic growth of the BTC/MAG7 rate — marked the top for the last two Bitcoin (BTC) price cycles, seasoned CIO concluded.This article was originally published on U.TodayShould you invest $2,000 in MSFT right now?With MSFT making headlines, savvy investors are asking: Is it truly valued fairly? In a market full of overpriced darlings, identifying true value can be challenging. InvestingPro's advanced AI algorithms have analyzed MSFT alongside thousands of other stocks to uncover hidden gems. These undervalued stocks, potentially including MSFT, could offer substantial returns as the market corrects. In 2024 alone, our AI identified several undervalued stocks that later surged by 30 or more. Is MSFT poised for similar growth? Don't miss the opportunity to find out.Reveal Undervalued Stocks Now", "tags": ["AMZN", "META", "BTC/USD", "NVDA", "ETH/USD", "GOOGL", "MSFT", "AAPL", "TSLA"]}, {"title": "Key Driver for Bitcoin (BTC) Omega Candle Named by Samson Mow", "pubDate": "2024-12-07 12:00:23", "link": "https://www.investing.com/news/cryptocurrency-news/key-driver-for-bitcoin-btc-omega-candle-named-by-samson-mow-3760250", "description": "U.Today - Samson Mow, Bitcoin proponent and the chief executive officer at the BTC adoption-focused company JAN3, has addressed his audience on the X platform to share with them a BTC prediction.He revealed what may be the most likely key driver for the very first Omega candle, which will push the price of the world’s flagship cryptocurrency toward $1 million. His prediction has to do with Michael Saylor’s Bitcoin-focused company, MicroStrategy.Mow expects gamma squeeze on MSTROmega candle is a short-time and a single-day bullish price movement depicted as a large green candle on charts that suggests an extraordinary and rapid price increase. Mow is well-known for predicting Bitcoin to eventually reach $1 million per coin and then go higher.Mow expects the first Omega candle for Bitcoin to happen thanks to a gamma squeeze on MicroStrategy stocks. Gamma squeeze is related to options trading and it happens with a great number of call options (which indicate a bet on a price increase) gets bought. When this happens, market makes are forced to hedge the risks and they begin to buy the stock itself which backs the options. This drives the stock’s price higher. This is what Mow expects to happen to MSTR and then he expects this to push the Bitcoin price up.Meanwhile, MicroStrategy is not slowing down its strategic Bitcoin purchase plan, regularly adding more BTC to its stash.Bitcoin Sat-dollar parity predicted by JAN3 bossIn an earlier tweet, Samson Mow discussed the possible future of Bitcoin when it will be used in the economy equally to the U.S. dollar. The JAN3 CEO predicted that BTC will eventually reach parity with the dollar, or rather particles of Bitcoin called Satoshis will be at parity with the U.S. fiat currency. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Mow explains that by dollar-sat parity he means the approximate purchasing power of the dollar in the present day. “A dozen eggs will be 2-3 sats,” he tweeted.He added that this will happen if the remaining Bitcoin is divided “equally between everyone on the planet.” It is already impossible to divide the 21 million BTC “equally” because of current holders. The actual number of BTC that the average person might end up with per Mow is likely 10-50K Sats.This article was originally published on U.TodayIs MSTR truely undervalued?With MSTR making headlines, investors are asking: Is it truly valued fairly? InvestingPro's advanced AI algorithms have analyzed MSTR alongside thousands of other stocks to uncover hidden gems with massive upside. And guess what? MSTR wasn't at the top of the list.Unlock ProPicks AI", "tags": ["BTC/USD", "MSTR"]}, {"title": "Ethereum (ETH) $4,000 Comeback: What's Next? Did Bitcoin (BTC) Reach Top? Solana (SOL) Finally Breaks Downtrend", "pubDate": "2024-12-07 07:30:22", "link": "https://www.investing.com/news/cryptocurrency-news/ethereum-eth-4000-comeback-whats-next-did-bitcoin-btc-reach-top-solana-sol-finally-breaks-downtrend-3760233", "description": "U.Today - The value of Bitcoin has increased to test the $100,000 mark in recent weeks, demonstrating remarkable strength. It is unclear whether Bitcoin has hit a temporary peak, though, as the asset may be finding it difficult to sustain its bullish momentum based on the current price action.The sharp red candle that follows the $100,000 test on the given chart indicates significant profit-taking by investors. This suggests that a lot of traders and holders took advantage of the chance to lock in profits, which led to selling pressure and kept Bitcoin from decisively breaking through the six-figure mark. Bitcoin is still above important support levels, such as $92,000, which could serve as a basis for additional upward movement in spite of this. Technically, Bitcoin is still trading above its upward-trending 50-100 and 200-day EMAs. Even in the case of brief market consolidation, this bullish alignment indicates that the overall upward trend is still in place. A slight overbought condition is also indicated by the RSI, suggesting that a cooldown may occur prior to any notable higher movements.Bitcoin must overcome the existing resistance levels and spark fresh buying interest in order to make a convincing break above $100,000. This will probably rely on a mix of improved macroeconomic circumstances, more institutional involvement and less profit-taking pressure to sell. It is impossible to completely rule out a short-term decline, but Bitcoin's future is still bright. As a store of value and inflation hedge, the cryptocurrency has proven resilient and is still gaining popularity. Holding $92,000 and $85,000 would bolster Bitcoin's case for another rally attempt, making them important support levels to keep an eye on. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Ethereum regaining powerThough the price has not yet crossed this psychological barrier, Ethereum's journey toward the crucial $4,000 mark is garnering attention. Even though the current rally is showing signs of strength, it is unclear if Ethereum can continue its upward trajectory given the lack of momentum beyond $4,000.Ethereum's gradual recovery over the past few weeks is depicted in the provided chart. The asset's ascent has a strong basis thanks to the bullish alignment of key moving averages such as the 50-day and 200-day EMAs.However, as Ethereum gets closer to $4,000, the volume profile points to a minor drop in buying interest, suggesting that traders may be hesitant at these prices. Ethereum is still in a strong position for future expansion in spite of this.Having maintained higher highs and higher lows — two hallmarks of a persistent bullish trend — the asset has effectively exited a protracted consolidation phase. A break above $4,000 might open the door for a short-term move toward $4,300 or higher if Ethereum can generate enough buying pressure.But it is important to consider the dangers of a brief retracement. In the event that Ethereum is unable to break $4,000 with conviction, the market may retreat to support levels of $3,700 or even $3,400. Additionally, the RSI's presence in the overbought area suggests that there may be a cooldown prior to a subsequent leg up.Ethereum's next rally phase will be determined in large part by on-chain metrics. Ethereum might reach $4,000, with the help of an increase in staking activity transactions or active addresses.  3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Ethereum is still in a crucial stage right now. Even though the momentum of the rally has slowed around $4,000, the asset still has room to grow. At these levels, traders should keep a close eye out for any indications of weakness or a clear breakout to determine the next course of action.Solana remains calmSolana has broken out of its ongoing downward trend and pushed above the crucial $240 level, marking an important technical milestone. For investors who have been anxiously observing SOL's price action for indications of momentum and recovery, this represents a moment of hope. Even though this breakout is a clear sign of bullish intent, there may be a catch: the volume of trading is dropping.Solana's alignment above the major moving averages, such as the 50-100 and 200-day EMAs, supports its decisive crossing of the downtrend resistance line on the price chart. These indicators point to a continued upward trend and indicate that the overall trend is still bullish. The recent surge highlights buyer confidence and suggests that Solana may soon retest its prior highs. The decreasing volume that accompanies this breakout, however, raises questions regarding the move's strength. A breakout supported by rising volume usually indicates strong market activity and long-term viability. The declining volume in Solana's instance can be a sign of buyers waning interest or hesitancy, which might restrict future upside potential.A recovery in trading volume and activity is essential for Solana to solidify its breakout and clear the path for a move toward $260 and beyond. The strength of Solana's breakout should be evaluated by investors by keeping an eye on important support levels and looking for indications of growing market participation. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.This article was originally published on U.TodayWhich stock should you buy in your very next trade?With valuations skyrocketing in 2024, many investors are uneasy putting more money into stocks. Unsure where to invest next? Get access to our proven portfolios and discover high-potential opportunities.\n \nIn 2024 alone, ProPicks AI identified 2 stocks that surged over 150%, 4 additional stocks that leaped over 30%, and 3 more that climbed over 25%. That's an impressive track record.\n \n With portfolios tailored for Dow stocks, S&P stocks, Tech stocks, and Mid Cap stocks, you can explore various wealth-building strategies.Unlock ProPicks AI", "tags": ["BTC/USD", "SOL/USD", "ETH/USD"]}, {"title": "Pepeto and Pepe Unchained Compete for Dominance in the Next Memecoin Era", "pubDate": "2024-12-06 21:00:36", "link": "https://www.investing.com/news/cryptocurrency-news/pepeto-and-pepe-unchained-compete-for-dominance-in-the-next-memecoin-era-3759853", "description": " London, united kingdom, December 6th, 2024, ChainwirePepeto: Low Price and Big Announcements AheadPepeto has captured the crypto community’s attention with its compelling story and utility. Currently priced at just $0.000000096, Pepeto offers an affordable entry point, with five days left in its current presale stage. Pepeto has also teased major upcoming announcements, further fueling speculation and interest. Its combination of narrative-driven appeal, advanced utilities like a cross-chain bridge and zero-fee exchange, and a rapidly growing community can make it a noticeable opportunity in the memecoin space. Pepeto: Community and Adoption for the Memecoin EraPepeto has made a wave of excitement across the crypto space, driven by its captivating story tied to the six documents—P, E, P, E, T, and O—that define its vision. This narrative has rallied a vibrant and growing community, as evident across its active social media platforms. Pepeto’s adoption utility stands out, positioning it as a possible exchange for the next generation of frog-themed and memecoin projects. By offering a seamless platform for trading, bridging, and listing, Pepeto aims to empower the wave of innovative frog-inspired tokens.Pepe Unchained: Scaling Memecoins with Layer 2 and Upcoming ListingsPepe Unchained brings a focus on Layer 2 technology, offering enhanced scalability and efficiency for blockchain transactions. This technical foundation positions the project to support higher transaction volumes and smoother operations, especially during peak market activity. With its presale now completed, Pepe Unchained is building momentum as it prepares for its official listing in less than four days. This milestone marks an important step in delivering value to both its community and the broader memecoin ecosystem. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Two Major Announcements PendingPepeto has hinted at two significant announcements on the horizon. These announcements are hinted to include a potential exchange listing and the beta version launch of PepetoSwap, the project’s core utility.https://x.com/Pepetocoin/status/1864282909319848198By adhering to its roadmap, Pepeto works to continue to build trust and excitement within its growing community. The upgraded platform will soon serve as the foundation for the bridge and exchange functionalities, offering a vital resource for the next generation of blockchain projects.  Link to the roadmap: https://pepeto.io/en#roadmapPepeto Nears $2 Million  Milestone  (WA:MMD) in PresalePepeto’s presale is rapidly approaching the $2 million mark. This achievement can highlight the community’s confidence in Pepeto’s vision and utility, which includes its advanced bridge, zero-fee exchange, and staking rewards. With its low presale price and an ecosystem designed to support the next generation of memecoins, Pepeto aims to become a standout project in the lead-up to the 2025.Youtube link: https://www.youtube.com/watch?v=rm97G0v980APepeto: Building Momentum for the Future of MemecoinsPepeto’s steady progress reflects its commitment to delivering value and innovation to its community. From unveiling the anticipated PepetoSwap to upgrading its official website, every step underscores the team’s focus on creating meaningful utilities. With the beta launch of its bridge and exchange on the horizon and major announcements fueling excitement, Pepeto is positioning itself as a key player in the crypto space, paving the way for widespread adoption and collaborative growth in the memecoin ecosystem.About PepetoPepeto is a memecoin project designed to integrate cross-chain utility with community-driven development. Offering zero-fee trading, blockchain bridge functionality, and a staking rewards program, Pepeto seeks to combine accessibility with practical features. The project emphasizes interoperability and long-term value, fostering a dedicated user base through its ecosystem innovations and community-focused approach.  3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Disclaimer:The official website for Pepeto is https://pepeto.io/. Be cautious of fraudulent websites.To learn more about Pepeto’s progress and upcoming features, users can visit the official website and Pepeto official socials -  https://pepeto.io/Official Website:  https://pepeto.io/Social Media:X (Twitter): https://x.com/PepetocoinYouTube Channel: https://www.youtube.com/@PepetocoinTelegram Channel: https://t.me/pepeto_channelInstagram: https://www.instagram.com/pepetocoin/TikTok: https://www.tiktok.com/@pepetocoinContactHead of MKBaker ucciovelvetweb3contact@pepeto.ioThis article was originally published on ChainwireWhich stock should you buy in your very next trade?With valuations skyrocketing in 2024, many investors are uneasy putting more money into stocks. Unsure where to invest next? Get access to our proven portfolios and discover high-potential opportunities.\n \nIn 2024 alone, ProPicks AI identified 2 stocks that surged over 150%, 4 additional stocks that leaped over 30%, and 3 more that climbed over 25%. That's an impressive track record.\n \n With portfolios tailored for Dow stocks, S&P stocks, Tech stocks, and Mid Cap stocks, you can explore various wealth-building strategies.Unlock ProPicks AI", "tags": []}, {"title": "SHIB Community Stunned by 144,045% Surge in SHIB Burns, Ripple Breaks Silence on RLUSD Stablecoin Launch, Samson Mow Confirms $1 Million BTC Price Target: Crypto News Digest by U.Today", "pubDate": "2024-12-06 20:30:23", "link": "https://www.investing.com/news/cryptocurrency-news/shib-community-stunned-by-144045-surge-in-shib-burns-ripple-breaks-silence-on-rlusd-stablecoin-launch-samson-mow-confirms-1-million-btc-price-target-crypto-news-digest-by-utoday-3759821", "description": "U.Today - U.Today has prepared summaries of the top three news stories over the past day.Mammoth 144,045% SHIB burn jump stuns Shiba Inu community: DetailsAccording to data provided by the Shibburn tracker, Shiba Inu recently saw a significant increase in its burn rate, reaching levels not seen for a long time. On Dec. 4, this metric surged by an astonishing 144,045%, with a total of 2,041,299,351 SHIB tokens shifted to unspendable wallets. This burn rate spike is primarily attributed to a major transfer of 2,020,624,700 SHIB made earlier this week, along with two smaller transactions. Additionally, the total SHIB burned within the last week reached an impressive 4,251,012,135 tokens, reflecting a weekly burn rate increase of 1,990.39%. The SHIB community reacted positively to this news, with many expressing their enthusiasm and optimism regarding the significant reduction in the circulating supply.Ripple breaks silence on RLUSD stablecoin launch: DetailsRipple has officially addressed the speculation regarding the launch of its highly anticipated RLUSD stablecoin, specifically responding to rumors that it would debut on Dec. 4. As the date passed without the stablecoin's launch, the fintech company took to the X platform to clarify the situation. In its X post, Ripple reaffirmed that \"RLUSD isn’t launching today,\" highlighting its commitment to working closely with the New York Department of Financial Services (NYDFS) in order to ensure regulatory compliance. \"We’re in lockstep with the NYDFS on final approval and will share updates as soon as possible. We are fully committed to launching under the supervision of NYDFS and upholding the highest regulatory standards,\" Ripple stated. The company also promised to provide updates as progress is made. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Bitcoin advocate Samson Mow confirms $1 million BTC price targetThe crypto market recently witnessed a historic event as Bitcoin's price has surpassed the $100,000 mark. This milestone, achieved 15 years after Bitcoin's creation, has sparked Bitcoin advocate Samson Mow to predict a future price target of $1 million. In his X post, Mow wrote that he will not remove \"laser eyes\" (a symbol of optimism and the future value of the flagship crypto in the BTC community) from his profile picture until Bitcoin reaches the $1 million level. The recent Bitcoin halving event, which has intensified scarcity by limiting the daily supply to approximately 450 units, supports this ambitious projection. Demand for Bitcoin is further bolstered by continuous acquisitions from companies such as MicroStrategy, which recently purchased 15,400 BTC, raising its total holdings to 402,100 BTC. Other companies, including Metaplanet and Semler Scientific (NASDAQ:SMLR), are also following suit, suggesting that the demand for Bitcoin could swell even further if major corporations like Microsoft (NASDAQ:MSFT) decide to enter the market.This article was originally published on U.TodayWhich stock should you buy in your very next trade?With valuations skyrocketing in 2024, many investors are uneasy putting more money into stocks. Unsure where to invest next? Get access to our proven portfolios and discover high-potential opportunities.\n \nIn 2024 alone, ProPicks AI identified 2 stocks that surged over 150%, 4 additional stocks that leaped over 30%, and 3 more that climbed over 25%. That's an impressive track record.\n \n With portfolios tailored for Dow stocks, S&P stocks, Tech stocks, and Mid Cap stocks, you can explore various wealth-building strategies.Unlock ProPicks AI", "tags": ["XRP/USD", "BTC/USD", "SHIB/USD"]}, {"title": "Bitcoin Miner Balance Sees 85,503 BTC Drop in 48 Hours", "pubDate": "2024-12-06 20:30:21", "link": "https://www.investing.com/news/cryptocurrency-news/bitcoin-miner-balance-sees-85503-btc-drop-in-48-hours-3759819", "description": "U.Today - Bitcoin (BTC) miners have recorded a significant drop in the total BTC held in wallets associated with miners. In a post on X, Santiment, an on-chain analytics platform, highlighted the shift in Bitcoin’s mining balance. There was a drop of 85,503 BTC within 48 hours.Miner activity: Selling pressure or strategic shift?According to Santiment, this extreme drop could have implications for the market. Although mining balances have dropped since the April halving, this new drop signals stronger implications. Notably, it suggests that there is selling pressure, but that it is not linked to price movements.This movement of over 85,000 BTC is the highest since February 2024. In February, the BTC price was still below the previous all-time high (ATH) of $73,000.This recent movement might trigger price movement, as it occurred in February before Bitcoin hit an ATH about two months later.Despite the historical significance of miner activity, Santiment holds a different view. The platform emphasized that mining wallets have not strongly influenced Bitcoin’s price for much of 2024. This could mean that other market forces, such as whale action or institutional players, are playing a more dominant role.Sentiment maintains that the extreme drop should be a \"net-neutral\" signal. That is, the development is neither bearish nor bullish.Market reaction and price movementsThe development will, however, remain on the radar of stakeholders for a possible correlation to other market activities. This could include shifts in whale behavior and other notable price movement. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.As of this writing, Bitcoin price was trading for $99,091.99, a decrease of 4.27%. Bitcoin had dropped from its historic $100,000 psychological level in earlier trading. The world’s leading asset had dropped to a low of $94,035 before rebounding in the market.This article was originally published on U.TodayWhich stock should you buy in your very next trade?AI computing powers are changing the stock market. Investing.com's ProPicks AI includes 6 winning stock portfolios chosen by our advanced AI. In 2024 alone, ProPicks AI identified 2 stocks that surged over 150%, 4 additional stocks that leaped over 30%, and 3 more that climbed over 25%. Which stock will be the next to soar?Unlock ProPicks AI", "tags": ["BTC/USD"]}, {"title": "Ex-Fed Chair Believes Bitcoin Reserve Might Not Be Good Idea: Details", "pubDate": "2024-12-06 20:30:18", "link": "https://www.investing.com/news/cryptocurrency-news/exfed-chair-believes-bitcoin-reserve-might-not-be-good-idea-details-3759818", "description": "U.Today - Bill Dudley, former chairman of the New York Federal Reserve, has expressed concerns about the potential inclusion of Bitcoin in the United States' national reserves.The idea of a national Bitcoin reserve has gained traction this year among some policymakers and crypto enthusiasts, who argue that it could provide a hedge against inflation and diversify U.S. financial assets.While Dudley believes that crypto technology has the potential to improve the financial system and that a Bitcoin reserve might send BTC prices soaring, he argues that a BTC reserve might not be beneficial overall.At the time of writing, BTC was trading down 4.31% in the last 24 hours to $98,854. It previously touched an all-time high of $104,000 during yesterday's trading session.Bitcoin reserve might send BTC price soaringIn a Bloomberg opinion article, Bill Dudley, former president of the Federal Reserve Bank of New York, explains why he believes a Bitcoin reserve might not be a good idea: it might worsen the government's finances by fueling inflation, and the government would be stuck holding volatile tokens that generate no income.Bitcoin, according to Dudley, hardly qualifies as money, and its volatility makes it an unsuitable medium of exchange. In most nations, people are not required to accept it as money, he noted. \"Transactions are slow and expensive, requiring significant computing power and energy to validate each one,\" Dudley stated.The ex-Fed president, however, believes that Bitcoin has some positive attributes: \"It’s portable—you can keep millions of dollars’ worth on a thumb drive. It’s semi-anonymous, in the sense that holders are identified only by a public alphanumeric key. It can be transferred to anyone, anywhere, without relying on government-regulated banks or other traditional financial intermediaries.\" 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.If enacted, Dudley believes a Bitcoin reserve would undoubtedly send the BTC price soaring as investors pile in to get ahead of the government’s purchases, but on the contrary, it might stoke inflation.This article was originally published on U.TodayWhich stock should you buy in your very next trade?AI computing powers are changing the stock market. Investing.com's ProPicks AI includes 6 winning stock portfolios chosen by our advanced AI. In 2024 alone, ProPicks AI identified 2 stocks that surged over 150%, 4 additional stocks that leaped over 30%, and 3 more that climbed over 25%. Which stock will be the next to soar?Unlock ProPicks AI", "tags": ["BTC/USD"]}, {"title": "Anaxi Labs and Carnegie Mellon University’s CyLab Unveil a Breakthrough Proof System", "pubDate": "2024-12-06 15:30:36", "link": "https://www.investing.com/news/cryptocurrency-news/anaxi-labs-and-carnegie-mellon-universitys-cylab-unveil-a-breakthrough-proof-system-3759505", "description": " Pittsburgh, United states, December 6th, 2024, ChainwireAnaxi Labs, in collaboration with Carnegie Mellon University’s CyLab, the university’s cybersecurity and privacy institute, is announcing a compiler framework for cryptography that resolves an impasse – building scalable applications with Zero-Knowledge require fundamental trade-offs. The elusive trifecta of scalable, cryptographically-secured and decentralized applications have been considered impossible, and a barrier to mass adoption — until now.A Breakthrough in Cryptography with No Trade-OffsBlockchains such as Ethereum have been hailed as the future of decentralized infrastructure, with Zero-Knowledge (ZK) technology heralded to enhance Ethereum's security and scalability beyond 120 TPS. According to the team, developing ZK proofs is complex and time-consuming, requiring thousands of hours across dozens of developers. Prioritizing speed in proof generation also means manually designing protocols, and with manual coding and tens of thousands of lines of code this introduces significant security vulnerabilities. This complicates the creation of security-sensitive decentralized applications and makes auditability and compliance a nightmare – all hindrances to widespread adoption in regulated industries such as finance, healthcare and AI.A team of Carnegie Mellon researchers is collaborating with Anaxi Labs to overcome this trade-offCMU’s recent paper presents a revolutionary way to directly compile high-level software and convert it into simpler forms (low-level representations) needed for underlying proof systems to work. And all this is done automatically, repeatable and auditable, getting rid of the manual work, drastically improving performance while cryptographically ensuring security of the process. The work achieves this by analyzing the high-level program, breaking the program into small, indivisible units, then creating low-level representation from each unit that can be easily inputted into varieties of proof systems. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.“This idea of breaking the computation into very specific chunks that take the place of a CPU in an automatic way is a new approach, and this is the first time that somebody has attempted this kind of approach where we avoid the full program representation for the compiler,” said Riad Wahby, assistant professor in Carnegie Mellon University’s Department of Electrical and Computer Engineering. “We’re extremely excited about it.”Unlocking New Decentralized ApplicationsThe research and the framework Anaxi Labs is building from the research are set to revolutionize industries in Web3 and beyond. In traditional and regulated finance, the performance boost while maintaining auditability enables real-time settlement of intrabank transfers like instant USD payments. In healthcare, amid challenges faced by 23andMe, secure and privacy-preserving encryption tools enabled by product being developed by Anaxi Labs, could now address critical concerns and safely utilize private genetic information by ensuring rightful ownership of one’s DNA, while enabling valuable research. Within the realm of enterprise AI and critical physical infrastructures, a decentralized solution that requires high availability and close to zero latency such as rapid fine-tuning and inference across multiple data and compute power resources becomes a reality.In the immediate term, products based on the research provide the most effective solution for Web3 companies grappling with the scalability, security and decentralization trade-offs, offering a new design paradigm for rollups and interoperability.“This research and the product we are building incorporating the research will have profound implication to many important industry applications today that need a safe solution for their massive performance overheads, such as ZK and EVM, finally bringing us to the doorstep of our vision of cryptographically-secured decentralized consensus with real-time settlement,” said Kate Shen, co-founder of Anaxi Labs.   3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.“We also like the fact that it is language and library agnostic, meaning a wide variety of projects can benefit from this without code modification. This enabled us to build an open, collaborative framework as opposed to the increasingly static, monolithic approaches today,” Shen adds. “This enables all developers to automatically choose and combine the best of the latest advancements in proof systems such as lookups, co-processors and hardware acceleration; maximizing the performance gains of each computational substrate.”Anaxi Labs and CyLab, a Game-Changing PartnershipCarnegie Mellon’s CyLab has been at the center of cutting-edge research that’s served as the foundation for blockchain development – including Zero-Knowledge. Notable faculty researchers from CyLab include esteemed professor Bryan Parno, a critical contributor to the history of ZK whose lab produced the widely cited Nova paper series, and assistant professor Riad Wahby, whose findings resulted in new cryptographic technologies that realized visions of the Ethereum Foundation (and more recently, the pathbreaking Jolt zkVM implementation by Andreessen Horowitz’s crypto division, a16z crypto).The findings set forth in this compiler framework are the result of the second research project originating from the symbiotic partnership between Anaxi Labs and CyLab through the CMU Secure Blockchain Initiative. This partnership enables CMU academics to collaborate and learn from the insights gleaned from the commercial deployments of their blockchain research, spearheaded by Anaxi Labs, for both Web3 and Web 2.0 applications. It enables them to find commercial solutions to major existing issues with blockchain that fails to bridge the gap between the known benefits of blockchain technology, and mass adoption. And it also serves as a springboard for CMU students to launch their careers in Web3. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.“Anaxi Labs’ partnership with CyLab advances CMU researchers’ ability to work on projects with direct, real-world applications, ensuring that their work has practical relevance and potential for impact,” said Michael Lisanti, CyLab’s Senior Director of Partnerships.To learn more about Anaxi Labs: https://www.anaxilabs.com/To learn more about Anaxi Labs and CyLab’s latest work: https://www.cylab.cmu.edu/ To learn more about CyLab’s partnership with Anaxi Labs: https://www.cylab.cmu.edu/news/2024/07/17-anaxi-labs-strategic-partner.htmlAbout Anaxi LabsAnaxi Labs is a new kind of research and development lab that bridges the worlds of advanced academic theory and mass adoption. They are dedicated to producing original, cutting-edge research, building enterprise-grade, safe and scalable decentralized infrastructure, and catalyzing the next generation of decentralized applications powered by cryptography.Anaxi Labs work with world's top minds in cryptography research and world-class engineers who have experience building and operating household-name products with hundreds of millions of users. They are the industry partner of top academic institutions in cryptography such as Carnegie Mellon University. Together, they are committed to transforming the future of the internet by unlocking the power of what science can do for people, society and the planet.Website: https://www.anaxilabs.com/About CyLabCarnegie Mellon University’s CyLab is the university's security and privacy research institute. They bring together experts from all schools across the University, encompassing the fields of engineering, computer science, public policy, information systems, business, financial information risk management, humanities, and social sciences. Our mission is to catalyze, support, promote, and strengthen collaborative security and privacy research and education across departments, disciplines, and geographic boundaries to achieve significant impact on research, education, public policy, and practice.  3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Website: https://www.cylab.cmu.edu/ContactPRDaisy Leungdaisy@11.internationalThis article was originally published on ChainwireWhich stock should you buy in your very next trade?AI computing powers are changing the stock market. Investing.com's ProPicks AI includes 6 winning stock portfolios chosen by our advanced AI. In 2024 alone, ProPicks AI identified 2 stocks that surged over 150%, 4 additional stocks that leaped over 30%, and 3 more that climbed over 25%. Which stock will be the next to soar?Unlock ProPicks AI", "tags": []}, {"title": "Bitcoin price today: back below $100k amid profit-taking, payrolls data", "pubDate": "2024-12-06 14:03:26", "link": "https://www.investing.com/news/cryptocurrency-news/bitcoin-price-today-slides-from-100k-amid-profittaking-payrolls-watch-3758320", "description": "Investing.com-- Bitcoin retreated on Friday after a short-lived rally past the coveted $100,000 level, as anticipation of more cues on U.S. interest rates spurred some profit-taking.The world’s biggest cryptocurrency surged to record highs on Thursday amid increased optimism over friendlier crypto regulations under incoming President Donald Trump. Traders were particularly cheered by Trump’s pick of a pro-crypto candidate to lead the Securities and Exchange Commission. Bitcoin fell around 4% to $98,690.0 by 08:58 ET (13:58 GMT). The coin had fallen as low as $91,000 after hitting a record high of $103,719.4.Broader crypto moves tracked Bitcoin's pullback.Trump picks David Sacks as White House AI and crypto czar Continuing his trend of crypto-friendly cabinet picks, Trump on Thursday said venture capitalist David Sacks will take up a newly created role to advise the White House on crypto and artificial intelligence regulation.This follows the creation of a crypto advisory council, while Trump’s picks for the Treasury Secretary and Secretary of Commerce were also seen in support of deregulation and digital assets. Earlier this week, Trump nominated former SEC Commissioner Paul Atkins to lead the agency. Atkins is also pro-crypto, and is expected to end, or at least taper the SEC’s two-year regulatory crusade against crypto. November nonfarm payrolls data tops estimatesThe U.S. labor market showed a strong rebound in November following weaker performance in October, which was likely influenced by hurricane disruptions in the southeast.Nonfarm payrolls increased by 227,000 last month, surpassing the expected gain of 200,000, as reported by the Bureau of Labor Statistics. October’s initially reported increase of 12,000 jobs was revised upward to 36,000. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.The unemployment rate for November came in at 4.2%, aligning with market expectations and slightly higher than October’s 4.1%.These employment figures, released Friday morning, are among the final major economic indicators the Federal Reserve will evaluate before its December 17-18 meeting. Just a month ago, expectations were high that the central bank would proceed with another reduction in its benchmark interest rate. However, robust economic data, persistent inflation signals, and cautious remarks from Fed officials have prompted a slight shift in sentiment.Ahead of the jobs report, CME FedWatch data indicated a 70% probability of a 25 basis point rate cut in December, down from 80% a month earlier. Following the latest employment data, the odds of a 25 basis point cut rose to 88%.Bitcoin dominance could wane under friendlier regulations- Citi Citi analysts warned in a recent note that while they did see positive regulatory and macroeconomic trends for crypto, Bitcoin’s dominance of crypto markets could taper off with the industry gaining more regulatory clarity.Citi said that regulatory clarity could open the door for more crypto use cases, enabling other, smaller coins and tokens with actual use cases. They noted that Bitcoin was already treated as a commodity, limiting its usage.“Over the long-term, we think a network’s utility or value will be related to usage, as well as macro correlations and production costs,” Citi analysts said, while noting that such a scenario would benefit Bitcoin less than other cryptos. The brokerage also joined several of its peers in downplaying Bitcoin’s prospect as a reserve asset.   3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Crypto price today: altcoins track Bitcoin losses, set for a strong weekMost broader crypto prices moved in a tight range on Friday, seeing some pressure from losses in Bitcoin. But they were set to outpace Bitcoin for the week.World no.2 crypto Ether slid 0.7% to $3,893.22 and was trading up nearly 8% over the past seven days.XRP- which was the biggest beneficiary of speculation over the next SEC head, lost roughly 3%, but was sitting on a 7-day gain of over 36%- its fifth straight week of outsized gains.XRP hit a six-year high on speculation that the SEC will drop its long-running lawsuit against issuer Ripple.Solana, Cardano and Polygon fell between 2% and 5%. Among meme tokens, Dogecoin tumbled more than 5%. Ambar Warrick contributed to this report. Which stock should you buy in your very next trade?AI computing powers are changing the stock market. Investing.com's ProPicks AI includes 6 winning stock portfolios chosen by our advanced AI. In 2024 alone, ProPicks AI identified 2 stocks that surged over 150%, 4 additional stocks that leaped over 30%, and 3 more that climbed over 25%. Which stock will be the next to soar?Unlock ProPicks AI", "tags": ["XRP/USD", "BTC/USD", "ETH/USD"]}, {"title": "Josh Gottheimer trades in Microsoft options, buys and sells various stocks", "pubDate": "2024-12-07 14:26:35", "link": "https://www.investing.com/news/company-news/josh-gottheimer-trades-in-microsoft-options-buys-and-sells-various-stocks-93CH-3760262", "description": "In a recent congressional trade report, Representative Josh Gottheimer from New Jersey's 5th congressional district has been active in trading multiple stocks and options. The transactions were made through his  Morgan Stanley  (NYSE:MS) - Select UMA Account #1 and Morgan Stanley - Portfolio Management Active Assets Account. These trades include several high-profile companies, with detailed financial metrics available through InvestingPro's comprehensive research reports covering 1,400+ US stocks.Gottheimer made significant transactions in Microsoft Corporation (NASDAQ:MSFT) options. He sold call options of Microsoft with strike prices of $240 and $230, set to expire on September 19, 2025. Each transaction was valued between $1,000,001 and $5,000,000. In addition, Gottheimer purchased Microsoft call options with strike prices of $240, $235, and $230, each set to expire on June 20, 2025, with each transaction valued between $1,000,001 and $5,000,000. These transactions were made through his Morgan Stanley - Portfolio Management Active Assets Account. Currently trading at $443.57, Microsoft shows strong financial health with a \"GREAT\" rating on InvestingPro, maintaining 19 consecutive years of dividend growth and generating robust revenue growth of 16.4% over the last twelve months.In addition, Gottheimer made several purchases and sales of various stocks through his Morgan Stanley - Select UMA Account #1. Each of these transactions was valued between $1,001 and $15,000.He purchased stocks of Applovin Corporation - Class A (NASDAQ:APP), D.R. Horton, Inc. (NYSE:DHI), Dominion Energy, Inc. (NYSE:D), Johnson & Johnson (NYSE:JNJ), KKR & Co. Inc. (NYSE:KKR),  MercadoLibre , Inc. (NASDAQ:MELI), Natera, Inc. (NASDAQ:NTRA), Salesforce, Inc. (NYSE:NYSE:CRM),  Shopify Inc . (NYSE:NYSE:SHOP), and Tesla, Inc. (NASDAQ:TSLA). 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Gottheimer also sold stocks of ConocoPhillips (NYSE:NYSE:COP),  Eaton  (NYSE:ETN) Corporation, PLC (NYSE:ETN), Eli Lilly and Company (NYSE:NYSE:LLY), Fox Factory Holding Corp. (NASDAQ:FOXF), HealthEquity, Inc. (NASDAQ:HQY), Microsoft Corporation (NASDAQ:MSFT), Netflix, Inc. (NASDAQ:NFLX), NVIDIA Corporation (NASDAQ:NVDA), Regeneron (NASDAQ:REGN) Pharmaceuticals, Inc. (NASDAQ:REGN), and Vertiv Holdings, LLC (NYSE:NYSE:VRT).Investors may find these transactions noteworthy, as they provide insight into the financial activities of a prominent congress member. For those seeking deeper analysis, InvestingPro offers comprehensive financial metrics, valuation tools, and over 15 additional ProTips for Microsoft and other traded companies, helping investors make more informed decisions based on professional-grade data.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.Is MSFT truely undervalued?With MSFT making headlines, investors are asking: Is it truly valued fairly? InvestingPro's advanced AI algorithms have analyzed MSFT alongside thousands of other stocks to uncover hidden gems with massive upside. And guess what? MSFT wasn't at the top of the list.Unlock ProPicks AI", "tags": ["MSFT"]}, {"title": "Max Miller from Ohio's 7th district invests in Trimer Capital Partners I LP", "pubDate": "2024-12-07 14:21:14", "link": "https://www.investing.com/news/company-news/max-miller-from-ohios-7th-district-invests-in-trimer-capital-partners-i-lp-93CH-3760259", "description": "Max Miller, the representative from Ohio's 7th congressional district, has made a significant investment in Trimer  Capital Partners  (WA:CPAP) I LP (GLAS). The transaction was reported on December 5, 2024, following the purchase on November 26, 2024. Congressional trading activity has shown increased interest in private equity investments, with such transactions up 15% compared to the previous year.According to the congressional trade report, the investment was made through a 2012 Trust account, a type of investment vehicle often used for long-term asset management and wealth preservation. The transaction was a capital call for Trimer Capital Partners I LP, with an investment amount ranging from $1,001 to $15,000.Trimer Capital Partners I LP is a private equity fund, classified under the transaction code for Hedge Funds & Private Equity Funds (non-EIF). This indicates that the investment was not in a publicly traded company but in a limited partnership that pools funds to invest in a variety of assets.The report did not specify whether the investment resulted in capital gains exceeding $200.Max Miller's investment in Trimer Capital Partners I LP demonstrates a continued interest from congress members in diverse investment vehicles. As always, investors are encouraged to keep an eye on these transactions as they can provide valuable insights into broader market trends and potential investment opportunities.InvestingPro subscribers gain access to comprehensive institutional investment tracking tools, helping them stay ahead of market-moving congressional trading patterns and institutional fund flows.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Which stock should you buy in your very next trade?AI computing powers are changing the stock market. Investing.com's ProPicks AI includes 6 winning stock portfolios chosen by our advanced AI. In 2024 alone, ProPicks AI identified 2 stocks that surged over 150%, 4 additional stocks that leaped over 30%, and 3 more that climbed over 25%. Which stock will be the next to soar?Unlock ProPicks AI", "tags": ["US500"]}, {"title": "Garanti BBVA sees slight rise in governance rating", "pubDate": "2024-12-07 11:26:25", "link": "https://www.investing.com/news/company-news/garanti-bbva-sees-slight-rise-in-governance-rating-93CH-3760247", "description": "ISTANBUL - Turkiye  Garanti Bankasi  (IS:GARAN) A.S. (TGBD), also known as Garanti BBVA (BME:BBVA), has reported a marginal increase in its Corporate Governance Compliance Rating, according to an announcement made to the investment community. The bank's compliance score, evaluated by JCR Eurasia Rating, has risen to 9.82 from 9.81 out of a possible 10.The assessment, which is based on the Corporate Governance Principles issued by the Capital Markets Board of Turkey (CMB), was conducted over a one-year period ending on December 06, 2024. The bank's rating outlook has also been adjusted to \"Stable.\"Garanti BBVA has maintained its previous year's compliance levels in the categories of Shareholders, Public Disclosure & Transparency, and Stakeholders. Notably, the score for the Board of Directors section increased from 9.81 to 9.85. This improvement is largely attributed to the appointment of Ms. Ebru Oğan Knottnerus to the board, which resulted in the bank surpassing the 25% female membership threshold set by the CMB's governance principles.The bank's overall Corporate Governance Rating is calculated based on weighted scores from four main sections. These sections, along with their respective weights, have contributed to the bank's aggregate score. Garanti BBVA's performance ensures its continued inclusion in the Borsa İstanbul Corporate Governance Index, as its score exceeds the threshold of \"7\".The detailed Corporate Governance Rating Report by JCR Eurasia Rating is available on Garanti BBVA's Investor Relations website. The bank has affirmed that the information provided in the announcement is consistent with official records and reflects accurate and complete information regarding its governance compliance. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.This announcement is based on a press release statement and is intended to inform stakeholders of Garanti BBVA's corporate governance developments without promoting the company or its services.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.Should you invest $2,000 in GARAN right now?ProPicks AI are 6 model portfolios created by Investing.com which identify the best stocks for investors to buy now. The stocks that made the cut could produce monster returns in the coming years. Is GARAN one of them?Unlock ProPicks AI to find out", "tags": ["GARAN"]}, {"title": "Cathie Wood's ARK buys Tempus AI stock, sheds Palantir and Butterfly", "pubDate": "2024-12-07 01:02:16", "link": "https://www.investing.com/news/company-news/cathie-woods-ark-buys-tempus-ai-stock-sheds-palantir-and-butterfly-93CH-3760207", "description": "Cathie Wood's ARK ETFs have reported their daily trades for Friday, December 6th, 2024, showing a continued strategy of selective investment and divestment across the tech and healthcare sectors. Leading the trades with the highest dollar-value, ARK has made a significant purchase of Tempus AI Inc (NYSE:TEM), buying a combined total of 167,968 shares valued at approximately $8.9 million through its ARKK and ARKG ETFs.In contrast, ARK has reduced its stake in  Palantir Technologies Inc  (NYSE:NASDAQ:PLTR), selling 95,570 shares for a total of nearly $6.9 million. This move comes as part of ARK's ongoing adjustments to its portfolio, possibly reflecting a shift in its long-term investment strategy or a response to market conditions.The ETFs also continued to offload shares of Butterfly Network Inc (NYSE:BFLY), with a total of 294,071 shares sold, amounting to just over $973,000. This trade follows a pattern of selling seen in previous days, indicating ARK may be less bullish on the company's prospects or rebalancing for portfolio diversification.Other trades of the day included a smaller sale of Senti Biosciences Inc (NASDAQ:SNTI), with 993 shares sold for a modest sum of $6,156. Although minor in value, this trade is part of a series of sales in the company's stock across recent days.Looking at the week's activity, ARK has shown an accumulating interest in certain stocks, such as Tempus AI, while consistently reducing positions in others like Butterfly Network and Senti Biosciences. These moves provide insight into the ETFs' dynamic management approach, as they adapt to the ever-changing market landscape. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Investors following Cathie Wood's ARK ETFs will likely monitor these trades closely, seeking to understand the rationale behind the buying and selling patterns. As always, ARK's trades offer a window into the investment strategies of one of the most closely watched fund managers in the tech and healthcare investment spaces.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.Should you invest $2,000 in TPX right now?Before you buy stock in TPX, consider this:\n\nProPicks AI are 6 easy-to-follow model portfolios created by Investing.com for building wealth by identifying winning stocks and letting them run. Over 150,000 paying members trust ProPicks to find new stocks to buy – driven by AI.\n\nThe ProPicks AI algorithm has just identified the best stocks for investors to buy now. The stocks that made the cut could produce enormous returns in the coming years.\n\nIs TPX one of them?Reveal Undervalued Stocks Now", "tags": ["TPX", "PLTR"]}, {"title": "Tharimmune secures $2.02 million in private funding", "pubDate": "2024-12-06 21:25:26", "link": "https://www.investing.com/news/company-news/tharimmune-secures-202-million-in-private-funding-93CH-3759938", "description": "BRIDGEWATER, NEW JERSEY - Tharimmune, Inc. (NASDAQ:THAR), a biotech firm specializing in immunology and inflammation with a market capitalization of $3.02 million, has announced a private placement deal to raise approximately $2.02 million. The company's stock has declined over 60% in the past six months, according to InvestingPro data. The agreement involves issuing 961,446 shares of common stock (or equivalents) and warrants for an additional 480,723 shares. Each share or equivalent is priced at $2.10, with a warrant attached. These warrants have a $2.031 exercise price, becoming exercisable six months post-issuance, and expiring five and a half years from the date of issuance. The expected closing date for this transaction is on or about December 9, 2024, subject to standard closing conditions.The financing round was led by Gravitas Capital and SDS Capital Group, with participation from other biotech-focused private investors. President Street Global acted as the exclusive placement agent for the offering. InvestingPro analysis shows the company maintains a healthy current ratio of 2.35, with cash reserves exceeding short-term obligations, suggesting strong near-term liquidity. After accounting for placement agent fees and related expenses, the net proceeds are earmarked for clinical development, particularly advancing the TH104 program, and for general working capital purposes.Tharimmune's TH104 is a clinical asset aimed at treating chronic pruritus associated with primary biliary cholangitis (PBC), a rare autoimmune liver disease. The securities in this placement were offered pursuant to Section 4(a)(2) of the Securities Act of 1933 and Regulation D. They are not registered under the Securities Act or state securities laws, but Tharimmune will file a resale registration statement to facilitate future trading. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.The company is also progressing with TH023, an oral TNF-alpha inhibitor, and is exploring new multi-specific biologics for solid tumors. Through a partnership with OmniAb, Inc., Tharimmune is utilizing advanced antibody discovery platforms for disease targeting.This press release contains forward-looking statements under the Private Securities Litigation Reform Act of 1995, including anticipations regarding Tharimmune's Phase 2 trial and strategic operations. While analysts currently see potential upside based on InvestingPro's Fair Value analysis, they do not anticipate profitability this year. Discover more insights and 8 additional ProTips with an InvestingPro subscription. These statements are based on current expectations and could significantly differ from actual results. Factors influencing these differences include those discussed in the company's Annual Report and other SEC filings.The information in this article is based on a press release statement from Tharimmune, Inc.In other recent news, Tharimmune, Inc. has been the subject of several notable developments. Rodman & Renshaw initiated coverage on Tharimmune, issuing a Buy rating with a 12-month price target of $17.00 per share, based on a detailed financial model and the potential future cash flows from TH104, a drug under development. The firm's outlook on Tharimmune's stock is contingent on the successful development and commercial launch of TH104.Tharimmune has also seen changes in its leadership, with the appointment of Sanam Parikh as the newest member of its board of directors. However, the company decided to cancel a potential merger with Intract Pharma Ltd., as disclosed in a recent SEC filing.   3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.In terms of intellectual property, Tharimmune is set to receive a European patent for its biodegradable polymeric nanoparticles technology, which is expected to enhance cancer therapies. The company also received positive feedback from the European Medicines Agency (EMA) regarding its Phase 2 clinical trial plans for TH104, aimed at treating pruritus in primary biliary cholangitis (PBC). Phase 1 data for TH104 shows promise, with the drug being well received and no unexpected treatment-emergent adverse events reported. Additionally, Tharimmune has entered into an exclusive licensing agreement with Intract Pharma for an innovative oral delivery platform for anti-inflammatory treatments.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.Should you invest $2,000 in THAR right now?With THAR making headlines, savvy investors are asking: Is it truly valued fairly? In a market full of overpriced darlings, identifying true value can be challenging. InvestingPro's advanced AI algorithms have analyzed THAR alongside thousands of other stocks to uncover hidden gems. These undervalued stocks, potentially including THAR, could offer substantial returns as the market corrects. In 2024 alone, our AI identified several undervalued stocks that later surged by 30 or more. Is THAR poised for similar growth? Don't miss the opportunity to find out.Reveal Undervalued Stocks Now", "tags": ["THAR"]}, {"title": "Albany International raises dividend by 4%", "pubDate": "2024-12-06 21:20:49", "link": "https://www.investing.com/news/company-news/albany-international-raises-dividend-by-4-93CH-3759925", "description": "ROCHESTER, N.H. -  Albany International Corp . (NYSE:AIN) announced a quarterly dividend increase of 4%, or $0.01 per share, on its Class A Common Stock. The new dividend of $0.27 per share is scheduled for payment on January 8, 2025, to shareholders on record as of December 17, 2024. According to InvestingPro data, this marks the company's 6th consecutive year of dividend increases, maintaining an impressive 24-year streak of consistent dividend payments.The company, a global developer and manufacturer of engineered components with a market capitalization of $2.51 billion, operates two primary business segments: Machine Clothing and Albany Engineered Composites. Machine Clothing is recognized as a world leader in producing consumable belts necessary for various industrial applications, including paper and non-wovens production. The Albany Engineered Composites division focuses on designing and manufacturing advanced material-based components for aerospace, serving both commercial and military sectors.With headquarters in Rochester, New Hampshire, Albany International maintains a global presence, operating 30 facilities across 13 countries and employing around 5,600 individuals. The company's commitment to growth in its specialized sectors is reflected in its consistent financial strategies and shareholder value initiatives, with InvestingPro reporting a strong financial health score and robust liquidity position with current assets significantly exceeding short-term obligations.This incremental dividend increase represents the company's confidence in its financial stability and ongoing performance, supported by revenue of $1.27 billion in the last twelve months. Based on InvestingPro's Fair Value analysis, the stock is currently trading near its Fair Value. As a listed entity on the New York Stock Exchange, Albany International continues to focus on delivering value to its investors through its strategic operations and financial management. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.The information provided is based on a press release statement from Albany International Corp.In other recent news, Albany International Corp. reported a 6.1% increase in consolidated net sales for Q3 2024, reaching $298 million, despite adjustments in the Engineered Composites sector. The firm's free cash flow saw significant improvement, with the company adjusting its full-year revenue guidance and a slight increase in the adjusted earnings per share (EPS) midpoint. Machine Clothing sales rose, while Engineered Composites sales remained steady. Gross profit took a hit due to a $22 million adjustment in the Engineered Composites segment, and adjusted EBITDA for the quarter dropped to $54 million. However, year-to-date free cash flow surged to $78 million. Albany International has tightened its full-year revenue guidance for 2024, with an adjusted EPS midpoint now at $3.20. In terms of future expectations, the company plans to provide full-year 2025 guidance at the year-end and discuss long-term strategies at an Investor Day in Spring 2025. These are the recent developments, with no speculation or personal predictions included.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.Should you invest $1,000 in AIN right now?Don't miss out on the next big opportunity! Stay ahead of the curve with ProPicks AI – 6 model portfolios powered by AI stock picks with a stellar performance in 2024.Unlock ProPicks to find out", "tags": ["AIN"]}, {"title": "Carrier Global raises quarterly dividend to $0.225 per share", "pubDate": "2024-12-06 21:17:17", "link": "https://www.investing.com/news/company-news/carrier-global-raises-quarterly-dividend-to-0225-per-share-93CH-3759918", "description": "PALM BEACH GARDENS, Fla. - Carrier Global Corporation (NYSE: NYSE:CARR), a provider of climate and energy solutions, has announced an increase in its quarterly dividend. The company's Board of Directors declared a dividend of $0.225 per outstanding share of common stock, marking an 18% increase from previous dividends. According to InvestingPro data, this continues Carrier's track record of raising dividends for four consecutive years, with the current yield at 1.03%.The new dividend is set to be distributed on February 7, 2025, to shareholders on record as of December 20, 2024. This move reflects Carrier's strategy of disciplined capital allocation and its focus on delivering value to its customers, employees, and shareholders, as emphasized by Chairman & CEO David Gitlin.Carrier has a history of innovation in the climate and energy sectors, aiming to create sustainable solutions. The company's forward-looking statements, however, come with the usual caution that they are subject to risks, uncertainties, and other factors that could cause actual results to differ materially from expectations.This dividend announcement is based on a press release statement from Carrier Global Corporation and does not necessarily represent the views of the Wall Street Journal. The information provided is intended to offer a factual report on Carrier's dividend increase without endorsement or speculation on the company's financial position or market performance.In other recent news, Carrier Global Corporation has undergone significant executive changes with Senior Vice President and Chief Legal Officer, Kevin O'Connor, stepping down. Francesca Campbell is set to take over the role. In recent financial maneuvers, Carrier issued €750 million in 3.625% euro-denominated notes due in 2037, using the proceeds and existing cash to redeem its 4.375% Notes due in 2025.  3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.The company's Q3 financials showed a 21% increase in sales to $6 billion, with organic sales growing by 4%. The HVAC segment saw a 26% increase in sales, largely due to the acquisition of Viessmann Climate Solutions. Adjusted EPS from continuing operations was $0.77, marking a 3% increase year-over-year. Analysts at Baird and Oppenheimer maintained an Outperform rating on Carrier Global, while  Mizuho  (NYSE:MFG) held the company at Neutral. The company repurchased $400 million in shares in Q3 and plans to reach $1 billion in buybacks by year's end. These recent developments highlight Carrier's strategic financial moves and robust performance.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.Should you invest $1,000 in CARR right now?Don't miss out on the next big opportunity! Stay ahead of the curve with ProPicks AI – 6 model portfolios powered by AI stock picks with a stellar performance in 2024.Unlock ProPicks to find out", "tags": ["CARR"]}, {"title": "BloomZ faces Nasdaq delisting over share price", "pubDate": "2024-12-06 21:12:39", "link": "https://www.investing.com/news/company-news/bloomz-faces-nasdaq-delisting-over-share-price-93CH-3759904", "description": "TOKYO - BloomZ Inc. (NASDAQ:BLMZ), a micro-cap company with a market capitalization of $8.33 million specializing in audio production and talent management for voice actors and virtual YouTubers (VTubers), has been notified by Nasdaq of non-compliance with the exchange's minimum bid price rule. According to InvestingPro data, the stock has experienced significant volatility, with shares currently trading at $0.60. The notice, received on December 2, 2024, indicates that the company's shares did not meet the required minimum bid price of $1.00 over a period of 30 consecutive business days from October 18 to November 29, 2024.Nasdaq's Listing Rule 5550(a)(2) stipulates that listed companies must maintain a minimum bid price of at least $1.00 per share. BloomZ now has 180 calendar days, until June 2, 2025, to regain compliance. To achieve this, the company's ordinary shares must close at $1.00 or higher for at least 10 consecutive trading days during the 180-day period. If BloomZ fails to meet this requirement by the deadline, it may be granted additional time to regain compliance or face the risk of being delisted from the Nasdaq Capital Market.Currently, the notice of deficiency does not affect the listing or trading of BloomZ's securities on the Nasdaq. The company has expressed its intention to actively monitor its share price and take reasonable measures to regain compliance within the allotted timeframe. InvestingPro analysis reveals the company maintains a healthy current ratio of 1.6, indicating sufficient liquid assets to meet short-term obligations. Subscribers can access 8 additional key financial metrics and insights about BLMZ's financial health. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.BloomZ Inc. operates through its subsidiary Kabushiki Kaisha BloomZ in Japan, leveraging over a decade of experience in audio production for animations and video games. Despite challenging market conditions, InvestingPro data shows the company achieved notable revenue growth of nearly 30% in the last twelve months. The company continues to focus on the cultivation and promotion of voice actors and VTubers, a growing segment in the entertainment industry.This press release contains forward-looking statements, which are based on management's current expectations and projections. However, there is no guarantee that these projections will be realized, and actual outcomes may differ significantly. Forward-looking statements involve risks and uncertainties that can affect the company's performance.The information for this article is based on a press release statement from BloomZ Inc.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.Should you invest $2,000 in BLMZ right now?With BLMZ making headlines, savvy investors are asking: Is it truly valued fairly? In a market full of overpriced darlings, identifying true value can be challenging. InvestingPro's advanced AI algorithms have analyzed BLMZ alongside thousands of other stocks to uncover hidden gems. These undervalued stocks, potentially including BLMZ, could offer substantial returns as the market corrects. In 2024 alone, our AI identified several undervalued stocks that later surged by 30 or more. Is BLMZ poised for similar growth? Don't miss the opportunity to find out.Reveal Undervalued Stocks Now", "tags": ["BLMZ"]}, {"title": "Alpha Metallurgical names Gorzynski as new chairman", "pubDate": "2024-12-06 21:08:50", "link": "https://www.investing.com/news/company-news/alpha-metallurgical-names-gorzynski-as-new-chairman-93CH-3759896", "description": "BRISTOL, Tenn. - Alpha Metallurgical Resources, Inc. (NYSE: AMR), a prominent supplier of metallurgical products to the steel industry in the United States with a market capitalization of $2.91 billion and an \"GREAT\" financial health rating according to InvestingPro, today announced a change in leadership. David Stetson, the company's chairman, is set to retire from the board of directors, effective December 13, 2024. Michael Gorzynski, currently the lead independent director, will take over as chairman following Stetson's departure.The board of directors has approved the transition, which coincides with a reduction in board size from seven to six members. Gorzynski's appointment and the board's downsizing are both set to occur on December 13, 2024.Stetson's retirement is not due to any disagreements with Alpha, but rather marks the end of a notable phase during which he played a critical role in the company's financial achievements, including the repayment of long-term debt and the attainment of record revenue. The company's strong financial position is evident in its debt-free balance sheet and robust current ratio of 3.59x. According to InvestingPro analysis, the stock currently appears undervalued based on its Fair Value assessment, with 12 additional ProTips available to subscribers.In a statement, Gorzynski praised Stetson's \"visionary leadership,\" crediting him with setting Alpha on a path to \"improved financial strength and the potential for continued long-term, industry-leading success.\" He expressed his honor in taking over the board chairmanship and his eagerness to continue collaborating with the management team in his new role. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Stetson reflected on his tenure, highlighting Alpha's impact on stakeholders, from providing employment and community support to environmental stewardship and shareholder returns. He expressed confidence in the company's future direction under the existing leadership team.Andy Eidson, Alpha's CEO, thanked Stetson for his service, noting his leadership within the company and the broader coal industry, including his role in establishing the Metallurgical Coal Producers Association. Eidson also voiced his confidence in Gorzynski's leadership as the incoming chairman.Alpha Metallurgical Resources, headquartered in Tennessee, operates across Virginia and West Virginia and supplies metallurgical products globally, generating $3.3 billion in revenue over the last twelve months with a healthy gross profit margin of 21.8%. The company has emphasized that forward-looking statements in this news release are speculative and subject to risks and uncertainties. Detailed financial analysis and comprehensive research reports for AMR and 1,400+ other stocks are available through InvestingPro's premium research platform.This article is based on a press release statement from Alpha Metallurgical Resources.In other recent news, Alpha Metallurgical Resources has released its third-quarter earnings for 2024. Despite market challenges and operational difficulties, the company reported an adjusted EBITDA of $49 million and shipped 4.1 million tons of coal. In response to these challenges, Alpha Metallurgical is planning to focus on operational efficiency and maintain a robust balance sheet for the upcoming year.Looking ahead, the company expects to ship 16.7 million tons of coal in 2025, a decrease from the previous year's guidance. Alpha Metallurgical is also set to reduce production shifts and has idled the Checkmate Powellton mine. Despite these changes, the company's total liquidity has increased by 42% to $507 million, allowing for continued investment in projects such as the Kingston Wildcat Mine.  3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.Alpha Metallurgical's share buyback program continues, with approximately $400 million remaining for repurchases. The Kingston Wildcat Mine is expected to produce up to 1 million tons annually at full capacity starting in late 2025. These recent developments highlight the company's strategic focus on cost management and efficiency in the face of softening market conditions.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.Should you invest $2,000 in AMR right now?ProPicks AI are 6 model portfolios created by Investing.com which identify the best stocks for investors to buy now. The stocks that made the cut could produce monster returns in the coming years. Is AMR one of them?Unlock ProPicks AI to find out", "tags": ["AMR"]}, {"title": "Formula Systems stock soars to 52-week high of $95.85", "pubDate": "2024-12-06 21:00:43", "link": "https://www.investing.com/news/company-news/formula-systems-stock-soars-to-52week-high-of-9585-93CH-3759855", "description": "In a remarkable display of market confidence,  Formula Systems (1985) Ltd  (NASDAQ:FORTY) stock has reached a 52-week high, touching $95.85 in recent trading. According to InvestingPro data, the company maintains a \"GREAT\" financial health score and operates with a moderate debt-to-equity ratio of 1.03. This peak represents a significant milestone for the IT solutions and services provider, underscoring a period of robust growth. Over the past year, the company has seen its stock value surge by an impressive 53.68%, supported by solid fundamentals including a healthy EBITDA of $301.38M and consistent dividend payments for 12 consecutive years. InvestingPro analysis suggests the stock remains undervalued despite its recent gains. This bullish trend for Formula Systems reflects a broader enthusiasm in the tech sector, as investors continue to seek out companies with solid fundamentals and the potential for sustained growth. Get access to 8 more exclusive InvestingPro Tips for Formula Systems by visiting InvestingPro.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C. 3rd party Ad. Not an offer or recommendation by Investing.com. See disclosure here or remove ads.FORTY: A Bull or Bear Market Play?Don't miss out on the next big opportunity! Stay ahead of the curve with ProPicks – 6 model portfolios fueled by AI stock picks with a stellar performance this year..In 2024 alone, ProPicks' AI identified 2 stocks that surged over 150%, 4 additional stocks that leaped over 30%, and 3 more that climbed over 25%. That's an impressive track record.With portfolios tailored for Dow stocks, S&P stocks, Tech Stocks, and Mid Cap stocks, you can explore various wealth-building strategies.So if FORTY is on your watchlist, it could be very wise to know whether or not it made the ProPicks lists.Unlock ProPicks now", "tags": ["FORTY"]}]