[{"title": "Meet the Newest Stock-Split Stock in the S&P 500. It's Soared 3,823% Since Its IPO, and It's Still a Buy Heading Into 2025 According to Wall Street.", "link": "https://finance.yahoo.com/news/meet-newest-stock-split-stock-080200313.html", "pubDate": "2024-12-07T08:02:00Z", "description": "In This Article:  ANET   +1.33%  ^GSPC   +0.25%   The S&P 500 is the most highly regarded stock market index in the U.S., composed of the 500 largest companies in the country. Given the breadth of its constituent companies, it's considered by many investors to be the most reliable measure of overall stock market performance. To become a member of the S&P 500, a company must meet the following criteria:Be based in the U.S. Have a market cap of at least $18 billion Be highly liquid A minimum of 50% of its outstanding shares must be available for trading Must be profitable on a generally accepted accounting principles (GAAP) basis in its most recent quarter In aggregate, must be profitable over the preceding four quarters Arista Networks (NYSE: ANET) has been a member of the S&P 500 since August 2018, but the networking specialist recently completed a 4-for-1 forward stock split. This step is normally the result of years of robust operating and financial results, and Arista Networks certainly meets those criteria. Since its IPO in mid-2014, the stock has soared 3,823% (as of this writing), as the company has been a key player in the evolving data-driven networking industry. Its results aren't just part of some dusty past either. Over the past five years, Arista Networks stock has surged 779%.Are You Missing The Morning Scoop? Wake up with Breakfast news in your inbox every market day. Sign Up For Free »Despite its impressive gains, many on Wall Street believe there's plenty of upside ahead. Let's review Arista's path to success and what the future holds.  Image source: Getty Images.  From humble beginningsArista Networks was founded in 2008 after creating a groundbreaking network switch to connect servers and other high-speed devices to a network. What made its product fundamentally different was that it offered high-speed data transfer with low latency -- or very little lag. From those humble beginnings, Arista has expanded its offerings to include a wide variety of switches, routers, and other networking hardware that facilitates the flow of data across data centers, servers, and networks.Keeping data flowing through the ether is big business these days, and the advent of artificial intelligence (AI) has forever altered the playing field. Arista pivoted quickly to pioneer scaled-out Ethernet offerings, which speed up networking for large-scale AI models. Earlier this year, the company debuted Arista Etherlink AI platforms, \"designed to deliver optimal network performance for the most demanding AI workloads.\"One of it most robust offerings -- the Distributed Etherlink 7700 AI networking platform -- was designed to connect up to 10,000 graphics processing unit (GPU) clusters, the chips that form the backbone of AI processing.  Story Continues Don't take my word for it. Arista Networks was identified as a Visionary in Gartner's vaunted Magic Quadrant. The company was cited for providing network management tools that simplify operations, offering a differentiated network security strategy, and providing advanced AI and machine learning capabilities. Arista was also selected as a Customer's Choice in Gartner's Peer Insights, which aggregates reviews from existing customers.As data centers scramble to upgrade their equipment to meet the rigorous demands of AI, many are turning to Arista Networks. That demand is showing in the company's financial results. For the third quarter, Arista generated revenue of $1.8 billion, up 20% year over year and 7% sequentially. This resulted in earnings per share (EPS) that jumped 35% to $2.33. The results were well ahead of management's guidance and Wall Street's expectations.In light of the robust results, management increased its forecast. For the fourth quarter, Arista is guiding for year-over-year revenue growth of 23% to $1.9 billion.Analysts are still bullish on Arista NetworksWall Street has long been known for its wide-ranging opinions, so it's noteworthy that the majority of analysts who cover Arista Networks believe the stock has further to run. Of the 26 analysts who offered an opinion (thus far) in December, 77% maintain a buy or strong buy rating on the stock, and only one recommends selling. Furthermore, Wall Street has an average price target of roughly $108 (post-split), which represents potential upside of 4% compared to Tuesday's closing price.However, Barclays analyst Tim Long is more bullish than his Wall Street colleagues, maintaining an outperform (buy) rating and recently increasing his price target to a Street-high (split-adjusted) $124. That suggests potential gains for investors of 19% compared to Tuesday's closing price. The analyst noted Arista's recent robust results, increased guidance, and the speed at which it has ramped up its AI offerings. The analyst also cited the company's market share gains in the campus and routing markets.One fly in the ointment is the stock's lofty valuation. Arista Networks is currently selling for 51 times earnings, which certainly seems expensive. Even its price/earnings-to-growth (PEG) ratio, which accounts for its accelerating growth, comes in at 1.35 when any number less than 1 suggests an undervalued stock. So, there's no denying it trades at a premium.However, it's important to put that in context. Arista Networks has outperformed the broader market by a wide margin over the past five years, generating gains of 779%, 8 times the return of the S&P 500.When viewed from that perspective, I'd argue Arista Networks is a buy.Should you invest $1,000 in Arista Networks right now?Before you buy stock in Arista Networks, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Arista Networks wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $889,004!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of December 2, 2024Danny Vena has positions in Arista Networks. The Motley Fool has positions in and recommends Arista Networks. The Motley Fool recommends Barclays Plc and Gartner. The Motley Fool has a disclosure policy.Meet the Newest Stock-Split Stock in the S&P 500. It's Soared 3,823% Since Its IPO, and It's Still a Buy Heading Into 2025 According to Wall Street. was originally published by The Motley Fool  View Comments (1) ", "tags": ["ANET", "^GSPC"]}, {"title": "How NFL Legend Rob Gronkowski Turned A Near 1,000% Profit On His First Ever Stock Investment – After Forgetting He Owned The Shares", "link": "https://finance.yahoo.com/news/nfl-legend-rob-gronkowski-turned-170013418.html", "pubDate": "2024-12-06T17:00:13Z", "description": "     Quick Summary   NFL legend Rob Gronkowski made a nearly 1,000% profit on his first stock investment in Apple shares, which he bought in 2014 on the advice of his contractor. Gronkowski, who had no experience with stock trading, purchased $69,000 worth of shares and forgot about them. Two and a half years later, the shares were worth $250,000, and he eventually sold some of the shares, leaving him with over $600,000 in Apple stock. Gronkowski's successful investment was largely due to luck, but it highlights the potential for lucrative returns with the right investment.  Generated by Yahoo Finance AI   Yahoo Finance used generative AI to summarize key information from this article. Some details may be inaccurate. We take that seriously. Reporting mistakes helps us improve these summaries. Was this helpful?  Yes   No    Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.Sometimes it's better to be lucky than good, but nothing beats being lucky and great. Former NFL tight end Rob Gronkowski, who won multiple Super Bowls during his illustrious career, certainly qualifies as great. However, he was also incredibly lucky for his first stock trade, which netted him almost 1,000% profit on Apple shares he bought after a recommendation from his contractor.Don't Miss:Commercial real estate has historically outperformed the stock market, and this platform allows individuals to invest in commercial real estate with as little as $5,000 offering a 12% target yield with a bonus 1% return boost today! CEO of Integris gathered a team of senior investment managers who have $34.22 billion in combined owned and managed assets in the West Coast — here’s how to invest in their private credit fund that targets 12% annual interest rate. Rob Gronkowski shot to fame as a prominent member of the New England Patriots dynasty led by Head Coach Bill Belichick and Quarterback Tom Brady. Unlike Belichick and Brady, known for their button-down, all-business personalities, Gronkowski was famous for his vibrant, fun-loving nature. So, it may come as a surprise to learn that Rob Gronkowski is financially astute, but by all accounts, he has handled his finances very well.In his 2018 book It's Good to Be Gronk, Rob revealed that he never spent any of the estimated $70 million he made playing in the NFL and avoided buying expensive items like cars and jewelry. Gronkowski parlayed his fun-loving personality into a successful career as a pitchman for some of America's most recognized brands, like T-Mobile and Dunkin Donuts. He lived off the money from his marketing deals, not his NFL salary.See Also: Warren Buffett once said, \"If you don't find a way to make money while you sleep, you will work until you die.\" These high-yield real estate notes that pay 7.5% – 9% make earning passive income easier than ever.Ironically, Gronkowski's first foray into stock trading happened entirely by accident. In an interview with Fortune Magazine, Gronk told how he made his first stock trade. \"My first stock ever was the Apple stock,\" Gronkowski said. \"The guy actually who built my house in Foxborough, he told me, ‘Hey, buy Apple stock.'\" At the time, Gronkowski wasn't familiar with stock trading, but he was intrigued.\"You know I'd never been involved in stocks and really didn't know how stocks worked,\" he continued. Eventually, Gronkowski decided to pull the trigger and purchased $69,000 worth of Apple shares. It was a rather large investment for a first-time stock buyer, but Gronkowski told Fortune, \"I'm going to go big, yeah obviously, this just fits along the lines of just me being myself.\"  Story Continues Trending: The Ascent Income Fund from EquityMultiple targets stable income from senior commercial real estate debt positions and has a historical distribution yield of 12.1% backed by real assets. Earn a 1% return boost on your first EquityMultiple investment when you sign up here (accredited investors only).Gronkowski purchased the shares in 2014 after calling his financial advisor and telling him to make the deal. He may not have meant to buy and hold the stocks, but that's exactly what happened. Maybe Gronkowski was so busy having fun that he forgot about his investment. \"So, then all of a sudden, I forgot about it,\" Gronkowski said.\"Then, it's like 2 ½ years later and the shares are worth $250,000,\" Gronkowski continued. He concluded the story of his investment adventure by telling Fortune, \"So, I sell off the portion of the $69,000 that I used to buy it and I have now, to this date, I have over $600,000 in Apple Stock all because of the investment I made in 2014 having no idea what I was doing, but just listening to the man that built my house.\"It's an incredible story, and luckily for Gronkowski, his contractor gave him a good tip. Nevertheless, you may want to be more cautious about where you get your investment advice. Unlike Rob Gronkowski, you probably don't have a $70 million cushion to fall back on. However, Gronkowski's successful foray into stock trading illustrates how lucrative the right investment can be.A 9% Return In Just 3 MonthsEquityMultiple's ‘Alpine Note — Basecamp Series' is turning heads and opening wallets. This short-term note investment offers investors a 9% rate of return (APY) with just a 3 month term and $5K minimum. The Basecamp rate is at a significant spread to t-bills. This healthy rate of return won't last long. With the Fed poised to cut interest rates in the near future, now could be the time to lock in a favorable rate of return with a flexible, relatively liquid investment option. What's more, Alpine Note — Basecamp can be rolled into another Alpine Note for compounding returns, or into another of EquityMultiple's rigorously vetted real estate investments, which also carry a minimum investment of just $5K. Basecamp is exclusively open to new investors on the EquityMultiple platform.Looking for fractional real estate investment opportunities? The Benzinga Real Estate Screener features the latest offerings.This article How NFL Legend Rob Gronkowski Turned A Near 1,000% Profit On His First Ever Stock Investment – After Forgetting He Owned The Shares originally appeared on Benzinga.com  View Comments (9) ", "tags": []}, {"title": "Warren Buffett Has Sold $133 Billion Worth of Stock in 2024 So Far, but This Small $550 Million Purchase Is Sending a Big Message to Investors", "link": "https://finance.yahoo.com/news/warren-buffett-sold-133-billion-103700973.html", "pubDate": "2024-12-07T10:37:00Z", "description": "In This Article:  AAPL   -0.08%  BAC   +0.02%  DPUKY   0.00%      Show Key Takeaways   Warren Buffett has sold $133 billion worth of stock in 2024, including significant stakes in Apple and Bank of America, which may indicate that he thinks these stocks are overpriced.However, Buffett's $550 million purchase of Domino's Pizza suggests that he still sees value in certain stocks, particularly smaller companies with strong fundamentals.Buffett's challenge is that he faces constraints in buying more of these smaller companies due to their limited market capitalization and Berkshire's massive asset base.The takeaway for investors is to consider smaller companies, which may offer more upside, and can be accessed through individual stocks or index funds and ETFs.  Generated by Yahoo Finance AI   Yahoo Finance used generative AI to summarize key information from this article. Some details may be inaccurate. We take that seriously. Reporting mistakes helps us improve these summaries. Was this helpful?  Yes   No    Warren Buffett has attracted a lot of attention this year thanks to some very big high-profile stock sales. The Oracle of Omaha has sold a total of $133 billion worth of equities from Berkshire Hathaway's portfolio through the first nine months of 2024.Some of the biggest sales include Apple (NASDAQ: AAPL), of which he sold more than two-thirds of Berkshire's stake, and Bank of America (NYSE: BAC). Despite the sales, Berkshire still holds $300 billion in stock, but only a handful of companies are safe from getting a trim these days, it seems.Are You Missing The Morning Scoop?  Breakfast News delivers it all in a quick, Foolish, and free daily newsletter. Sign Up For Free »Many see Buffett's massive stock sales as a big warning for investors that the stock market is overpriced and investors should reduce their exposure to equities. Indeed, Buffett's Apple and Bank of America sales suggest he thinks both stocks currently trade near or above their intrinsic values. Investors will be hard-pressed to earn solid returns buying stocks above their actual value, so it may be smart to trim positions like Apple or Bank of America.But Buffett doesn't think every stock is overpriced right now. It's just that he faces a unique challenge as someone in charge of managing $600 billion in assets when you include Berkshire's cash and Treasury bill positions. His stock purchases this year tell the whole story.  Image source: The Motley Fool.  This small $550 million purchase speaks volumesBerkshire's biggest equity purchase during the third quarter was about $550 million worth of Domino's Pizza (NYSE: DPZ). Yes, it pales in comparison to the $36 billion Buffett and his team sold in other stocks during the quarter, and the purchase accounts for just 0.2% of the entire equity portfolio. But the purchase accounts for 3.7% of the entire pizza purveyor.Domino's may be a great stock to buy. Its fortressing strategy has enabled it to grow its market share around the world. It's showing strong profitability at the store level even as it cannibalizes itself by opening new locations near existing ones. It's producing strong operating margin expansion and is returning capital to shareholders. These are all signs of a great company.Buffett's challenge is that Domino's market cap is currently less than $16 billion as of this writing. He could buy 20 companies the size of Domino's Pizza with Berkshire's cash pile if the market would let him.He has run into similar problems with other stocks he found attractive in 2024: Ulta Beauty has a market cap of about $17 billion, Sirius XM has a market cap of about $9 billion, Pool Corp has a market cap around $14 billion, and Heico has a market cap of $32 billion. The market constrains how much of those stocks Buffett can actually buy.  Story Continues He explained the challenge facing Berkshire in his letter to shareholders in February:There remain only a handful of companies in this country capable of truly moving the needle at Berkshire, and they have been endlessly picked over by us and by others. Some we can value; some we can't. And, if we can, they have to be attractively priced. In other words, the big companies where Buffett could invest tens of billions of dollars aren't very attractive right now -- at least not according to the consummate value investor, Warren Buffett.Bank of America's stock price has climbed to about 1.8 times its tangible book value, which might be more expensive than Buffett likes. (He notably stopped buying back Berkshire shares as the price floated above 1.6 times book value.)Apple shares currently trade for nearly 32 times forward earnings, far higher than the multiple Buffett originally paid while accumulating shares between 2016 and 2018, when shares consistently traded well below 20 times earnings.But the smaller companies like Domino's Pizza appear far more attractive. The restaurant's forward price-to-earnings ratio (P/E) of 27 is still somewhat expensive, but it compares favorably to other fast-growing quick-service restaurants. And while Buffett can only invest so much without significantly moving the market, an individual investor should have no problem buying as much as they like for their portfolio.The bigger takeaway for investorsBuffett's decision to buy Domino's last quarter doesn't necessarily mean investors should follow his lead precisely. In fact, it may indicate that he feels there are a lot more opportunities in the stock market than Berkshire can actually take advantage of due to its size.Domino's is a relatively small company for Berkshire to invest in, but it's still one of the members of the large-cap S&P 500 index. In other words, in the grand universe of the stock market, Domino's is bigger than roughly 80% of investable companies in the U.S. alone. Considering it's one of the smallest options Buffett could consider, that means there may be a whole lot of other opportunities in the mid- and small-cap markets.Indeed, stock valuations suggest Buffett would be much happier if he could invest more in companies with market caps less than Domino's. The S&P 500 trades for a forward P/E of 22.1 as of Dec. 2. If you get rid of the \"Magnificent Seven,\" the large-cap stocks look somewhat more attractive at a forward P/E of 19.5. Still, the mid-cap S&P 400 and the small-cap S&P 600 each trade for just 17.1 times forward earnings. That gap was even wider just a few months ago.Thus, the big message Buffett is sending to investors is to consider smaller companies. That could mean taking a closer look at individual stocks like Domino's Pizza, but it could be as simple as buying an index fund or exchange-traded fund (ETF).Vanguard offers the Vanguard Extended Market ETF (NYSEMKT: VXF), which tracks the performance of virtually all stocks except those in the S&P 500. With an expense ratio of just 0.06%, it can be an inexpensive way to add exposure to smaller companies.Another great option for those looking to focus on value stocks is the Avantis U.S. Small-Cap Value ETF (NYSEMKT: AVUV). It's technically an actively managed ETF, but it uses simple valuation and profitability filters to take the universe of small-cap value stocks and weed out potential value traps. It then invests in the remaining stocks, weighting each based on market cap. The results of the fund (and its predecessor at Dimension Funds) have been well worth the 0.25% expense ratio thus far.Whether you want individual stocks or ETFs, Buffett's buying decisions suggest there's a lot more upside for investors in smaller companies. They would be wise to listen to the message he's sending.Don’t miss this second chance at a potentially lucrative opportunityEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $376,143!* Apple: if you invested $1,000 when we doubled down in 2008, you’d have $46,028!* Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $494,999!* Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.See 3 “Double Down” stocks »*Stock Advisor returns as of December 2, 2024Bank of America is an advertising partner of Motley Fool Money. Adam Levy has positions in American Century ETF Trust-Avantis U.s. Small Cap Value ETF and Apple. The Motley Fool has positions in and recommends Apple, Bank of America, Berkshire Hathaway, Domino's Pizza, and Ulta Beauty. The Motley Fool recommends Heico. The Motley Fool has a disclosure policy.Warren Buffett Has Sold $133 Billion Worth of Stock in 2024 So Far, but This Small $550 Million Purchase Is Sending a Big Message to Investors was originally published by The Motley Fool  View Comments (2) ", "tags": ["AAPL", "BAC", "DPUKY"]}, {"title": "Does Billionaire Ken Griffin Know Something Wall Street Doesn't? The Citadel Chief Sold 91% of His Stake in Palantir and Is Piling Into This Stock-Split Stock Instead.", "link": "https://finance.yahoo.com/news/does-billionaire-ken-griffin-know-081000009.html", "pubDate": "2024-12-07T08:10:00Z", "description": "In This Article:  CMG   +0.28%   Billionaire Ken Griffin has made an indelible mark on Wall Street and has been cited as one of the most successful investors of all time. He famously predicted the 1987 stock market crash, known as \"Black Monday,\" shorting stocks ahead of the decline and making a veritable fortune. His hedge fund, Citadel Advisors, generated gains of 15% last year, turning a profit of $7 billion and outperforming many of his peers. This came on the heels of his blockbuster performance in 2022, when Citadel was named \"the most successful hedge fund ever,\" according to CNN, with a profit of $16 billion, the \"largest annual windfall on record,\" according to the report.Griffin is also a big proponent when it comes to the potential of generative artificial intelligence (AI). \"This branch of AI will be game-changing for the economy because it will take an enormous amount of work that's done today by people and do it in a distinctly different, highly automated, highly efficient way,\" Griffin said.Are You Missing The Morning Scoop?  Breakfast News delivers it all in a quick, Foolish, and free daily newsletter. Sign Up For Free »With that as a backdrop, it's notable that Griffin sold an eye-catching 91% of Citadel's stake in AI specialist Palantir Technologies (NASDAQ: PLTR) and is piling into a high-profile stock-split stock instead.  Image source: Getty Images.  Palantir has gone parabolicPalantir has more than two decades of experience in the field of AI, and it moved quickly when generative AI went viral early last year. The company developed its Artificial Intelligence Platform (AIP), a cutting-edge AI tool that helps businesses solve real-world problems using company-specific data. However, Palantir's biggest coup was developing hands-on sessions called boot camps, which pair customers with Palantir engineers to create these AI-fueled solutions.That strategy has been wildly successful. Palantir's U.S. commercial revenue, which includes AIP, jumped 54% year over year and 13% sequentially in the third quarter, while customers in the segment soared 77%. Furthermore, the segment's remaining deal value jumped 73%, suggesting its growth streak will continue.The results help illustrate why Palantir stock is up 295% over the past year and more than 1,000% since the start of 2023 (as of this writing). It also didn't hurt that Palantir was admitted to the S&P 500 on Sept. 23.In light of the company's ongoing winning streak and impressive stock price gains, it might seem surprising that Griffin went on a selling spree, dumping more than 5 million shares of Palantir stock and reducing his position by roughly 91%. However, the soaring stock price brought with it a commensurate increase in the valuation and Palantir closed out the third quarter selling for 98 times forward earnings. With a valuation of that magnitude, it isn't surprising that Griffin went bargain hunting.  Story Continues What's intriguing is that Citadel piled into Chipotle Mexican Grill (NYSE: CMG) stock.Want chips with that?There's little doubt Griffin believed Chipotle represented a compelling opportunity in the third quarter. The billionaire investor increased Citadel's stake by more than 7 million shares and increased his position by 454%. That brought his total stake to 8.64 million shares worth $552 million. Despite holding thousands of stocks, Chipotle is Griffin's 12th-largest individual stock holding.Chipotle has long been a pioneer in the fast-casual industry, bringing \"food with integrity\" to the mainstream. The company has employed a number of successful strategies to fuel demand, including an industry-leading customer loyalty program, a robust digital strategy, and the development of drive-thru \"Chipotlanes\" for mobile orders, with separate preparation lines to speed throughput.It hasn't all been smooth sailing, as the company was hit with a couple of troubling developments in the third quarter. In early July, Chipotle announced the pending retirement of CFO Jack Hartung in 2025. Just weeks later, the company got a second helping of bad news. Celebrated CEO Brian Niccol, who was credited with successfully reinvigorating the brand, was poached by Starbucks. The double dose of uncertainty sent fair-weather investors in search of greener pastures, sending the stock plunging.However, this news didn't have any impact on Chipotle's financial results. For the third quarter, revenue of $2.8 billion climbed 13%, while its diluted earnings per share (EPS) of $0.28 increased 22%. It's typically a good sign when profit grows faster than sales, as this suggests a level of spending discipline. Furthermore, Chipotle's comparable store sales increased 6%, fueled by both an increase in transactions and a higher average check.The company's consistently strong results help explain why Chipotle stock is up 46% over the past year and 103% over the past three years -- despite the economic headwinds. It also led to a 50-for-1 stock split earlier this year, which was completed on June 26, introducing a whole new generation of investors to the stock.We don't know for certain when during the third quarter that Griffin added to his stake in Chipotle, but we can make an educated guess by reviewing the stock chart. When excitement surrounding the stock split reached a fever pitch, Chipotle roared to a new all-time high, but the loss of two C-suite executives brought it back to earth. During a five-week period between June and July, the stock lost roughly 27% of its value. Griffin likely saw a deal that was simply too good to resist and piled into Chipotle stock to take advantage of the fire sale.In hindsight, it seems clear Griffin didn't know something that Wall Street doesn't. He was simply reacting to what he viewed as a clear opportunity. Should investors follow suit?Chipotle stock has rarely been cheap and currently sells for 58 times forward earnings, which might be off-putting for some investors. However, at the time of Chipotle's recent slump, the stock was trading for 45 times forward earnings, just below its five-year average multiple of 46, likely prompting Griffin's interest.Looking ahead to 2025, Wall Street expects Chipotle to generate EPS of $1.32, which works out to 48 times forward sales, which isn't much more than what Griffin paid. To be clear, that's a premium compared to a multiple of 31 for the S&P 500. That said, Chipotle stock is up more than 300% over the past five years (as of this writing), more than 3 times the 96% gains of the broader market.That helps illustrate why Chipotle stock is worthy of a premium and why it remains a buy.Don’t miss this second chance at a potentially lucrative opportunityEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $376,143!* Apple: if you invested $1,000 when we doubled down in 2008, you’d have $46,028!* Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $494,999!* Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.See 3 “Double Down” stocks »*Stock Advisor returns as of December 2, 2024Danny Vena has positions in Chipotle Mexican Grill, Palantir Technologies, and Starbucks. The Motley Fool has positions in and recommends Chipotle Mexican Grill, Palantir Technologies, and Starbucks. The Motley Fool recommends the following options: short December 2024 $54 puts on Chipotle Mexican Grill. The Motley Fool has a disclosure policy.Does Billionaire Ken Griffin Know Something Wall Street Doesn't? The Citadel Chief Sold 91% of His Stake in Palantir and Is Piling Into This Stock-Split Stock Instead. was originally published by The Motley Fool  View Comments  ", "tags": ["CMG"]}, {"title": "Prediction: 2 Stocks That Will Be Worth More Than Palantir Technologies 1 Year From Now", "link": "https://finance.yahoo.com/news/prediction-2-stocks-worth-more-111700355.html", "pubDate": "2024-12-07T11:17:00Z", "description": "In This Article:  AMAT   +0.58%  ARM.BA   +2.14%     Palantir Technologies (NASDAQ: PLTR) has witnessed a tremendous increase in its market value in 2024 thanks to a remarkable surge of 313% in the company's stock price so far this year.The company has a market cap of $162 billion as of this writing, up from around $35 billion at the beginning of the year. However, a closer look at Palantir's valuation indicates that it may have run ahead of itself. The software platform specialist has a price-to-sales ratio of a whopping 63, while its trailing earnings multiple stands at 345.Start Your Mornings Smarter! Wake up with Breakfast news in your inbox every market day. Sign Up For Free »Not surprisingly, Wall Street isn't expecting much upside from the stock over the next year. The 20 analysts covering Palantir have a 12-month median price target of $38, which would be a 46% drop from current levels. If that does indeed happen, its valuation could drop big time in the coming year.Of course, the company may be able to justify its expensive valuation thanks to the rapidly growing demand for artificial intelligence (AI) software platforms, a market where it is the leading player. But if cracks emerge in Palantir's growth story, especially as stiff competition grows from bigger and smaller players in the enterprise AI software space, there is a good chance investors will start booking profits -- leading the stock to fall.This could pave the way for Arm Holdings (NASDAQ: ARM) and Applied Materials (NASDAQ: AMAT) to overtake Palantir's valuation in the next year. Let's see why these two companies may be worth more than Palantir in 2025.1. Arm HoldingsWith a market cap of just under $148 billion, Arm Holdings isn't very far from Palantir's valuation. And Arm stock has delivered impressive returns of 87% in 2024 due to the important role the company plays in the global semiconductor market.Arm licenses its architecture and intellectual property (IP) to semiconductor companies and consumer electronics manufacturers so that they can develop different types of chips such as central processing units (CPUs), graphics processing units (GPUs), and microprocessors, among other things. The company's chip architecture is used across multiple industries including smartphones, data centers, computers, and automaking.Arm enjoys a healthy market share in many verticals. For instance, in mobile applications, it has a market share of more than 99%. Its share of the consumer electronics chip market stands at 30%. Even better, it is gaining ground in fast-growing niches such as cloud computing and networking equipment, where it now commands 15% and 28% market shares, respectively, as compared to 9% and 23% a couple of years ago.  Story Continues And its share of the automotive chip market has increased to 47% from 43% in a couple of years. In all, Arm estimates that its architecture and IP control 47% of the global chip market's $214 billion value. The company expects to benefit from the growing complexity of chips deployed in its end markets thanks to the emergence of technologies such as AI.And that's why it has seen an increase in demand for its architecture licenses. It ended the second quarter of fiscal 2025 with 39 Arm Total Access licenses, up from 33 in the preceding quarter. The number of Arm Flexible Access licensees increased to 269 from 241 in the preceding quarter.This increase in the number of licenses it's selling bodes well because chips developed using these licenses will result in royalty revenue. The company already gets around 50% of its royalty revenue from chip architectures launched more than 10 years ago.Management expects its revenue in the current fiscal year to jump to $3.95 billion from $3.23 billion in fiscal 2024, an increase of 22%. Its earnings guidance of $1.55 per share would be a 22% increase from fiscal 2024 levels of $1.27 per share.The company's growth is expected to accelerate in the next fiscal year, with revenue predicted to jump 25% to $4.93 billion and earnings expected to increase by 32% to $2.05 per share. Analysts forecast this stronger growth will lead to more upside for the stock. The 12-month median price target of $160 would be a 14% jump from current levels.As such, there is a good chance that it could overtake Palantir's valuation next year, especially considering that Arm's earnings growth then is expected to be stronger than Palantir's estimated bottom-line growth of 25%.2. Applied MaterialsApplied Materials hasn't set the stock market on fire in 2024, having gained just 13% so far this year, but 2025 could be much better for the company. Global spending on semiconductor equipment is expected to increase by a much faster pace of 24% in 2025 following a 4% increase this year, according to the industry association SEMI.Applied Materials sells manufacturing equipment and provides services and other software for the semiconductor and display industries. The company's revenue in fiscal 2024 (which ended on Oct. 27) increased just 2% to $27.1 billion. Its adjusted earnings, on the other hand, jumped 7% to $8.65 per share.Consensus estimates are projecting a 9% increase in its revenue in the current fiscal year to $29.6 billion, along with a 10% increase in earnings to $9.54 per share. And there is a good chance the company has stronger growth thanks to the rising demand for AI-related chipmaking equipment.Management said on its November earnings conference call that the booming demand for memory capacity in AI data centers led to a 60% increase in the company's sales of DRAM (dynamic random-access memory) equipment in fiscal 2024.This trend is likely to continue as the demand for high-bandwidth memory (HBM) that's deployed in AI data centers is expected to double next year. At the same time, Applied Materials is likely to benefit from the transition to more advanced chipmaking technology for tackling AI workloads, which should increase its addressable market substantially.All this tells us why analysts are upbeat about the company's prospects over the next year. The stock carries a 12-month median price target of $225, which would be a 23% increase. Given its current market cap of almost $151 billion, it won't be surprising to see it overtake Palantir's valuation over the next year.Applied Materials trades at just 19 times forward earnings. So, if the market decides to reward its stronger growth with a richer valuation, the stock could easily deliver stronger gains than analysts are estimating.Should you invest $1,000 in Arm Holdings right now?Before you buy stock in Arm Holdings, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Arm Holdings wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $889,004!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of December 2, 2024Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Applied Materials and Palantir Technologies. The Motley Fool has a disclosure policy.Prediction: 2 Stocks That Will Be Worth More Than Palantir Technologies 1 Year From Now was originally published by The Motley Fool  View Comments  ", "tags": ["AMAT", "ARM.BA"]}, {"title": "Nvidia analyst predicts ‘jaw-dropper’ Q3 earnings—others on Wall Street are not so sure", "link": "https://finance.yahoo.com/news/nvidia-analyst-predicts-jaw-dropper-192413932.html", "pubDate": "2024-11-19T19:24:13Z", "description": "In This Article: \n                                StockStory Top Pick   NVDA   -1.81%    The world’s hottest company is back to wrap up tech earnings season. Money managers are waiting nervously as Nvidia gets set to reveal its latest quarterly results on Wednesday afternoon. While Wall Street is expecting another strong showing for Q3—Visible Alpha predicts revenue will increase 84% year over year to $33.2 billion—all eyes are on the chip giant's forecast for the final quarter of the year.That’s because the company’s next-generation GPU offering, or Blackwell, is scheduled to start hitting the bottom line. CEO Jensen Huang has touted “insane” demand for the new platform, which represents a dramatic step up in performance from the so-called Hopper chips that have fueled the AI boom. It’s a dramatic show of innovation and strength from a company that has seen its shares skyrocket more than 800% over the last two years, with the company adding more than $3 trillion in market cap to trade places with Apple as the world's largest company.Wedbush Securities’ Dan Ives, one of Wall Street’s most prominent tech bulls, is anticipating another blowout release, saying that a $2 billion revenue beat and similar raise to Q4 guidance will signal that the AI party is just getting started.\"We expect another jaw-dropper tomorrow from the Godfather of AI Jensen that will put jet fuel in this bull market engine,” Ives and other Wedbush analysts wrote in a note.Others who follow the stock, however, are sounding a more cautious note. Multiple analysts told Fortune Wednesday’s call could prove to be a “sell the news” event. That’s what happened last quarter, even though the company comfortably beat earnings and revenue expectations as sales grew over 122% year over year.The stock dropped 18% in the week following the call, trading just north of the $100 mark, as investors pocketed their gains. The stock has gained roughly 40% since, however. Shares rose about 4% Tuesday, moving above the $145 threshold, in anticipation of another blowout release.Nonetheless, the stage may be set for another round of immense profit-taking, according to Ted Mortonson, a managing director and technology desk sector strategist at Baird. Retail investors, he said, often trade on “FOMO,” or the fear of missing out. By contrast, he added, institutions will likely be driven by what he dubbed “FOGK.”“That’s fear of getting killed,” he said.With the stock nearly tripling year to date, he explained, his clients have won. They aren’t looking to give up those gains heading into the end of the year.Blackwell delays could prompt muted guidanceHow the stock moves after Wednesday’s call will likely have a lot to do with what the company says about Blackwell. Jensen previously said the groundbreaking platform should account for “several billions” of additional revenue starting in Q4, but Angelo Zino, a vice president and senior analyst at CFRA Research, said he believes Wednesday’s forecast will be relatively conservative.  Story Continues Both he and Mortonson are unsurprised Blackwell’s rollout has run into production delays. A recent report from The Information, a tech-focused publication, said overheating issues had compelled Nvidia to ask suppliers to adjust the design of the platform’s server racks.Instead of simply selling stand-alone chips, Zino explained, Nvidia is marketing Blackwell as a platform offering with configurations that can be customized to fit different customers’ needs.“You’re talking about compute power and speeds on memory and networking that we’ve never seen before,” Mortonson said.That also means there are many more moving parts on Nvidia’s end, however. Zino said it’s likely the delivery of some systems will be pushed to 2025, prompting the company to be less aggressive in issuing guidance.“Given that there's more that can go wrong, you want to provide a little bit of a buffer going into this January quarter,” Zino said, “just in case.”That could set up Nvidia for some more massive earnings beats early next year. By Nvidia’s lofty standards, however, Wednesday’s results and forecast could be a bit pedestrian. If that happens, Mortonson said, big investors could be quick on the trigger to sell.Retail traders, he added, are taking a knife to a gunfight. “It’s a casino stock,” he said, “so good luck to them.”This story was originally featured on Fortune.com  View Comments (19) ", "tags": ["NVDA"]}, {"title": "2 AI Stocks to Buy in December and Hold for 20 Years", "link": "https://finance.yahoo.com/news/2-ai-stocks-buy-december-101500733.html", "pubDate": "2024-12-07T10:15:00Z", "description": "In This Article:  AMD   -1.96%  NVDA   -1.81%  INTC   +0.58%     Every decade seems to create a new wave of growth stocks that benefit from the latest trends in the economy. The last 20 years have created tremendous wealth for investors who jumped early on the growth of e-commerce (Amazon), streaming video (Netflix), and electric cars (Tesla). Artificial intelligence (AI) has the makings of the next wealth-building opportunity in the stock market.The AI market is expected to grow from $184 billion in 2024 to $826 billion by 2030, according to Statista. Here are two stocks that many investors may wish they had bought in another 20 years.Start Your Mornings Smarter! Wake up with Breakfast news in your inbox every market day. Sign Up For Free »1. SoundHound AIAI-powered voice assistants are starting to see widespread adoption for things like customer service and smart ordering, but it could create many new use cases in electric cars and other markets over the next decade. SoundHound AI (NASDAQ: SOUN) is emerging as the leader in this market. It's a relatively small company that is experiencing rapid growth.SoundHound has a trailing revenue of $67 million, which provides the foundation for explosive returns in the coming years as more businesses adopt its technology. Its third-quarter revenue grew 89% year over year, partly boosted by the recent acquisition of Amelia, but it was already reporting high growth before that, with revenue up 54% year over year in Q2.SoundHound is in the process of expanding its customer base beyond automotive and restaurants, which have been its focus, to other markets like retail, healthcare, and banking. This will significantly expand its addressable market and help the company scale to improve margins. Last year, SoundHound's top five customers comprised over 90% of the business but now represent less than a third.Another encouraging sign about SoundHound's growth prospects is the list of partnerships with other leading tech companies. Nvidia, Samsung, Oracle, and ServiceNow are among the companies working with the AI voice leader.The main negative against SoundHound AI is a lack of profitability, but this is not unusual for a small tech company. Management expects the business to achieve positive adjusted earnings before interest, taxes, depreciation, and amortization (EBITDA) by the end of 2025, which is a catalyst for the share price. Investors have the opportunity to get in on the ground floor before Wall Street catches on to this emerging growth story and bids the share price higher.2. Advanced Micro DevicesAdvanced Micro Devices (NASDAQ: AMD) shares tripled over the last five years as it gained market share against Intel. AMD is a leading supplier of central processing units (CPUs), graphics processing units (GPUs), System-on-a-Chip (SoC), and other products for a variety of markets. However, the growing demand for its data center GPUs continues to show why the shares can deliver outstanding returns.  Story Continues Data center revenue jumped 122% year over year in Q3 to $3.5 billion, which helped drive AMD's total revenue up 18%. Management credited higher data center revenue to strong demand for its Instinct family of GPUs. As more advanced AI models launch and more use cases emerge for this technology, it could drive significantly more demand for AMD's chips.Last year, management estimated the data center AI chip market to grow from $45 billion in 2023 to more than $400 billion in 2027. But after its data center business exceeded revenue estimates in 2024, management recently updated its long-term forecast and now anticipates the market for AI accelerators to reach $500 billion by 2028.The writing is on the wall for investors. The adoption of AI is causing new leaders to emerge in the semiconductor industry. AMD generated more data center revenue last quarter than Intel. Intel dominated the CPU market for decades, but the AI boom now favors companies with expertise in developing GPUs, which are essential for training AI models.Nvidia is the other GPU supplier that could be a good choice for investors, but AMD still has a lot of opportunity to gain share on Intel in CPUs, which may not be fully reflected in the stock's valuation. With AMD stock currently down 33% from its recent high, it's a great time to start an investment before more growth sends the stock higher.Should you invest $1,000 in SoundHound AI right now?Before you buy stock in SoundHound AI, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and SoundHound AI wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $889,004!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of December 2, 2024John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. John Ballard has positions in Advanced Micro Devices, Nvidia, SoundHound AI, and Tesla. The Motley Fool has positions in and recommends Advanced Micro Devices, Amazon, Intel, Netflix, Nvidia, Oracle, ServiceNow, and Tesla. The Motley Fool recommends the following options: short February 2025 $27 calls on Intel. The Motley Fool has a disclosure policy.2 AI Stocks to Buy in December and Hold for 20 Years was originally published by The Motley Fool  View Comments (1) ", "tags": ["AMD", "NVDA", "INTC"]}, {"title": "Prediction: This Will Be 2025's Top-Performing Artificial Intelligence (AI) Stock", "link": "https://finance.yahoo.com/news/prediction-2025s-top-performing-artificial-123500888.html", "pubDate": "2024-12-07T12:35:00Z", "description": "  Picking the top-performing artificial intelligence (AI) stock a year out isn't easy. In 2023, it ended up being Nvidia. In 2024, all signs are pointing toward Palantir Technologies. This shift from AI hardware to AI application software was predictable because it has to be deployed and become useful at some time for all of the investment dollars in hardware to pay off.As a result, I think we'll see another AI software company rise to the top in 2025. My prediction is that it will be SoundHound AI (NASDAQ: SOUN), even though it has already had an incredibly strong 2024, rising over 300%. So, how can a company that has already risen so much be a top pick for 2025?Are You Missing The Morning Scoop? Wake up with Breakfast news in your inbox every market day. Sign Up For Free »SoundHound's reach has widened in 2024SoundHound AI's platform is centered around taking a voice input and turning it into a prompt for an AI platform. This has multiple uses, including automaking, restaurants, financial services, insurance, and healthcare. The company already has products serving those industries, and automakers and restaurants are some of its largest clients.Still, the company has become quite diversified in 2024. During last year's third quarter, 72% of revenue came from one client, and 90% of total revenue came from the automotive sector. Now, the largest client contributed only 12% of revenue, and the largest sector made up 25% of revenue.That diversification is a key part of SoundHound becoming more relevant in all industries and turning into a more stable company. If that single client left in late 2023, it might have caused the business to go belly up. If its largest client leaves now, it will still hurt, but not as much as it would have before.While SoundHound still has risks associated with it, this plays a huge part in lowering that risk level.In the third quarter, revenue grew 89% year over year to $25.1 million. This makes it a small-cap stock, as its revenue in the past 12 months totals $67 million. For other, more established software companies, that would be a fairly small percentage of overall revenue, but the company isn't expected to stay there for long.Management projects 2025 revenue will come in between $155 million and $175 million, which is nearly double the revenue it projects for 2024. Clearly, SoundHound expects its business to maintain its boom for 2025.This also highlights a key investment point: How high is the limit if its products become the industry standard in audio recognition? Think of all the ways we use voice to control what we do; now, imagine that being associated with the power of AI. SoundHound could become a huge winner in this space, even after it has run up so much.  Story Continues A lot of success is built into its stock pricePerhaps the biggest risk with SoundHound is its valuation. Investors need to be aware of the success that's already baked into the stock's price. Its valuation tips the scales at around 40 times sales, which historically is very expensive.  SOUN PS ratio, data by YCharts; PS = price to sales. However, we also know that SoundHound's current trailing-12-month revenue is set to triple by the time 2025 ends (if management's projections come true), which would price the stock in a more reasonable valuation range -- somewhere around 20 times sales. The problem is that the stock must stay at the same price. If the company's business continues to boom, its stock isn't going to stay put.Although I'm excited about 2025, it's clear that all of that year's financial growth is already assumed in the stock price. As a result, if the business stumbles, the stock will take a nosedive.Still, I think there are hefty tailwinds blowing in SoundHound's favor, and I wouldn't be surprised if management ends up beating 2025 expectations, since it has raised its guidance multiple times in 2024 (that year's revenue was originally projected to be between $63 million and $77 million; current guidance is for $82 million to $85 million).If SoundHound AI forecasts that it will continue doubling its revenue in 2026, I think that would keep the hype going in the stock, and be enough to propel it to become the best-performing AI stock in 2025.Should you invest $1,000 in SoundHound AI right now?Before you buy stock in SoundHound AI, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and SoundHound AI wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $889,004!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of December 2, 2024Keithen Drury has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia and Palantir Technologies. The Motley Fool has a disclosure policy.Prediction: This Will Be 2025's Top-Performing Artificial Intelligence (AI) Stock was originally published by The Motley Fool  View Comments  ", "tags": []}, {"title": "Same Yield, but No Comparison on Value: Chevron vs. Kinder Morgan", "link": "https://finance.yahoo.com/news/same-yield-no-comparison-value-091600802.html", "pubDate": "2024-12-07T09:16:00Z", "description": "In This Article:  CVX   -2.57%  KMI   -0.72%  ^GSPC   +0.25%   Investors have to make trade-offs every time they buy a stock. There's the balance between risk and reward from the specific investment they choose to own. But there's also an opportunity cost, because buying one stock usually means not buying another, perhaps similar, stock. This is where a comparison of Kinder Morgan (NYSE: KMI) and Chevron (NYSE: CVX) comes in today, with both of these dividend stocks offering yields of roughly 4% right now.What does Kinder Morgan do?Kinder Morgan operates in the midstream segment of the broader energy industry. That means that it owns vital energy infrastructure like pipelines, storage, and transportation assets. It is focused on North America, where the majority of its income comes from the fees that it charges to other companies for the use of its assets. The midstream is probably the most consistent cash-flow generator within the energy sector.Are You Missing The Morning Scoop? Wake up with Breakfast news in your inbox every market day. Sign Up For Free »Essentially, Kinder Morgan is a toll taker. Demand for oil and gas, and the other products transported through its system, is more important to its financial results than the price of oil and gas. Demand for energy tends to remain high even when prices are low because oil and natural gas are so vital to economic activity.What does Chevron do?Chevron is a vastly different entity. As an integrated energy giant, Chevron operates in the upstream (oil and gas production), the midstream (pipelines), and the downstream (chemicals and refining). Each of these segments performs a little differently through the business cycle. As noted, the midstream is a fairly stable segment, performance wise, while the upstream and downstream are both pretty volatile and commodity driven. That said, the upstream and downstream often diverge, since oil and natural gas are key inputs into the chemical and refining businesses.Thus, having broad exposure across the energy sector tends to soften the highs and lows of the volatile energy sector over time. On top of that, Chevron has a history of being fiscally conservative with its balance sheet, allowing it to take on debt during oil downturns so it can continue to fund its business and support its dividend. All in, Chevron is one of the more conservative ways to gain exposure to the energy sector if you want to own a company that produces oil and natural gas.Why Chevron beats Kinder Morgan right nowThe midstream sector is generally known as a good fishing pool for high-yield stocks. To that end, Kinder Morgan's dividend yield is a touch over 4% right now. That compares favorably to the S&P 500 index, which is only yielding 1.2%, and the average energy stock's 3.3% yield. But some of Kinder Morgan's closest peers have yields that are 6% or higher.  Story Continues This, however, is where things get interesting. Chevron's dividend yield is currently around 4%, too. To be fair, it is a very different company, as noted. However, Chevron has increased its dividend annually for 37 consecutive years despite the increased volatility inherent in its business model. Kinder Morgan cut its dividend in 2016. Notably, Kinder Morgan's dividend cut came after it had told investors that they should expect a dividend increase of as much as 10%! Kinder Morgan went back on its word again in 2020, when it pushed through a dividend increase of 5% instead of the 25% it had earlier promised.  CVX Dividend Per Share (Quarterly) data by YCharts What was happening in 2016 and 2020? The energy sector was facing headwinds. So, right when investors were probably relying on Kinder Morgan to support its dividend, it didn't. Chevron, despite having material exposure to volatile energy prices, didn't skip a beat on its dividend during those difficult periods. It is, in the end, the more reliable dividend stock.Chevron is probably the better optionGiven that Chevron and Kinder Morgan have such similar yields today, it is hard to suggest that Kinder Morgan is the better energy investment for income-focused investors. That's particularly true given the very different paths their dividends have taken. If you are looking for a high-yield energy investment, the risk/reward balance here seems to favor Chevron. Or if you are leaning toward Kinder Morgan, at the very least consider some of its higher-yielding peers, like Enterprise Product Partners and Enbridge, which both have better histories with regard to the income streams they offer investors.Should you invest $1,000 in Kinder Morgan right now?Before you buy stock in Kinder Morgan, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Kinder Morgan wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $889,004!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of December 2, 2024Reuben Gregg Brewer has positions in Enbridge. The Motley Fool has positions in and recommends Chevron, Enbridge, and Kinder Morgan. The Motley Fool recommends Enterprise Products Partners. The Motley Fool has a disclosure policy.Same Yield, but No Comparison on Value: Chevron vs. Kinder Morgan was originally published by The Motley Fool  View Comments  ", "tags": ["CVX", "KMI", "^GSPC"]}, {"title": "TD Earnings: Shares Continue to Look Intriguing after Poor Results", "link": "https://finance.yahoo.com/news/td-earnings-shares-continue-look-225700659.html", "pubDate": "2024-12-06T22:57:00Z", "description": "In This Article:  RBCPF   -3.85%  RY   -1.54%  RYLBF   0.00%  TD   -1.59%  TDBKF   0.00%   The Toronto-Dominion Bank (TD) (TSE:TD), Canada’s second-largest financial institution with a sizable retail banking operation in the United States, has had a rough year. From a business perspective, the company recently settled an anti-money laundering (AML) violation with the U.S. Department of Justice (DOJ) and has posted poor results.Don't Miss our Black Friday Offers:Unlock your investing potential with TipRanks Premium - Now At 40% OFF! Make smarter investments with weekly expert stock picks from the Smart Investor Newsletter For investors, TD is the only major Canadian bank whose stock has experienced losses this year, and it’s not insignificant. Shares of TD (NYSE listing) have fallen some 17% thus far in 2024, while the second-worst performing Canadian bank stock is Bank of Montreal (BMO), which is sitting on a tidy 12% YTD gain.Amidst the weakness comes long-term opportunity, however, and this represents a rare occasion where a major financial institution can be purchased for a P/E ratio of under 10x. I believe it’s worthwhile for patient investors to consider TD at this juncture. As a result, I have a Buy rating on TD Shares.  A Closer Look at TD Bank’s OperationsTD has 4 major divisions, which are:Canadian Banking U.S. Retail Banking Wealth Management Wholesale Banking TD’s entry into the United States was propelled by the 2005 acquisition of BankNorth, which was based in Vermont. It then solidified its U.S. presence by acquiring another east coast institution, Commerce Bank, in 2007. By the time I started visiting New York City for work in 2013, TD’s green logo could be found throughout Manhattan.Interestingly, though, the U.S. retail banking segment hasn’t been the primary growth driver for TD in recent years and accounted for about one-third of overall adjusted net income in Q3 2024. Canadian banking operations continue to be the backbone of the company, and that’s a good thing, given TD’s recent troubles south of the border. Further, the Wealth Management and Wholesale Banking divisions tend to deliver less predictable results, and notably, the IPO market has been relatively poor lately.It’s important to mention that TD also owns a ~10% interest in shares of Charles Schwab (SCHW), whose stock has rebounded some ~30% over the past few months.TD’s Recent Regulatory TroublesIt’s always challenging to buy a stock on bad news, but I’ve taken a bullish stance on TD stock following its recent regulatory problems in the United States. The company was charged by the DOJ with violating anti-money laundering rules by administering weak controls and surveillance of cash movement. It was alleged that at least three money laundering networks were able to transfer more than $650 billion of funds through TD accounts.  Story Continues TD reached a US$3.1 billion settlement with the DOJ in October, a fine that could have been higher were TD uncooperative in the investigations. While shares fell about -6.4% on the day of the announcement, the size of the fine was not surprising, as TD had already taken provisions of more than $3 billion. What likely caught the market off guard was the asset limit imposed by regulators. TD must abide by an asset cap of US$434 billion within its U.S. retail banking division. That essentially eliminates any growth prospects for TD’s own banking operations in the United States.However, the bank’s U.S. operations have long been posting mediocre results, and the optimistic way of looking at the situation is from the view that TD can refocus on operating efficiencies as opposed to growth. Meanwhile, of course, TD shares have retreated into value territory.Q4 2024 Results and 2025 GuidanceOn Thursday (December 5), TD reported its fourth quarter and full-year results for 2024 (Canadian banks set their fiscal year from November 1 to October 31). Diluted earnings per share were C$1.97 for Q4 and C$4.72 for the full year, which represented an EPS decline of nearly 15%. However, investors shouldn’t forget about the ~US$3.1 billion settlement charge. On an adjusted basis, Q4 and 2024 EPS figures came in at C$1.72 and C$7.81, respectively, which is still slightly lower than it was in 2023.The American operations accounted for much of the weakness due to higher credit loss provisions, higher non-interest expenses, and a dip in revenue. TD has been working to shore up its transaction monitoring processes, including related hiring and training. It’s no surprise that expenses are up. Still, TD’s Canadian banking operations continue to deliver, and Q4 2024 net income for this division rose 9% from the same period last year.That matches what Royal Bank of Canada (RY) reported for Q4 earlier this week. Meanwhile, Bank of Montreal (BMO), which also reported earnings, revealed that their adjusted net income from Canadian banking operations fell 17% year-over-year. So, TD’s results continue to be decent where it counts the most. One worrisome takeaway from TD’s press release, however, is the announcement that management “is suspending the following medium-term financial targets: 7-10% adjusted EPS growth, 16%+ return on equity and positive operating leverage.”Do Wall Street Analysts Recommend TD Bank?Although analyst ratings are subject to updates following TD’s earnings release, Wall Street generally views TD stock as undervalued. I also share that view.Of the nine Wall Street analysts that cover TD Bank, there are three Buy ratings, five Hold ratings, and one Sell rating. While that represents a consensus Hold rating, the average TD stock price target is $62.15, which suggests about 17.7% potential upside from the recent trading price.  See more TICKER analyst ratingsValuation and ConclusionFollowing today’s further share price decline, TD stock is trading at just 9.65x its adjusted EPS for the year that just passed. As the company continues its remediation of Anti-Money Laundering controls and invests in risk management, earnings growth will be challenged. I’m disappointed that TD management suspended previous guidance instead of choosing to update it, and that may raise some concern that the executive team has limited visibility.With that said, CEO Bahrat Masrani is set to retire in the next few months, and it makes logical sense to allow the incoming new chief executive an opportunity to reset near-term financial goals.At the end of the day, I have confidence that TD will get back on track. It may take some time, but at today’s stock price, the valuation is too good to pass up. Rarely does a major bank go on sale for below 10x earnings. At that multiple, I can stomach a temporary stall in growth and continue to hold a Buy rating on TD.Disclosure  View Comments  ", "tags": ["RBCPF", "RY", "RYLBF", "TD", "TDBKF"]}, {"title": "Should You Forget Palantir and Buy These 2 Artificial Intelligence (AI) Stocks Instead?", "link": "https://finance.yahoo.com/news/forget-palantir-buy-2-artificial-110500632.html", "pubDate": "2024-12-07T11:05:00Z", "description": "In This Article:  APP   +5.92%  S   +3.58%  CRWD   +0.22%   Having nearly quadrupled this year while also joining the S&P 500 index, Palantir (NASDAQ: PLTR) has no doubt gained a lot of investor attention. However, with the stock trading at a very frothy valuation and insiders selling, the question is should investors turn their attention to other companies that are benefiting from artificial intelligence (AI)?The biggest knock on Palantir is not its business, which has been seeing accelerating growth as commercial and government customers begin adopting its AI platform, but a valuation that has ballooned to a forward price-to-sales (P/S) multiple of 45.7 times analyst estimates for 2025 revenue, and a staggering 147 times forward price-to-earnings (P/E) ratio, as of this writing.Are You Missing The Morning Scoop?  Breakfast News delivers it all in a quick, Foolish, and free daily newsletter. Sign Up For Free »That's a valuation well above where SaaS companies traded at their heights back in 2020-2021. Insiders, meanwhile, have aggressively been selling shares in recent months, including CEO Alex Karp and Chairman Peter Thiel, among others.   Against that backdrop, let's look at two cheaper AI stocks growing revenue at a similar rate as Palantir that investors could consider as alternatives.AppLovinFor those unfamiliar with AppLovin (NASDAQ: APP), it is an adtech company for the mobile gaming industry. It also owns a legacy portfolio of apps as well.AppLovin has been growing its revenue at a faster pace than Palantir, with revenue growth of 39% last quarter compared to 30% for the latter. The company's strong growth stems from its Axon-2 AI-powered adtech platform, which has helped transform how mobile gaming app companies attract new users and better monetize their games.Since its launch in the second quarter of last year, AppLovin has seen tremendous growth from its software platform business, as existing customers have spent more money on its platform and its gained new customers.More importantly, from an investing standpoint, while AppLovin's stock have has actually outperformed Palantir this year, up about 750% as of this writing, it continues to trade at a much more reasonable forward price-to-earnings (P/E) of 54 based on 2025 analyst estimates, and a price/earnings-to-growth (PEG) of 1.2.  APP PE Ratio (Forward 1y) data by YCharts.  A PEG ratio of under 1 is generally considered undervalued, but growth stocks such as AppLovin will often command multiples well above 1. Similarly, the stock is tradeing at a more modest 22.5 times next year's expected sales.  Story Continues AppLovin appears to have clearly taken business away from rival Unity Software, whose similar Grow Solutions segment saw revenue fall 5% last quarter to $298 million. That compares to the 66% year-over-year growth in revenue to $835 million that AppLovin saw for its software platform revenue.Going forward, the company thinks it can grow its mobile gaming customer revenue by between 20% to 30% a year. However, it has a huge opportunity as it looks to extend its platform into other verticals, starting with e-commerce. The company has begun piloting this solution with early strong results, and management expects it to be a meaningful contributor to revenue next year.If AppLovin's Axon-2 adtech platform can successfully move beyond mobile gaming and into the broader e-commerce category, there should be strong continued upside in its stock.  Image source: Getty Images.  SentinelOneWhile Palantir and AppLovin stocks have had great years, the same can't be said for SentinelOne (NYSE: S), whose shares are about breakeven on the year as of this writing. However, the company continues to have strong potential moving forward.SentinelOne is a cybersecurity company whose Singularity Platform uses AI to predict, monitor, and eliminate threats. It can be deployed in public, private, or hybrid cloud environments and is an endpoint protection solution that is a rival to CrowdStrike.One of the company's big selling points is that its platform can automatically roll back any changes to before an attack occurs. This feature has gained more attention after the major CrowdStrike outage, as CrowdStrike customers had to implement time-consuming manual fixes that crippled their businesses, such as Delta Airlines, which has sued CrowdStrike for the loss of $500 million in revenue. For its part, CrowdStrike has countersued its customer, claiming that it was Delta's own negligence that led to its issues.SentinelOne had already been growing its revenue quickly before the incident, with revenue growth of 36% in the first half of its fiscal year ended July 31. Given its size, any additional business that comes its way as a result of the CrowdStrike outage will be a big bonus.Meanwhile, earlier this year the company scored a major win when it agreed to a deal with Lenovo to provide endpoint security for all the new personal computers (PCs) it sells. Lenovo is the world's biggest PC vendor with about a 25% market share, selling approximately 59 million PCs last year. Lenovo will also give current customers the option to upgrade their security to SentinelOne's Singularity Platform, and it will build a new Managed Detection and Response (MDR) service using AI and EDR (endpoint detection and response) capabilities based on SentinelOne's Singularity Platform.      The Lenovo deal and any additional business that may come its way as a result of the CrowdStrike outage should power SentinelOne's growth in 2025 and beyond. Meanwhile, the stock is not pricey, trading at a P/S multiple of under 8.5 with over 30% revenue growth.  S PS Ratio (Forward 1y) data by YCharts.  The combination of strong growth and an attractive valuation make SentinelOne an alternate AI investment to consider.Should you invest $1,000 in AppLovin right now?Before you buy stock in AppLovin, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and AppLovin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $889,004!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of December 2, 2024Geoffrey Seiler has positions in SentinelOne. The Motley Fool has positions in and recommends AppLovin, CrowdStrike, Palantir Technologies, and Unity Software. The Motley Fool recommends Delta Air Lines. The Motley Fool has a disclosure policy.Should You Forget Palantir and Buy These 2 Artificial Intelligence (AI) Stocks Instead? was originally published by The Motley Fool  View Comments  ", "tags": ["APP", "S", "CRWD"]}, {"title": "Missed Out on Nvidia? Buy This Magnificent Artificial Intelligence (AI) Stock Before It Soars at Least 43% in 2025.", "link": "https://finance.yahoo.com/news/missed-nvidia-buy-magnificent-artificial-124500050.html", "pubDate": "2024-12-07T12:45:00Z", "description": "In This Article:  NVDA   -1.81%  MRVL   +0.12%   Artificial intelligence (AI) has helped Nvidia's (NASDAQ: NVDA) stock clock stellar gains in 2024, with shares of the semiconductor giant rising more than 183% as of this writing, but it seems that investors are now having doubts about the company's ability to maintain its stunning growth rate over the long run.This is probably why Nvidia stock has retreated despite delivering better-than-expected numbers and guidance last month. The company's revenue for the third quarter of fiscal 2025 increased an impressive 94% from the year-ago period to $35.1 billion, while earnings jumped 103% year over year to $0.81 per share.Start Your Mornings Smarter! Wake up with Breakfast news in your inbox every market day. Sign Up For Free »However, Nvidia's revenue guidance of $37.5 billion for the current quarter suggests that its top line is on track to increase at a relatively slower pace of 70% from the year-ago quarter. Additionally, the margin pressure that the company will face in the near term on account of the rollout of its Blackwell processors seems to have dented investors' confidence.Of course, Nvidia can overcome these challenges and deliver more gains to investors. However, those who missed out on Nvidia's rally and are looking for a relatively cheaper AI stock that isn't trading at an expensive 31 times sales can consider taking a closer look at Marvell Technology (NASDAQ: MRVL). Let's look at the reasons why.Marvell's business is taking off thanks to AIMarvell Technology released its fiscal 2025 third-quarter results (for the three months ended Nov. 2) on Dec. 3. The chipmaker's total revenue increased 7% year over year to $1.52 billion, which was higher than the consensus expectation of $1.46 billion. Its non-GAAP (adjusted) earnings increased to $0.43 per share from $0.41 per share in the year-ago period, again beating the consensus estimate of $0.41.You might be wondering why Marvell may be a good alternative to Nvidia considering its slow pace of growth, but a closer look at the company's data center business will reveal the true picture. The data center segment produced 73% of Marvell's top line last quarter, up from 39% in the year-ago period. The segment's revenue nearly doubled on a year-over-year basis to $1.1 billion, offsetting the steep declines that the company witnessed in other segments such as enterprise networking, carrier infrastructure, automotive/industrial, and consumer.The good part is that the strength of Marvell's data center business, which is benefiting from the growing demand for custom AI processors and optical networking equipment, will be enough to lift the company's growth higher in the current quarter. That's evident from Marvell's fiscal fourth-quarter revenue guidance of $1.8 billion, which would be a 26% jump from the year-ago period. Analysts would have settled for $1.65 billion in revenue from Marvell for the current quarter.  Story Continues Additionally, the chipmaker expects earnings to land at $0.59 per share in the current quarter, which would translate into a 28% increase from the same period last year. Marvell CEO Matt Murphy pointed out on the latest earnings conference call that the stronger-than-expected demand for its custom AI processors played a central role in its better-than-expected performance and robust guidance.Marvell management believes that it will \"significantly exceed the full year AI revenue target of $1.5 billion.\" The chipmaker is forecasting $2.5 billion in AI chip sales in the next fiscal year, though analysts believe that its AI-focused revenue could go up to $3 billion next year.It is easy to see why analysts are expecting the strong growth in Marvell's AI-related business to continue. After all, the company is one of the two major designers of custom chips, which are being developed by major cloud computing providers to reduce their reliance on Nvidia by developing in-house chips. These cloud companies turn to the likes of Marvell and Broadcom for designing their in-house chips.Reuters reports that the market for custom AI chips could be worth an impressive $45 billion by 2028, compared to an estimated $10 billion this year. Meanwhile, the company sees an additional revenue opportunity of $26 billion in data center switching and interconnect by 2028, thanks to AI. So, it won't be surprising to see Marvell delivering much stronger revenue and earnings growth in the next fiscal year and beyond.Stronger growth could lead to a bump-up in its stock priceBased on Marvell's fiscal Q4 guidance, the company is on track to finish fiscal 2025 with revenue of $5.75 billion. That would be an increase of just 4% from fiscal 2024 levels. Its earnings are on track to hit $1.56 per share for the full year, an increase of 3% over the previous fiscal year.Analysts, however, are expecting much stronger growth in fiscal 2026 (which will begin in February next year and coincide with 11 months of calendar 2025).  MRVL Revenue Estimates for Next Fiscal Year data by YCharts The top-line forecast for fiscal 2026 points toward a 31% increase, while the bottom line will increase by an impressive 63%. Of course, it won't be surprising to see analysts bumping up their estimates following Marvell's latest quarterly report.However, even if Marvell manages to achieve $7.5 billion in sales next year and trades at 16 times sales at that time, its market capitalization could hit $120 billion. That would be a 43% increase from current levels. However, the market has rewarded the likes of Nvidia with a much higher sales multiple of 31.If something similar happens with Marvell and the company manages to deliver stronger growth in 2025, it may be able to deliver much stronger gains than what's projected above.Don’t miss this second chance at a potentially lucrative opportunityEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $376,143!* Apple: if you invested $1,000 when we doubled down in 2008, you’d have $46,028!* Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $494,999!* Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.See 3 “Double Down” stocks »*Stock Advisor returns as of December 2, 2024Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool recommends Broadcom and Marvell Technology. The Motley Fool has a disclosure policy.Missed Out on Nvidia? Buy This Magnificent Artificial Intelligence (AI) Stock Before It Soars at Least 43% in 2025. was originally published by The Motley Fool  View Comments  ", "tags": ["NVDA", "MRVL"]}, {"title": "RBC Picks 2 Utility Stocks Powering the Data Center Revolution", "link": "https://finance.yahoo.com/news/rbc-picks-2-utility-stocks-112112229.html", "pubDate": "2024-12-07T11:21:12Z", "description": "In This Article:  BEP   -1.26%  BEP-PA   -0.45%  BRENF   0.00%  AES   -1.81%   Utility companies have long delivered reliable power, a service we’ve come to depend on without question. However, growing demand is putting new pressure on the grid and highlighting the need for expansion. The source of the new demand is hardly a secret – AI technology is booming, and it requires large-scale data centers to support its software and applications. And those data centers are notorious power consumers.Don't Miss our Black Friday Offers:Unlock your investing potential with TipRanks Premium - Now At 40% OFF! Make smarter investments with weekly expert stock picks from the Smart Investor Newsletter This situation has made it profitable for utility companies to start expanding their generation capacity, as well as to look into new power technologies. Nuclear power, alternative power sources, renewable energy – all are getting more attention as the data center expansion continues. The result is a surge of opportunity for investors in utility stocks.RBC’s Shelby Tucker, a 5-star analyst rated in the top 2% of the Street’s stock pros, highlights this dynamic in a recent report: “We expect load growth estimates to be revised upwards, following the trends established throughout 2024. Demand, driven by the growth in AI data centers, has combined with the surge in reshoring of manufacturing to drive commercial and industrial load growth to levels not seen since the early 2000s… Ultimately, we expect utilities whose service territories experience heightened interest from large-load customers to continue to update IRPs and increase load forecasts, leading to the potential need for more incremental resources.”Against this backdrop, Tucker has zeroed in on two utility stocks uniquely positioned to benefit from this trend, thanks to their strategic investments in data center infrastructure. We ran them through the TipRanks database to see what other Street experts make of his choices.AES Corporation (AES)The first utility stock we’ll look at is AES, a power company with an extensive portfolio of generating capacity and other assets, as well as a global footprint. From its base in Arlington, Virginia, across the Potomac from Washington, AES manages a network that spans the Americas and extends into Europe and Asia. The company’s focus is on the development and deployment of green power generation technology and capacity, on carbon-free electricity, and on creating the smart grid tech and digital solutions that will meet the ongoing needs of the electric utility sector as a business. What all of this means is that AES has a solid base, commensurate with its $9.5 billion market cap and $12-billion-plus in annual revenues.  Story Continues AES’s recent activity footprint includes power plants in Brazil and Argentina, electric generation facilities in both the Netherlands and the UK, coal-fired power plants in India, and utility-scale electric generation capacity in the US. The company prides itself on its ability to match the facilities to the local needs – and that brings us to the data center connection. In the third quarter of this year, AES added 900 megawatts of new power load growth to its AES Ohio operations, to provide supply to meet increasing data center demand.Data centers aren’t the only source of demand for power, and AES has plenty of new programs on its plate. Along with the expanded ops in Ohio, the company also completed 2.2 gigawatts of new power supply contracts in Q3, including 1.3 gigawatts of renewable energy in long-term power provision agreements. Also in Q3, AES reported having a substantial list of new projects in the pipeline to bring into operation before the end of this year. The company is also streamlining its operations by conducting asset sales, with proceeds up to $3.5 billion targeted through 2027.All of this activity produced almost $3.3 billion in revenue for AES during 3Q24, the last period reported. That revenue total was down 4% year-over-year and missed the forecast by $170 million – but the company’s earnings in the quarter beat the estimates. The non-GAAP EPS came to 71 cents per share, 7 cents better than had been expected.For RBC’s Tucker, the main attractive points for this stock are the company’s leading position in its niche as well as its solid pipeline of projects. He writes, “We view AES as a leader in the renewable IPP development space, primarily from their existing pipeline and relationships with large data center customers. As one of the largest corporate PPA developers, we expect the company’s 66 GW pipeline and 12.7 GW backlog to be largely servicing data center customers who are building the new wave of projects. The company has also made it clear that while input costs have increased in recent months, the growing competition for sourcing power has led to PPA prices outpacing input costs, driving margin expansion.”Putting his stance into quantifiable terms, Tucker rates AES as Outperform (Buy), with a price target of $17 to suggest a one-year upside potential of 28%. (To watch Tucker’s track record, click here)The 11 recent reviews here include 9 to Buy and 1 to Hold and Sell, each, for a Moderate Buy consensus rating. AES stock is priced at $13.29 and its $20.56 average target price implies that the shares will gain 55% in the coming months.. (See AES stock forecast)  Brookfield Renewable Partners (BEP)Now we’ll turn to Brookfield Renewable Partners, the renewable energy company that operates as a public entity under the aegis of the larger Brookfield Asset Management. Brookfield Renewable Partners holds a portfolio based on, as the company’s name indicates, renewable energy, with a focus on distributed and sustainable energy projects. The company’s portfolio is made up of a wide range of green energy generation assets, including wind, solar, and hydroelectric power facilities. These assets operate at utility scale, and are spread across both North and South America, as well as Europe and Asia. Brookfield Renewable Partners boasts that its operating capacity exceeds 35,000 megawatts, and that it has another 200,000 megawatts in the development pipeline.This company is always moving to proactively expand and enhance its asset portfolio. A quick look at highlights from the recent 3Q24 report will bear this out. During the third quarter of this year, BEP commissioned approximately 1,200 megawatts of new renewable energy capacity, and the company expects to reach a record level of 7,000 megawatts in new power capacity for the year as a whole. The company advanced its commercial initiatives, and secured contracts to deliver ‘an incremental 6,100-gigawatt hours per year of generation.’ To back this activity, the company could count on $4.6 billion in liquidity at the end of Q3. The company credits its success to fast growing demand, particularly from the tech sector – and within that, to the rapid expansion of data center and AI development.Looking at the financial results, we find that BEP posted revenues of $1.47 billion in Q3, a total that was up almost 25% year-over-year and came in $40 million better than had been forecast. The company missed the estimates at the bottom line, however; the quarterly funds from operations (FFO) of 42 cents per share was a penny less than expectations.That bottom-line miss didn’t bother RBC, and Shelby Tucker notes both BEP’s scale and its expansion: “Over the last five years, BEP more than doubled its clean energy contracted to corporate customers to over 20 TWh/year (representing about ~30% of its total contracted volumes), and management expects it to double to 44 TWh/year in 2028. Big tech represents a minority of what is currently contracted, but management expects big tech to represent the majority of volume growth to corporate customers going forward. In the last year, the company contracted to supply 35 TWh (delivered over a number of years) to big tech, representing about 78% of contracts to corporate customers and 70% of new contracts to all off-takers.”These comments back up an Outperform (Buy) rating on BEP, while the price target of $31 points toward a one-year gain of 26% for the stock.These shares have earned a Strong Buy consensus rating, based on 9 reviews that include 7 Buys and 2 Holds. The stock is currently trading for $24.54, and its $31.11 average target price closely matches the RBC outlook. (See BEP stock forecast)  To find good ideas for stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a tool that unites all of TipRanks’ equity insights.Disclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment.  View Comments  ", "tags": ["BEP", "BEP-PA", "BRENF", "AES"]}, {"title": "Billionaire David Tepper Has 14% of His Portfolio Invested in These 2 Brilliant Artificial Intelligence (AI) Stocks", "link": "https://finance.yahoo.com/news/billionaire-david-tepper-14-portfolio-081700078.html", "pubDate": "2024-12-07T08:17:00Z", "description": "In This Article:  META   +2.44%  AMZN   +2.94%     The artificial intelligence (AI) field is booming, with many corporations actively trying to make waves in this market. The most successful will reap immense financial rewards for themselves and their shareholders, but which ones will those be? Getting inspiration from the most famous and successful money managers on Wall Street might be helpful to pick promising AI stocks. One of them is David Tepper, the billionaire founder of Appaloosa Management.The hedge fund owns several AI stocks worth serious consideration for investors, including Amazon (NASDAQ: AMZN) and Meta Platforms (NASDAQ: META). These two made up about 14% of the fund's portfolio as of the third quarter. Here's why both companies are worth investing in.Start Your Mornings Smarter! Wake up with Breakfast news in your inbox every market day. Sign Up For Free »1. AmazonAmazon's business spans several industries, including video and music streaming, e-commerce and advertising, healthcare, grocery stores, and, of course, cloud computing. The tech giant offers a range of AI-related services through its cloud computing arm, Amazon Web Services (AWS). That includes its large language model, Bedrock; an AI assistant called Amazon Q; and much, much more than that. Cloud computing has been Amazon's most profitable segment for a while now.AI is already helping improve it. In the third quarter, Amazon's sales increased 11% year over year to $158.9 billion. AWS' revenue increased by 19% year over year to $27.5 billion. Also, despite making just about 17% of Amazon's revenue, AWS accounted for 60% of its operating income. According to management, AWS has grown significantly in the last four quarters at the same time as the company's AI business is recording year-over-year revenue increases in the triple-digit percentages.But there is still a vast runway for growth here. This is arguably still the early innings of this AI revolution. It could be a tailwind for Amazon for years to come, similar to how AWS, first launched in 2006, is now the company's most profitable segment. However, thanks to Amazon's diversified operations, it isn't just an AI play. Some investors are worried that pure-play AI companies will take a significant hit once the industry's growth inevitably slows.Amazon is well equipped to deal with this potential issue. Here's another important aspect of Amazon's success: The company has a strong competitive advantage. To mention just two, AWS benefits from switching costs while its core e-commerce operations display strong network effects. There will always be competition, but a company with a competitive edge as strong as Amazon's should continue performing well despite it.  Story Continues So, between its booming AWS unit, several opportunities in other segments, and its moat, Amazon is an outstanding stock to profit from AI.2. Meta PlatformsMeta Platforms generates almost all of its revenue from advertisements. AI is having a direct impact on its business since the company has been using AI-powered algorithms to drive more traffic and engagement across its websites.On Facebook and Instagram, Reels, or short-form videos, have become far more popular in recent years, partly thanks to this strategy. It has allowed Meta Platforms to compete with the high-flying TikTok. Meta Platforms also released generative AI tools to help companies create ads to launch on its websites, an approach that is bearing results.Meta Platforms' AI-related work also includes its large language model, Llama, and its MetaAI virtual assistant, which now has more than 500 million active users. Meta Platforms' AI involvement and financial results helped drive the stock much higher this year while it continues to post strong financial results. The company's third-quarter revenue increased by 19% year over year to $40.6 billion. Meta's net income was $15.7 billion, 35% higher than the year-ago period.Meta Platforms is planning on doubling down. The company projected that it would invest even more in AI-related infrastructure next year.While the market was initially not too happy about this news, in my view, it could be a great move. Meta Platforms ended the third quarter with 3.29 billion daily active users, an increase of 5% year over year. With an ecosystem that vast and a network effect across some of its websites and apps (Facebook and Instagram in particular), Meta Platforms can seek endless ways to monetize its users. The payoff from these investments could be more than worth it. And that's before you consider other growing sources of revenue for Meta Platforms, such as paid messaging on WhatsApp.In short, there is plenty of growth fuel left for Meta Platforms, with AI leading the way. The tech giant represents another great way to cash in on this increasingly important industry.Don’t miss this second chance at a potentially lucrative opportunityEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $376,143!* Apple: if you invested $1,000 when we doubled down in 2008, you’d have $46,028!* Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $494,999!* Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.See 3 “Double Down” stocks »*Stock Advisor returns as of December 2, 2024John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Prosper Junior Bakiny has positions in Amazon and Meta Platforms. The Motley Fool has positions in and recommends Amazon and Meta Platforms. The Motley Fool has a disclosure policy.Billionaire David Tepper Has 14% of His Portfolio Invested in These 2 Brilliant Artificial Intelligence (AI) Stocks was originally published by The Motley Fool  View Comments (1) ", "tags": ["META", "AMZN"]}, {"title": "The Smartest Bitcoin ETF to Buy With $2,000 Right Now", "link": "https://finance.yahoo.com/news/smartest-bitcoin-etf-buy-2-101700596.html", "pubDate": "2024-12-07T10:17:00Z", "description": "    Bitcoin (CRYPTO: BTC) is having a moment. After starting 2024 off with a bang, the cryptocurrency delivered disappointing performance from March through September. Now, Bitcoin is reaching new heights after rocketing up nearly 80% in the last three months.Although the exact mechanisms of any run are never entirely clear, the recent rise in Bitcoin's price appears driven -- at least in part -- by Trump's election. The incoming administration is viewed as very crypto-friendly and is expected to take a gentle approach to regulating the industry. On the campaign trail, Trump himself said he intended to make the U.S. the \"crypto capital of the planet.\"Start Your Mornings Smarter! Wake up with Breakfast news in your inbox every market day. Sign Up For Free »How an administration chooses to regulate or not regulate a market has big implications. The strong effect government actions have on the Bitcoin market was made clear at the beginning of this year when the Securities and Exchange Commission (SEC) approved spot Bitcoin ETFs. The cryptocurrency rose 85% in just six weeks.So, if you have $2000 that you'd like to invest in Bitcoin, what's the best way to gain exposure? You can always buy the asset directly, but spot Bitcoin ETFs are a great alternative. Here's my vote for the smartest option.Bitcoin ETFs are a big dealLet's face it -- despite its meteoric rise and trillions of dollars of investment, many are still wary of Bitcoin. They see it as an inherently risky asset mired in controversy. Can you blame them? Three years ago, FTX plastered its name on Miami's NBA arena, purchasing the right to do so in a $135 million deal. Just a year later, the exchange imploded in spectacular fashion, and with it, almost $9 billion in customer assets were lost.Now, the distinction between a private exchange and Bitcoin itself is important. The integrity of the Bitcoin and the Bitcoin network was not compromised in any way. It was simply a case of fraud and mismanagement from a private entity. Nevertheless, stories like this keep many people out of the market. It's why the approval of spot Bitcoin ETFs is such a big deal. These ETFs carry with them a stamp of approval from the SEC. They give more traditionally minded investors access to Bitcoin through a regulated security, one they can trade through a normal brokerage.Spot Bitcoin ETFs help build trust, signaling to investors that the market has matured and that it is safe. Ultimately, it means that a wider swath of investors is willing and able to enter the market.  Story Continues Spot Bitcoin ETFs aboundWhen they were approved, capital came flooding into the market. It took just 211 days for Blackrock's offering to reach $40 billion in assets under management (AUM), setting the record for the quickest ascent to that level in ETF history. The previous record was 1,253 days.There are a lot of spot Bitcoin ETFs at this point -- too many for an exhaustive list. Here are the top five by AUM.iShares Bitcoin Trust ETF (NASDAQ: IBIT) Grayscale Bitcoin Trust ETF Fidelity Wise Origin Bitcoin Fund ARK 21Shares Bitcoin ETF Bitwise Bitcoin ETF Trust With all the options available, what's the best one? If I had to pick, it would be the iShares Bitcoin Trust ETF. The truth is that the differences here are minor; all of these are solid. However, the iShares ETF is the most liquid of all. It is managed by Blackrock, one of the world's most trusted asset management companies, and it is one of the lowest-cost spot Bitcoin ETFs. Blackrock works closely with Coinbase to ensure it is using the best custodial security available. All of this adds up to what is, in my eyes, the best spot Bitcoin ETF on the market.Don’t miss this second chance at a potentially lucrative opportunityEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $376,143!* Apple: if you invested $1,000 when we doubled down in 2008, you’d have $46,028!* Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $494,999!* Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.See 3 “Double Down” stocks »*Stock Advisor returns as of December 2, 2024Johnny Rice has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin and Coinbase Global. The Motley Fool has a disclosure policy.The Smartest Bitcoin ETF to Buy With $2,000 Right Now was originally published by The Motley Fool  View Comments  ", "tags": []}, {"title": "Where Will Palantir Technologies Stock Be in 1 Year?", "link": "https://finance.yahoo.com/news/where-palantir-technologies-stock-1-220000484.html", "pubDate": "2024-12-06T22:00:00Z", "description": "In This Article:  NVDA   -1.81%   It would be an understatement to say that Palantir Technologies (NASDAQ: PLTR) stock has been in fine form on the market in 2024, as shares of the software platform specialist have shot up a stunning 290% so far this year as of this writing.The past month alone has been a terrific one for Palantir investors as the stock has zoomed 62% since releasing its third-quarter results on Nov. 4. Artificial intelligence (AI) has played a defining role in this red-hot rally as enterprises and governments have been flocking to Palantir to help them integrate generative AI into their operations, helping the company accelerate its growth and build a robust revenue pipeline.Start Your Mornings Smarter! Wake up with Breakfast news in your inbox every market day. Sign Up For Free »Wall Street, however, isn't expecting Palantir stock to sustain its momentum in 2025. Let's see why.Palantir Technologies' valuation is too rich right nowThe 20 analysts covering Palantir have a one-year price target of $38 on the stock. That points toward a 43% drop from current levels. Another thing worth noting is that 35% of the analysts recommend selling Palantir stock. Half of them have a \"hold\" rating, while only 15% recommend buying it.Moreover, the Street-high price target of $75 suggests that Palantir stock could jump only 12% from where it is right now in the next year. The valuation is one of the main reasons why analysts aren't projecting much upside in Palantir stock. After all, Palantir is now trading at a whopping 62 times sales. Its trailing price-to-earnings (P/E) ratio stands at 342. While the forward earnings multiple of 137 points toward an improvement in its bottom line, it is still very rich.It is worth noting that these multiples are way higher than AI pioneer Nvidia, a company that has been growing at a much faster pace than Palantir. For instance, Nvidia's revenue in its latest quarter increased an impressive 94% year over year to $35.1 billion. Its earnings, meanwhile, jumped 103% to $0.81 per share.Palantir, on the other hand, reported a 30% increase in revenue in Q3 to $726 million. The company's adjusted earnings increased by 43% from the year-ago period to $0.10 per share. Of course, this is not an ideal comparison as Nvidia is primarily a hardware company that's also finding success in AI software, while Palantir is a pure-play software provider.However, the fact that Nvidia is growing at a much faster pace despite its bigger size and is trading at a much lower 32 times forward earnings when compared to Palantir makes the former a much more logical AI stock to invest in right now. Moreover, Palantir's valuation puts it at risk of a major sell-off in case there are any cracks in its growth story, which means that it will have to continue delivering stronger growth quarter after quarter to justify its rich multiples.  Story Continues Is 2025 going to be a difficult year for this AI stock?While there is no doubt that Palantir's valuation suggests that the stock may have run ahead of itself, there are a few things that are working in the company's favor and could be tailwinds for the stock next year.First, Palantir's revenue growth rate has improved in each quarter of 2024. Its top line was up 21% year over year in Q1, followed by a 27% increase in Q2. We have already seen that it clocked a 30% revenue jump last quarter, driven by the robust demand for the company's AI software platform.The second reason why Palantir may be able to sustain its impressive rally is the impressive growth in its customer count and deal size, which are allowing it to build a healthy long-term revenue pipeline. More specifically, there was a 39% increase in Palantir's customer count last quarter. The number of $1 million deals signed by the company increased to 104 from 80 in the year-ago period.As a result, the remaining deal value (RDV) of Palantir's contracts increased by 22% to $4.5 billion last quarter. Considering that this metric refers to the total remaining value of contracts the company was sitting on at the end of the quarter, its impressive growth suggests that Palantir is in a position to keep growing its revenue at a nice pace in the long run.The third reason why Palantir may still seem attractive to growth investors is its strong unit economics. The company's non-GAAP operating margin in Q3 stood at 38%, up from 29% in the same period last year. Unit economics refers to the profit made by a company from each customer or product it sells after deducting expenses.Favorable unit economics suggest that Palantir is making more money from its customers now, and that's not surprising. In the company's November earnings conference call, management gave several examples of its customers expanding their contracts after signing up to use its solutions. That trend could continue in the future as the AI software platforms market is currently in its early phases of growth.IDC forecasts that the spending on AI software platforms could jump from $27.9 billion in 2023 to $153 billion in 2028. As a result, the adoption of Palantir's offerings is likely to improve further in the long run, and its strong unit economics should ideally allow it to maintain its impressive earnings growth.The above factors explain why analysts have increased their earnings growth expectations from Palantir for 2025 and 2026.  PLTR EPS Estimates for Next Fiscal Year data by YCharts If Palantir manages to continue outperforming analysts' expectations over the next year and attains stronger levels of revenue and earnings growth, there is a good chance that it may be able to justify its valuation and head higher in 2025. Conservative investors, however, would do well to look at other options if they are looking to capitalize on the AI boom, as Palantir's expensive valuation makes it prone to volatility.Should you invest $1,000 in Palantir Technologies right now?Before you buy stock in Palantir Technologies, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Palantir Technologies wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $889,004!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of December 2, 2024Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia and Palantir Technologies. The Motley Fool has a disclosure policy.Where Will Palantir Technologies Stock Be in 1 Year? was originally published by The Motley Fool  View Comments  ", "tags": ["NVDA"]}, {"title": "Analyst Report: Oshkosh Corp", "link": "https://finance.yahoo.com/research/reports/ARGUS_4179_AnalystReport_1733507138000?yptr=yahoo&ncid=yahooproperties_plusresear_nm5q6ze1cei", "pubDate": "2024-12-06T17:45:38Z", "description": "No article found", "tags": []}, {"title": "CD rates today, December 7, 2024 (best account provides 4.42% APY)", "link": "https://finance.yahoo.com/personal-finance/banking/article/cd-rates-today-saturday-december-7-2024-110021292.html", "pubDate": "2024-12-07T11:00:21Z", "description": " Today’s certificate of deposit (CD) interest rates are some of the highest we’ve seen in more than a decade thanks to several rate hikes by the Federal Reserve. However, the Fed finally cut its target rate this month, so now could be your last chance to lock in a competitive rate.CD rates vary widely across financial institutions, so it’s important to ensure you’re getting the best rate possible when shopping around for a CD. The following is a breakdown of CD rates today and where to find the best offers.Overview of CD rates todayHistorically, longer-term CDs offered higher interest rates than shorter-term CDs. Generally, this is because banks would pay better rates to encourage savers to keep their money on deposit longer. However, in today’s economic climate, the opposite is true.See our picks for the best CD accounts available today>>Today, the highest CD rate is offered by NexBank on its 1-year CD. Account holders can earn 4.42% APY, though there is a hefty minimum opening deposit of $25,000 required.The next highest rate is 4.30% APY, offered by Synchrony Bank on its 9-month CD. There is no minimum opening deposit required.Here is a look at some of the best CD rates available today from our verified partners: This embedded content is not available in your region.How much interest can I earn with a CD?The amount of interest you can earn from a CD depends on the annual percentage rate (APY). This is a measure of your total earnings after one year when considering the base interest rate and how often interest compounds (CD interest typically compounds daily or monthly).Say you invest $1,000 in a one-year CD with 1.81% APY, and interest compounds monthly. At the end of that year, your balance would grow to $1,018.25 — your initial $1,000 deposit, plus $18.25 in interest.Now let’s say you choose a one-year CD that offers 5% APY instead. In this case, your balance would grow to $1,051.16 over the same period, which includes $51.16 in interest.The more you deposit in a CD, the more you stand to earn. If we took our same example of a one-year CD at 5% APY, but deposit $10,000, your total balance when the CD matures would be $10,511.62, meaning you’d earn $511.62 in interest. ​​Read more: What is a good CD rate? Up Next  What is a high-yield CD?   Why a CD should be part of your retirement savings plan   What is a good CD rate in 2024?  Types of CDsWhen choosing a CD, the interest rate is usually top of mind. However, the rate isn’t the only factor you should consider. There are several types of CDs that offer different benefits, though you may need to accept a slightly lower interest rate in exchange for more flexibility. Here’s a look at some of the common types of CDs you can consider beyond traditional CDs:Bump-up CD: This type of CD allows you to request a higher interest rate if your bank's rates go up during the account’s term. However, you’re usually allowed to \"bump up\" your rate just once. No-penalty CD: Also known as a liquid CD, type of CD gives you the option to withdraw your funds before maturity without paying a penalty. Jumbo CD: These CDs require a higher minimum deposit (usually $100,000 or more), and often offer higher interest rate in return. In today’s CD rate environment, however, the difference between traditional and jumbo CD rates may not be much. Brokered CD: As the name suggests, these CDs are purchased through a brokerage rather than directly from a bank. Brokered CDs can sometimes offer higher rates or more flexible terms, but they also carry more risk and might not be FDIC-insured.  This embedded content is not available in your region.    Read More     Savings interest rates today, December 7, 2024 (best account provides 4.75% APY) If you’re searching for today’s best savings interest rates, we’ve narrowed down some of the top offers. Learn more about savings interest rates today.       Money market account rates today, December 7, 2024 (best account provides 5.00% APY) If you’re searching for today’s best money market account rates, we’ve narrowed down some of the top offers. Learn more about money market account rates today.       Savings interest rates today, December 6, 2024 (up to 4.75% APY return) Savings interest rates are the highest they’ve been in over a decade. Here’s where you can find the best savings interest rates today.       Money market account rates today, December 6, 2024 (up to 5.00% APY return) Money market account rates vary widely. So which banks are offering the best money market account rates today? Find out here.       CD rates today, December 6, 2024 (up to 4.42% APY return) CD rates are the highest they’ve been in over a decade. Here’s where you can find the best CD rates today.        Sign up for the Mind Your Money weekly newsletter      Subscribe  By subscribing, you are agreeing to Yahoo's \n                        \n                            Terms\n                        \n                     and \n                        \n                            Privacy Policy\n                        \n  Up Next  What is a high-yield CD?   Why a CD should be part of your retirement savings plan   What is a good CD rate in 2024?  ", "tags": []}, {"title": "Wells Fargo Likes These 2 Dividend Stocks Yielding as High as 15%", "link": "https://finance.yahoo.com/news/wells-fargo-likes-2-dividend-110253910.html", "pubDate": "2024-12-06T11:02:53Z", "description": "In This Article:  RWAY   +3.13%  ARCC   +0.18%   Heading into 2025, market watchers are starting to plan strategies based on a return to pro-business and deregulatory policies. The prospect of lower inflation and lower interest rates promises relief from debt pressures, which will be beneficial for lenders and other financial service firms.Don't Miss our Black Friday Offers:Unlock your investing potential with TipRanks Premium - Now At 40% OFF! Make smarter investments with weekly expert stock picks from the Smart Investor Newsletter This will bring investors’ sights to bear on BDCs, business development companies. These are investment firms, operating outside the traditional banking system but making capital and credit available to small- and mid-sized businesses. It’s a vital niche, that supports a main driver of the US economy.One key feature of BDCs, that makes them attractive to their investors, is their propensity to pay out high dividends. These companies offer capital, which means they need to bring in capital – and their investors expect a return. Dividends make a convenient mode for BDCs to return capital to their own investors. It’s a feature that makes these companies a solid addition to any set of portfolio dividend stocks.Wells Fargo analyst Finian O’Shea is paying close attention to this sector. In a recent report, O’Shea highlighted the potential in BDCs, stating, “BDCs appear to offer an improved relative entry point today in the world of balance sheet financials. A developing scenario of higher for longer with a strong economy for example could re-emerge for an attractive set up. This assumes credit losses are benign which has been true overall but with growing dispersion.”Getting into specifics, the Wells Fargo analyst makes it clear that he likes two BDC dividend stocks in particular – including one that yields as high as 15%, a powerful return by any standard. We’ve used the TipRanks platform to look up the details on these two BDCs. Let’s take a closer look.Runway Growth Finance Corporation (RWAY)The first stock on our list is Runway Growth Finance Corporation, a BDC focused on minimally dilutive venture capital. Runway’s activities in particular are directed towards venture debt, providing capital support for new companies in the technology, healthcare, and consumer niches. The company’s strategy, by avoiding dilution of the client firms’ stock, allows those firms’ founders and early investors to maintain their ownership, a key point for many startups.Runway Growth has been supporting startup firms since 2015, and in that time it has backed more than 60 companies, with 91 deals totaling some $3 billion in loan commitments. The target companies typically fit a profile; they are backed by venture capital or private equity, typically show $10 million to $20 million in annual revenue with high year-over-year growth, and are seeking loans in the range of $10 million to $75 million. Runway describes its mission as supporting passionate entrepreneurs as they build innovative businesses.  Story Continues On the dividend, Runway last declared its common share payment on November 5 for 40 cents per share. The dividend was paid out on December 2. Its annualized rate of $1.60 per share gives a forward yield of more than 15.3%.The company’s dividend was supported by its recent financial results. In 3Q24, Runway saw a total investment income of $36.7 million, although that figure missed expectations by $1.32 million. At the bottom line, Runway’s net investment income came to $15.9 million, which translated to 41 cents per share. While that missed the forecast by 4 cents per share, it was enough to fully cover the regular dividend payment.In his coverage of this company for Wells Fargo, analyst O’Shea notes that this BDC is near the bottom of a cycle – and that the firm’s current condition offers a sound opportunity to buy in. He writes, “RWAY shares have lagged the industry by ~18% on a total return basis YTD and trade at 0.78x book, and could re-rate upon a shift from what is likely ‘peak pessimism and uncertainty’ with what we see as a more right-sized consensus NOI estimate… We’re upgrading RWAY (to OW from EW) as we believe sentiment has likely reached the bottom, and its valuation presents more potential upside than downside risk.”Along with his upgraded Overweight (Buy) rating, O’Shea puts an $11 price target on the stock that implies a 5% gain in the coming months. Add in the dividend yield, and the total one-year return on these shares can climb above 20%. (To watch O’Shea’s track record, click here)There are only 3 recent analyst reviews on file for RWAY stock, and they include 2 Buys to 1 Hold for a Moderate Buy consensus rating. The shares have a current trading price of $10.44 and their $11.08 average price target points toward a one-year gain of 6%. (See RWAY stock forecast)  Ares Capital Corporation (ARCC)The next stock on our BDC list is Ares Capital Corporation, an important credit provider in the US small business sector. This is an important niche in financial services, as small- and mid-sized businesses are the traditional engine of the US economy. Ares Capital Corporation has 20 years’ experience in the field, and provides an essential service for its client firms – it provides the resources that they need to survive.Ares Capital Corporation has, in its two decades of operations, put together a substantial portfolio, with a fair value estimated at $25.9 billion. This portfolio is composed of 535 companies, which in turn are backed by 240 private equity sponsors. Dipping into the drill-downs, we find that nearly 53% of the portfolio is comprised of first lien senior secured loans. Second lien senior secured loans and preferred equity securities each make up approximately 10.5% of the total. By industry composition, Ares Capital’s portfolio is just over one-fourth software and services companies; health care services firms make up 12.8%, and commercial and professional services companies make up 10.7% of the total.The return on this portfolio makes up Ares’ income stream, which in the last reported quarter, 3Q24, came to a quarterly total investment income of $775 million. This figure was up more than 18% year-over-year, and was almost $1.7 million better than had been anticipated. The company’s bottom line, a non-GAAP EPS of 59 cents, was 1 cent lower than the forecast.Despite missing on EPS, the company’s income still easily covers the dividend. Ares Capital Corp. declared a 48-cent common share payment on October 30, for a December 30 payout. The annualized rate of $1.92 per common share gives a substantial forward yield of ~8.7%.O’Shea, in looking at this stock, is impressed by Ares Capital’s sound performance and the high quality of its portfolio. He says of the company, “In a market where many more average performers are at or near book value, ARCC gets the award for reliability, which it has demonstrated yet again through best-in-class credit performance throughout the Fed’s campaign. Credit performance YTD 2024 and since 2022 are both #1 in our coverage, where gains from equity investments, including Heelstone, have helped cover credit losses…”Describing the opportunity here, the analyst adds, “Thematically, we see a lower base rate environment as a likely positive for ARCC, which has an impressive record in junior / structured credit. Lower rates may lead to an expansion of this opportunity set for ARCC.”This is another stock that gets an upgrade from the Wells Fargo analyst; his Overweight (Buy) rating here is a bump up from Equal Weight. O’Shea’s price target, of $23, suggests that the stock will gain 4% by this time next year. With the dividend yield, the total return on ARCC, for the coming year, may reach as high as almost 13%.The Street in general likes this stock, as shown by the Strong Buy consensus rating – a rating that is supported by 10 reviews with a breakdown of 8 Buys to 2 Holds. The shares are priced at $22.10, and the $22.40 average target price implies they will stay rangebound for the time being. (See ARCC stock forecast)  To find good ideas for stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a tool that unites all of TipRanks’ equity insights.Disclaimer: The opinions expressed in this article are solely those of the featured analyst. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment.  View Comments (3) ", "tags": ["RWAY", "ARCC"]}, {"title": "Rouble rebounds past 100 vs US dollar after Putin's gas payments decree", "link": "https://finance.yahoo.com/news/rouble-rebounds-past-100-vs-123931805.html", "pubDate": "2024-12-06T12:39:31Z", "description": "  By Gleb Bryanski and Elena FabrichnayaMOSCOW (Reuters) - The Russian rouble rebounded past 100 to the U.S. dollar, trading at 99.50 on Friday, after a decree by President Vladimir Putin which opened new payment options for European buyers of Russian gas, allowing foreign currency flows to resume.The rouble strengthened by 1.5% against the dollar, according to over-the-counter data from banks. It was also up by 2.4% at 13.57, rebounding past 14, against China's yuan in trade on the Moscow stock exchange.Putin's decree meant that European buyers of Russian gas, including Hungary and Slovakia, who previously used Gazprombank for their transactions, could now convert their currency into roubles in other banks that are not under sanctions.U.S. sanctions imposed on Gazprombank on Nov. 22 disrupted Russia's foreign currency market, leading to a 15% fall in the rouble exchange rate against the dollar.The Russian currency now is on track for its best week in four months, suggesting the market has adjusted to the sanctions. The rouble has been weakening since Aug. 6, the first day of Ukraine's incursion into Russia's Kursk region.Russia's Finance Minister Anton Siluanov directly linked problems with energy payments and U.S. sanctions against Gazprombank to the rouble's weakness, saying the volatility will disappear as soon as a solution for payments is found.\"Our foreign trade participants are finding ways to settle accounts with their counterparts abroad, so I think that one more week and everything will be fine,\" Siluanov was quoted by the Russian media as saying on Dec. 5.Analysts and traders shared this view, saying that Putin's decree has unlocked energy payments, giving a boost to the Russian currency.\"Previously stalled large export revenues, which were stuck due to new banking sanctions, may have been 'unblocked' and have now hit the market, which is already very thin,\" a forex trader in a large Russian bank, who declined to be identified, told Reuters, explaining the reasons for the rouble's rise.Putin said this week that up to 90% of Russia's foreign trade was now in roubles and currencies of 'friendly' nations such as China's yuan. However, some importers still needed dollars and euros, creating domestic demand for both currencies.Russia's sanctioned largest lenders, including state-controlled Sberbank, can no longer hold and trade dollars in euros since they cannot have correspondent accounts in the U.S. and Europe and are cut off from the international SWIFT system.  Story Continues Many Russian banks have been importing large volumes of dollar and euro cash from third countries at least throughout 2023 in order to service their clients in case they want to buy foreign currency.However, many Russian banks, including local subsidiaries of Austria's Raiffeisen, Hungary's OTP and Italy's UniCredit, were not under sanctions and could use SWIFT.Such banks formed the core of the Russian market in dollars and euros, which became entirely over-the-counter following sanctions against Moscow Stock Exchange in June, which made yuan the most traded foreign currency in Russia.Sberbank's CEO German Gref said the fair value of the rouble is in a range of 100-105 to the U.S. dollar, adding that he did not expect more surprise exchange rate fluctuations for now.\"Today we do not expect any surprises with this. It will fluctuate depending on the situation. And currently, we do not see any room for a significant weakening of the rouble,\" Gref said at the bank's investor day.(Reporting by Gleb Bryanski; Editing by Mark Trevelyan, William Maclean)  View Comments (11) ", "tags": []}, {"title": "Warren Buffett Labeled It 'Playing With Fire' When The Indicator Named After Him Reached 140% — Cut To Today And It's Over 200%", "link": "https://finance.yahoo.com/news/warren-buffett-labeled-playing-fire-140032325.html", "pubDate": "2024-12-06T14:00:32Z", "description": "  Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.The Buffett Indicator – a market valuation measure – is signaling potential danger as it surpasses levels witnessed during the Dot-Com Bubble and the Great Financial Crisis.What Happened: This indicator, attributed to Berkshire Hathaway Inc (NYSE:BRK) (NYSE:BRK) CEO Warren Buffett, compares the market capitalization of stocks to the Gross Domestic Product (GDP) to determine if equities are overvalued or undervalued.Don't Miss:Unlock the hidden potential of commercial real estate — This platform allows individuals to invest in commercial real estate offering a 12% target yield with a bonus 1% return boost today! Warren Buffett once said, \"If you don't find a way to make money while you sleep, you will work until you die.\" Here’s how you can earn passive income with just $100. The total market index, tracked by the Wilshire 5000, and the U.S. GDP are used to calculate this ratio. The Wilshire 5000, a market-cap-weighted index, tracks all U.S. publicly traded companies, which includes more than 3,000 firms. The higher the ratio, the more overvalued the market is deemed to be.Data from Longtermtrends reveals that the current Wilshire 5000-to-GDP ratio stands at approximately 208%, surpassing levels seen prior to both the Dot-Com Bubble and the Great Financial Crisis.For context, during the height of the Internet stock frenzy in 2000, the Buffett Indicator reached 140%. In 2007, just before the subprime mortgage crisis disrupted global markets, the ratio was around 110%.See Also: ‘Scrolling To UBI' — Deloitte's #1 fastest-growing software company allows users to earn money on their phones. You can invest TODAY for just $0.26/share with a $1000 minimum.In a Fortune article from 2001, Buffett characterized this level as “playing with fire” alluding to the dotcom bubble.“Nearly two years ago the ratio rose to an unprecedented level,” Buffett wrote.“That should have been a very strong warning signal.”Why It Matters: Berkshire has been offloading stocks and bolstering its cash reserves recently. This could be a sign of Buffett’s wariness of an overpriced market, or it could be setting the stage for potential acquisitions. Buffett has previously expressed that Berkshire would be receptive to such opportunities.Trending: Commercial real estate has historically outperformed the stock market, and this platform allows individuals to invest in commercial real estate with as little as $5,000 offering a 12% target yield with a bonus 1% return boost today!Despite this warning, some analysts remain optimistic about the stock market's future. Bank of America analysts have predicted a positive outlook for stocks in 2025, with the S&P 500 Index expected to reach 6,666 by the end of 2025, marking a 10% increase from current levels. This forecast is based on confidence in productivity gains, resilient corporate earnings, and strategic sector rotation.  Story Continues Ark Invest's Cathie Wood has also expressed her positive outlook for the stock market under President-elect Donald Trump's administration. She believes that the market is already starting to anticipate a shift, indicating potential future growth.According to data from Benzinga Pro, the S&P 500 index, which is tracked by SPDR S&P 500 ETF Trust (NYSE:SPY), has gained 28.33% so far this year. During the same period, the tech-heavy Nasdaq-100, which is tracked by Invesco QQQ Trust Series 1 (NASDAQ:QQQ), is up 29.91%.Wondering if your investments can get you to a $5,000,000 nest egg? Speak to a financial advisor today. SmartAsset’s free tool matches you up with up to three vetted financial advisors who serve your area, and you can interview your advisor matches at no cost to decide which one is right for you.Looking For Higher-Yield Opportunities In A Shifting Market?The changing interest rate environment has created an incredible opportunity for income-seeking investors to earn massive yields, but not through dividend stocks... Certain private market real estate investments are giving retail investors the opportunity to capitalize on these high-yield opportunities and Benzinga has identified some of the most attractive options for you to consider.For instance, the Ascent Income Fund from EquityMultiple targets stable income from senior commercial real estate debt positions and has a historical distribution yield of 12.1% backed by real assets. With payment priority and flexible liquidity options, the Ascent Income Fund is a cornerstone investment vehicle for income-focused investors. First-time investors with EquityMultiple can now invest in the Ascent Income Fund with a reduced minimum of just $5,000. Benzinga Readers: Earn a 1% return boost on your first EquityMultiple investment when you sign up here (accredited investors only).Don't miss out on this opportunity to take advantage of high-yield investments while rates are high. Check out Benzinga's favorite high-yield offerings. This article Warren Buffett Labeled It 'Playing With Fire' When The Indicator Named After Him Reached 140% — Cut To Today And It's Over 200% originally appeared on Benzinga.com  View Comments (2) ", "tags": []}, {"title": "Market Update: OSK", "link": "https://finance.yahoo.com/research/reports/ARGUS_42046_MarketUpdate_1733506238000?yptr=yahoo&ncid=yahooproperties_plusresear_nm5q6ze1cei", "pubDate": "2024-12-06T17:30:38Z", "description": "No article found", "tags": []}, {"title": "Nuclear and Renewable Energy Stocks Have Lost Their Shine", "link": "https://finance.yahoo.com/news/nuclear-renewable-energy-stocks-lost-190459973.html", "pubDate": "2024-12-06T19:04:59Z", "description": "In This Article:  NOVA   +0.68%  FCEL   -2.51%   After a strong run for some energy stocks in the fall, the rally fell flat this week with many nuclear and renewable energy stocks dropping.According to data provided by S&P Global Market Intelligence, NuScale Power (NYSE: SMR) fell as much as 22.3% this week, Sunnova Energy (NYSE: NOVA) was down 21.5%, and FuelCell Energy (NASDAQ: FCEL) dropped 13.1% at its low. The stocks are down 15.9%, 20.8%, and 12.4% respectively as of 1:30 p.m. ET on Friday.Start Your Mornings Smarter! Wake up with Breakfast news in your inbox every market day. Sign Up For Free »The momentum wears off eventuallyLate summer and early fall trading centered around the data center and enormous energy needs companies would need to run artificial intelligence (AI) chips. Nuclear energy was thought to be a solution and solar energy could fill some of the need along with batteries given how quickly solar plants could be built.But the euphoria around energy demand seems to be easing and that's why NuScale and Sunnova are down this week. NuScale could still be a big player in nuclear energy in the future, but it's years away from meaningful revenue.Sunnova is one of the largest rooftop solar installers, which would make sense for data centers that need dedicated energy built quickly, but even that was a stretch because solar installations is a very competitive business.Interest rates aren't helpingWhile the conventional wisdom a few months ago was that lower rates from the Federal Reserve would lead to lower borrowing rates for energy developers, that hasn't played out as hoped. You can see in the chart below that rates are up since September and are essentially flat over the past year.  10 Year Treasury Rate data by YCharts Whether you're building a solar farm or a nuclear power plant, higher interest rates make the energy you produce more expensive. And renewable energy stocks often fall when rates rise. We're just seeing a delayed reaction to the news that's been obvious for weeks.The market has given up on losing moneyFor as many hot stocks as there are today, a theme across the market is formerly hot energy stocks failing to get the valuations they got during the pandemic. Investors have given up on funding companies that seem to lose money year after year.FuelCell Energy has seen that and even after a 1-for-30 stock split last month shares continue to decline. As the stock price goes lower it becomes even harder to raise money and can be a downward spiral for any company.Fundamentals win over speculationThe theme here is that speculation drove energy stocks higher in the fall, but that momentum has been lost, leaving investors with the fundamental performance of these stocks. And you can see that none of them are profitable today.  Story Continues   NOVA Net Income (TTM) data by YCharts Nuclear and renewable energy may be the future of the energy industry, but that doesn't mean every company involved is going to succeed. These are all established companies that are losing money and that's a bad sign for investors. I'll stay out of these speculative assets today, even after the discount in shares this week.Don’t miss this second chance at a potentially lucrative opportunityEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $376,143!* Apple: if you invested $1,000 when we doubled down in 2008, you’d have $46,028!* Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $494,999!* Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.See 3 “Double Down” stocks »*Stock Advisor returns as of December 2, 2024Travis Hoium has no position in any of the stocks mentioned. The Motley Fool recommends NuScale Power. The Motley Fool has a disclosure policy.Nuclear and Renewable Energy Stocks Have Lost Their Shine was originally published by The Motley Fool  View Comments (1) ", "tags": ["NOVA", "FCEL"]}, {"title": "AGNC Investment Wasn't a Buy in 2024, and It Won't Be a Buy in 2025, Either", "link": "https://finance.yahoo.com/news/agnc-investment-wasnt-buy-2024-102500154.html", "pubDate": "2024-12-07T10:25:00Z", "description": "In This Article:  AGNC   +1.68%   AGNC Investment (NASDAQ: AGNC) attracts a lot of investing attention for one reason: It has a massive 15% dividend yield. But dividend investors shouldn't run out and buy this stock. It wasn't a dividend buy in 2024, and it won't be one in 2025, either. In fact, it probably will never be a great investment option for dividend investors.Here's what you need to know.Are You Missing The Morning Scoop? Wake up with Breakfast news in your inbox every market day. Sign Up For Free »AGNC's troubling dividend track recordAGNC Investment's dividend yield is around 15% right now. That sounds like an anomaly, but it isn't. The yield has been around 10% or higher for most of the real estate investment trust's (REIT's) existence. In fact, the average yield, including the period when the dividend was just starting to be built up after the company's initial public offering (IPO), is about 14%!  AGNC Dividend Yield data by YCharts Real estate investment trusts are structured to pass income on in a tax-advantaged manner to shareholders. So it would be understandable if the high yield here got dividend investors excited. Only dividend yield doesn't tell you the whole dividend story. This chart looking at the company's quarterly dividend payments and the share price is far more informative.  AGNC data by YCharts Dividend yield is a pretty simple math equation: You divide the annualized dividend by the stock price. If the dividend is falling, as it has been for AGNC Investment, the only way for the yield to remain high is for the stock price to fall, too.That is what has happened. Given that most dividend investors are likely trying to live off of the dividends they collect, which effectively means they are being spent, AGNC Investment would have left dividend investors with less income and a smaller nest egg. That is not a good outcome.Why does AGNC Investment exist?For dividend investors, AGNC Investment was a terrible stock to own in 2024, and it will be a terrible stock to own in 2025. It will probably be a terrible stock to own forever ... if you are a dividend investor.That doesn't mean it is a terrible stock for every investor. In fact, if you reinvest the dividends that have been paid, AGNC Investment has been a pretty good investment.  AGNC data by YCharts The chart highlights two vastly different outcomes. On a stock price-only basis, AGNC Investment's price is down about 50% from its IPO. Total return, which assumes dividend reinvestment, is hugely positive at a gain of over 400%.Essentially, the massive dividend payments have more than made up for the stock price weakness if you reinvested the dividend. But this means that anyone salivating at the huge 15% dividend yield with the thought of using that cash to pay for living expenses will be making a big investment mistake if they buy this stock.  Story Continues AGNC Investment's real goal is total return, as well as providing investors exposure to the mortgage market, given that the REIT owns mortgage securities. If you use an asset allocation model that includes mortgage exposure and reinvest dividends, well, AGNC Investment could be a great choice for you. Only that's not what most dividend investors do. It is the type of approach taken by large institutional investors like pension funds.You need to know what you own with AGNC InvestmentIt is easy to get so enamored with a huge dividend yield that you overlook very real problems at a company. To be fair, there really aren't huge problems at AGNC Investment. It is a reasonably well-run mortgage REIT.The thing that investors risk overlooking is that the mortgage REIT isn't designed to generate income so much as to provide a strong total return. The dividend is just a part of the total return equation. If you are looking at AGNC Investment and its huge yield as 2024 draws to a close, make sure you understand what it is really offering investors.Don’t miss this second chance at a potentially lucrative opportunityEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $376,143!* Apple: if you invested $1,000 when we doubled down in 2008, you’d have $46,028!* Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $494,999!* Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.See 3 “Double Down” stocks »*Stock Advisor returns as of December 2, 2024Reuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.AGNC Investment Wasn't a Buy in 2024, and It Won't Be a Buy in 2025, Either was originally published by The Motley Fool  View Comments (2) ", "tags": ["AGNC"]}, {"title": "Ask an Advisor: I'm About to Free Up $1,000 a Month After Paying Off My Car. Should I Save or Invest It?", "link": "https://finance.yahoo.com/news/ask-advisor-put-300-457-141256116.html", "pubDate": "2024-12-06T14:45:09Z", "description": "    Ask an Advisor: I Put $300 in My 457(b) Every Payday and Will Have an Extra $1,000 Per Month After Paying Off My Car. Should I Save or Invest the Money?  I’m 54, retired military and get $1,500 a month after taxes and medical deductions. I also have a 457(b) account for my current government job and I have been putting $300 into it each payday. I was paying $1,000 a month toward my car but it’s about to be paid off. I’m planning to increase my 457(b) contribution to $600 per payday but I was wondering if I should put some of the money in either a high-yield savings account or an IRA?– JohnCongratulations on paying your car off! Also, good on you for deliberately thinking about what you are going to do with the money that is freed up every month.Your next move depends on a lot of factors, you should mainly be thinking about whether you’ll need the money: in the near term or years in the future? (If you have additional questions about your financial plan, this tool can help match you with potential advisors.)What Is Your Goal for the Money?You may already have a financial plan in place. If not, take some time to define your goals and prioritize them. Start by making sure you have a sufficient emergency fund, and then go down the line from there. Goal setting is a critical step because saving money in a high-yield savings account achieves a different purpose than saving money in a 457(b) or IRA.Short-Term Goals vs. Long-Term Goals  Ask an Advisor: I Put $300 in My 457(b) Every Payday and Will Have an Extra $1,000 Per Month After Paying Off My Car. Should I Save or Invest the Money?  If you’re going to need the money in the near future, placing it in a high-yield savings account is the better option. Right now, those are paying in the neighborhood of 4-5%. While that’s a stable return, it’s only in line with current inflation so not really a good choice for long-term savings.Placing money in a retirement account provides tax advantages as well as investment options geared to help you save for your golden years. Those would be a better option for your long-term money.So, hash out your goals and allocate the money accordingly. Be sure to consider your attitude toward investment risk too. High-yield savings are a conservative option. The investment options available in retirement accounts will include more aggressive choices as well. (And if you need help picking investments that are aligned with your short- and long-term financial goals, consider working with a financial advisor.)457(b) vs. IRA  Ask an Advisor: I Put $300 in My 457(b) Every Payday and Will Have an Extra $1,000 Per Month After Paying Off My Car. Should I Save or Invest the Money?  As it relates to your retirement goals, you’ll need to do some evaluation. Make sure you are on track to hit your savings target. Saving $300 per pay period may be enough to fund your retirement lifestyle, but it may not be. It all depends on your specific situation and goals, including:How much you have saved already When you plan to stop working How much you’ll need to withdraw from your savings when you retire   Story Continues There’s too much detail to cover it all here. Talk with a financial planner or take some time to research how much you’ll need and whether or not you’re on track to get there.If you decide to save more toward retirement, consider the differences between 457(b) and IRA accounts. Both offer tax advantages. Both also allow you to invest your contributions so one is not necessarily always better than the other. Out of simple convenience since you already have the account it may make sense to increase your 457(b) contributions unless you have a specific reason to open an IRA. For example, that might be the case if a Roth account makes sense for you and your 457(b) plan doesn’t have a Roth option. (And if you need more help deciding between saving in an IRA or 457(b), consider working with a financial advisor).Here are a few noteworthy details to keep in mind:Make sure you are getting the full match before you decide to save in an IRA. You can withdraw from a 457(b) at any age and avoid the 10% early withdrawal penalty as long as you no longer work for that employer. This may be particularly important if you plan to retire before you turn 59 ½. Bottom LineUltimately, whatever you decide to do with it the money you’ll be saving once your car is paid off should move you closer to achieving your goals. If you have short-term financial goals, diverting the money to a high-yield savings account may be best. If you’re more focused on long-term financial goals like retirement, consider saving the money in your 457(b) or opening an IRA.Tips for Finding a Financial AdvisorFinding a financial advisor doesn’t have to be hard. SmartAsset’s free tool matches you with up to three vetted financial advisors who serve your area, and you can interview your advisor matches at no cost to decide which one is right for you. If you’re ready to find an advisor who can help you achieve your financial goals, get started now. Consider a few advisors before settling on one. It’s important to make sure you find someone you trust to manage your money. As you consider your options, these are the questions you should ask an advisor to ensure you make the right choice. Keep an emergency fund on hand in case you run into unexpected expenses. An emergency fund should be liquid -- in an account that isn't at risk of significant fluctuation like the stock market. The tradeoff is that the value of liquid cash can be eroded by inflation. But a high-interest account allows you to earn compound interest. Compare savings accounts from these banks. Are you a financial advisor looking to grow your business? SmartAsset AMP helps advisors connect with leads and offers marketing automation solutions so you can spend more time making conversions. Learn more about SmartAsset AMP. Brandon Renfro, CFP®, is a SmartAsset financial planning columnist and answers reader questions on personal finance and tax topics. Got a question you’d like answered? Email AskAnAdvisor@smartasset.com and your question may be answered in a future column.Please note that Brandon is not a participant in the SmartAsset AMP platform, is not an employee of SmartAsset, and he has been compensated for this article.Photo credit: ©iStock.com/SDI Productions, ©iStock.com/TinpixelsThe post Ask an Advisor: I Put $300 in My 457(b) Every Payday and Will Have an Extra $1,000 Per Month After Paying Off My Car. Should I Save or Invest the Money? appeared first on SmartAsset Blog.  View Comments (34) ", "tags": []}, {"title": "What are the conforming loan limits for 2025?", "link": "https://finance.yahoo.com/personal-finance/mortgages/article/conforming-loan-limits-212412754.html", "pubDate": "2024-09-18T21:24:12Z", "description": " If you’re shopping for your first home, you’re probably aware that your financial situation will impact how much you can borrow with a mortgage loan. But did you know that the type of mortgage you select will also help determine your maximum loan amount?Many hopeful home buyers want to get a conforming mortgage. In 2025, most borrowers face a conforming loan limit of $806,500. However, the limit can vary depending on where you live and how many units are on your property. And don’t worry too much if you need to borrow more than conforming loans allow, because you still have options.Read more: Everything you should know as a first-time home buyer This embedded content is not available in your region.In this article:What is a conforming loan? Baseline 2025 conforming loan limits History of conforming loan limits What to do if you need to borrow more than the CLL FAQs What is a conforming loan?Before we discuss the conforming loan limits (CLL), you should understand what a conforming loan is in the first place. A conforming loan is probably what you’d think of as a “regular mortgage.” It’s a type of conventional mortgage that adheres to Fannie Mae and Freddie Mac guidelines — including borrowing limits. Fannie Mae and Freddie Mac are government-sponsored enterprises (GSEs) overseen by the Federal Housing Finance Agency (FHFA).Mortgage lenders often originate conventional loans and then sell them to the GSEs to free up cash to underwrite more loans. Fannie Mae and Freddie Mac are legally barred from purchasing mortgages on single-family homes with origination balances over a set amount, or the conforming loan limit.Ultimately, the GSEs package the loans they purchase into mortgage-backed securities (MBS), which are types of investments made up of many types of home loans. The GSEs either give MBS to the lender in exchange for the loans or sell the loans to investors. Investors like to buy conforming loans because they’re perceived as safe since they meet the GSE standards. In fact, for a fee, Fannie Mae and Freddie Mac will guarantee the principal and interest payments on the MBS they issue.Learn more: The different types of mortgage loansBaseline 2025 conforming loan limitsThe FHFA, in accordance with the Housing and Economic Recovery Act of 2008 (HERA), updates the baseline loan limit each year to reflect the change in the average home price. The agency goes by the House Price Index (HPI), which measures the average price changes in repeat property sales or refinances bought or securitized by the GSEs.The below values reflect the baseline CLL for all loans delivered to the GSEs in 2025.“The larger the loan, the larger the risk. [Limits are] supposed to help prevent overborrowing and foreclosures and to maintain market stability,” Anna Smith, senior mortgage loan officer at Movement Mortgage, said via email.\"For borrowers, if there is less risk in lending, obtaining financing should be, in theory, more attainable,” Smith said. “When there is less risk, typically less strict underwriting standards exist, lower interest rates happen, and overall easier lending practices happen.”Yahoo note: A select few counties in the contiguous United States have higher maximum loan limits for conforming mortgages because they are high-cost areas. You can see the CLL in your county using the interactive map published by the FHFA.Dig deeper: How much house can I afford? Use our home affordability calculator. Up Next  Best mortgage lenders for first-time home buyers of December 2024   Mortgage calculator   FHA vs. conventional loan: Which should you choose?  History of conforming loan limitsThe CLL is dynamic and shifts with housing market trends. In the early 1970s, the baseline limit was just $33,000.Here’s a look at how it’s changed in the last decade:Conforming mortgage loan limits were the same for the years 2006 to 2016, but the FHFA has increased them annually ever since.\"This means median home prices have continued to climb since then,” Smith said. “In years where housing prices remain stagnant or decrease, [the FHFA does] not lower the conforming loan limit.”Learn more: Why are home prices so high?What happens if you need to borrow more than the conforming loan limit?If your dream home costs more than the CLL, you have a couple of options. You could “... piggyback a smaller loan on top of the first lien to keep the main loan in the conforming limit and still finance what you need,” Smith said. “This means you may pay higher interest and fees on the smaller piggybacked loan, but you'll have a nice conforming loan otherwise.”You could also apply for a jumbo loan, which is a conventional mortgage that exceeds the CLL. Securing a jumbo loan can help you buy the residence while only incurring one housing debt.Qualifying for a jumbo loan might be harder than a conforming loan. “When lenders choose to lend over those loan amounts, they are risking more of their own money, as the [GSEs] are not insuring those funds,” Smith said. \"Jumbo lending can often become more complex than conforming, as the institutions lending that money are often writing their own rules and regulations to manage their risk.”As a result, you may need a higher credit score, down payment, and more than six months of cash reserves to be eligible for this type of financing.However, it’s worth noting that more mortgage lenders tend to offer jumbo loans than piggyback loans.Read more: What is a non-conforming loan, and how does it work?Conforming loan limits 2025: FAQsShould you borrow more than the conforming limit?You may want to borrow more than the conforming limit if your target property costs more than that amount. However, you should ensure you can comfortably repay the larger debt before applying for a jumbo loan.What is the difference between a conforming loan and a non-conforming loan?A conforming loan is a conventional loan that complies with Fannie Mae and Freddie Mac standards. On the other hand, a non-conforming loan is a mortgage that doesn’t follow the GSE guidelines. A jumbo loan is one example of a non-conforming loan. Other examples are government home loans, including FHA, VA, and USDA loans.Where can I find information about conforming loan limit values?You can find the current (and historic) conforming loan limit values on the FHFA website. The agency publishes the upcoming year’s limits several weeks before they go into effect.This article was published by Laura Grace Tarpley.    Read More     What is the difference between a home's appraised value and market value? A home’s appraised value and market value don’t always align, and a sale can be difficult if the two numbers are different. Learn how these values affect you.       Are mortgage points tax deductible? Sometimes — here are the rules. Mortgage points can be tax deductible, but you must meet specific requirements and itemize your deductions. Learn how to deduct your mortgage discount points.       What happens if an appraisal comes back lower than the offer? If an appraisal is lower than the amount you offered on the house, you may still be able to buy the home. Here are your options with a low appraisal.       House deed: Definition, types, and how to get one A house deed is a physical document stating you are the owner when you buy a home. Learn what information is on a deed and how to get the deed to your house.       What to expect at the final walk-through before closing on a house The final walk-through before closing gives you the chance to check the appliances, plumbing, and any requested repairs. Here’s what to include on your checklist.          Up Next  Best mortgage lenders for first-time home buyers of December 2024   Mortgage calculator   FHA vs. conventional loan: Which should you choose?  ", "tags": []}, {"title": "HPE CEO on $14 billion Juniper deal: It should close in early 2025", "link": "https://finance.yahoo.com/news/hpe-ceo-on-14-billion-juniper-deal-it-should-close-in-early-2025-215810121.html", "pubDate": "2024-12-06T21:58:10Z", "description": "In This Article:  JNPR   -0.71%  HPE   +10.62%  TPR   -1.53%  HPQ   +0.08%  DELL   -1.34%      Show Key Questions     Is the acquisition of Juniper Networks by Hewlett Packard Enterprise (HPE) likely to be completed in early 2025?   According to HPE CEO Antonio Neri, the acquisition is expected to close in early 2025, despite fresh concerns about the deal. Neri stated, 'I have no pause about the deal [getting done],' and believes it will receive approval from the Biden administration. (Source: Yahoo Finance interview with Antonio Neri)  Was this helpful?  Yes   No     How did HPE's performance match up to Wall Street expectations in its fiscal fourth quarter earnings report?   HPE's performance matched Wall Street expectations, with the company reporting fiscal fourth quarter earnings in line with estimates. Demand was brisk for servers as AI infrastructure build-outs continue, and two of the company's three main segments notched operating margin expansion in the quarter. (Source: HPE's fiscal fourth quarter earnings report)  Was this helpful?  Yes   No     What is the current outlook for HPE's stock, and how has it performed year-to-date?   Citi analyst Asiya Merchant upgraded her rating on HPE to Buy from Neutral, citing the potential for stronger contribution from enterprise AI and sovereigns, as well as the potential EPS accretion from the Juniper acquisition. HPE shares rose 9% on Friday's session to $23.75, and the stock is up 40% year to date, lagging rival Dell's gain of 63%. (Source: Citi analyst Asiya Merchant, Yahoo Finance data)  Was this helpful?  Yes   No     What were some of the key highlights from HPE's fiscal fourth quarter earnings report?   Net sales were $8.5 billion, up 15% year over year, with server sales up 32% year over year to $4.7 billion. Gross profit margins were 30.9%, compared to 34.8% a year ago. Diluted earnings per share were $0.58, up 12% year over year. (Source: HPE's fiscal fourth quarter earnings report)  Was this helpful?  Yes   No     Is the current hype around AI investments justified, according to veteran tech executive Tom Siebel?   Tom Siebel, CEO of C3.ai, believes that the hype around AI has gotten out of control, with many AI companies believing they are selling 'God in a box.' (Source: Yahoo Finance interview with Tom Siebel)  Was this helpful?  Yes   No     Generated by Yahoo Finance AI   Yahoo Finance used generative AI to summarize key information from this article. Some details may be inaccurate. We take that seriously. Reporting mistakes helps us improve these summaries.  Hewlett Packard Enterprise (HPE) CEO Antonio Neri is holding out hope his prized acquisition of Juniperg Networks (JNPR) will close in early 2025.\"I have no pause about the deal [getting done],\" Neri told me on Yahoo Finance (video above). \"It's a good deal for customers.\" Neri added it would help strengthen national security.The tech giant announced the $14 billion purchase of Juniper Networks in January. If completed, the acquisition would double HPE's existing networking business. It would mark one of the biggest deals for the company since it spent $3 billion in 2015 to buy Aruba Networks.Fresh concerns about the deal have crept into the picture. The FT reported several weeks ago that HPE officials met with Justice Department antitrust enforcers to argue against a challenge to the deal.The Justice Department under Biden has been scrutinizing big deals that could decrease competition. Recently, the FTC was successful in blocking a handbag merger between Tapestry (TPR) and Capri Holdings (CPRI).Neri still thinks the acquisition will come to fruition in early 2025 and is likely to receive approval from the Biden administration.Despite the unknowns of the Juniper deal, HPE's performance continues to match Wall Street expectations.On Thursday, after market close, the company reported fiscal fourth quarter earnings in line with estimates. Demand was brisk for servers as AI infrastructure build-outs continue. Two of the company's three main segments notched operating margin expansion in the quarter.HPE guided relatively in line with consensus forecasts for the current quarter.\"While AI orders/revenues can be lumpy, we see the potential for stronger contribution from enterprise AI and sovereigns which bodes positively for revenue momentum and margins ahead. Coupled with improving demand outlook in core enterprise infrastructure spending and potential EPS accretion from Juniper acquisition with management confident in closing the deal by early 2025, we are increasingly more constructive,\" said Citi analyst Asiya Merchant.Merchant upgraded her rating on HPE to Buy from Neutral and sees fair value at $26 a share. Of the 18 analysts on the Street that cover HPE, nine rate the stock a Buy and nine rate it a Hold, according to Yahoo Finance data.HPE shares rose 9% on Friday's session to $23.75. The stock is up 40% year to date, lagging rival Dell's (DELL) gain of 63%.NYSE - Nasdaq Real Time Price • USD  Hewlett Packard Enterprise Company (HPE)   Follow    View Quote Details    23.95 +2.30 +(10.62%) At close: December 6 at 4:02:21 PM EST  23.96 +0.01 +(0.04%) After hours: 7:59:08 PM EST HPE DELL   Advanced Chart    1D  5D  1M  3M  6M  YTD  1Y  5Y  All   Earnings overview: Beats on top and bottom linesNet sales: $8.5 billion (+15% year over year) vs. $8.25 billion estimate (Guidance: $8.1 billion to $8.1 billionServer sales: +32% year over year to $4.7 billion Intelligent edge sales: -20% year over year to $1.1 billion Hybrid cloud sales: +18% year over year to $1.6 billion  Gross profit margins: 30.9% compared to 34.8% a year ago Diluted earnings per share: $0.58 (+12% year over year) vs. $0.56 estimate   Story Continues What else caught our attention: The odds and endsFree cash flow fell $851 million from the prior year to $1.5 billion. Operating profit margins fell to 24.4% from 27.1% in the Intelligent Edge segment. Operating profit margins rose in the Server and Hybrid Cloud segments. Total AI systems backlog stood at over $3.5 billion, up from $3.4 billion in the previous quarter. First fiscal quarter guidance:Net sales: up by a mid-teens percentage (in line with consensus estimates) Diluted earnings per share: $0.47 to $0.52 (estimate: $0.49)  Industry vibe: The AI hypeThe AI race is well underway. But is there too much hype and too much money being invested in startups that aren't working on true AI breakthroughs?Veteran tech executive and C3.ai (AI) CEO Tom Siebel thinks the hype has gotten out of control, as many AI companies believe they are selling \"God in a box.\" This embedded content is not available in your region.Three times each week, I drive insight-filled conversations and chats with the biggest names in business and markets on Opening Bid. You can find more episodes on our video hub or watch on your preferred streaming service.Brian Sozzi is Yahoo Finance's Executive Editor. Follow Sozzi on X @BrianSozzi and on LinkedIn. Tips on deals, mergers, activist situations, or anything else? Email brian.sozzi@yahoofinance.com.Click here for the latest technology news that will impact the stock marketRead the latest financial and business news from Yahoo Finance  View Comments (4) ", "tags": ["JNPR", "HPE", "TPR", "HPQ", "DELL"]}, {"title": "Analyst Report: Simon Property Group, Inc.", "link": "https://finance.yahoo.com/research/reports/ARGUS_3403_AnalystReport_1733487420000?yptr=yahoo&ncid=yahooproperties_plusresear_nm5q6ze1cei", "pubDate": "2024-12-06T12:17:00Z", "description": "No article found", "tags": []}, {"title": "This Brilliant Move Could Enable Realty Income to Make Its Investors Richer in the Future", "link": "https://finance.yahoo.com/news/brilliant-move-could-enable-realty-103300360.html", "pubDate": "2024-12-07T10:33:00Z", "description": "In This Article:  O   +0.20%     Realty Income (NYSE: O) has done a fantastic job of growing shareholder value over the years. The real estate investment trust (REIT) has produced a 14.1% compound annual total return since its public market listing in 1994. It has delivered that robust return by growing its portfolio, cash flow, and dividend payment. The REIT has grown by investing shareholder capital into income-generating net lease real estate. It plans to leverage that expertise by bringing in private capital in a brilliant move that could grow shareholder value significantly in the future. Here's a look at this smart strategy.Are You Missing The Morning Scoop? Wake up with Breakfast news in your inbox every market day. Sign Up For Free »Tapping into the massive private capital marketRealty Income has grown into a behemoth in the REIT sector over the last half-century. It's currently the seventh largest REIT in the world, with $58 billion in real estate assets in eight countries. Despite its enormous size, it holds a small fraction of the commercial real estate market. The U.S. commercial real estate market is worth about $20.7 trillion. Currently, publicly traded REITs like Realty Income only hold about $1.9 trillion in real estate. That means 90% of the market remains in private hands. Realty Income plans to tap into this massive opportunity by launching a private investment fund targeting institutional investors (i.e., pension funds, sovereign wealth funds, and insurance companies). The fund will focus on U.S. net lease properties that the company will initially seed with some it currently owns. It aims to grow the fund over time by bringing in new investors and acquiring additional properties. That third-party capital will provide Realty Income with additional funding to pursue more acquisitions. The REIT sources more deals than it can close, which leaves opportunities on the table. For example, it has sourced $34 billion of potential transactions this year, only closing on $2.1 billion, or 6% of its sourced volume. It's highly selective, due in part to capital limitations. A potentially enriching strategyRealty Income would earn recurring fee-based income to manage this third-party capital. That fee-related income would enable the REIT to grow its adjusted funds from operations (FFO) per share at a higher rate in the future, because it would earn much higher returns on new investments made in the fund. For example, Realty Income currently buys net lease properties at a 7.5% real estate cap rate. It funds those deals with 35% debt and 65% equity (all from shareholders). However, if it made the same investment in a fund, it would only need to invest 20% of the equity, with fund investors covering the remaining equity requirement to keep the same leverage level. The REIT would earn a 1% annual fee from managing the third-party equity investment.   Story Continues This structure significantly enhances the deal's returns for Realty Income and its shareholders. The investment would have an effective cap rate of 10.1%, while the REIT's return on equity would improve from 8.8% on a stand-alone basis to 12.8% in the fund. In other words, every dollar of capital invested in the fund would generate a higher return for shareholders. In addition to the higher growth rate and returns, Realty Income should also see a valuation boost, because the market values asset managers much more highly than it does REITs. For example, Realty Income currently trades at about 15.3 times earnings, which is a slight discount to the REIT sector average of 16.3x. For comparison, asset managers currently trade at 24.3x because fee-related income is so stable and high-margin. As the company scales its asset management business and fee-based income, its valuation should rise. A brilliant way to create additional shareholder valueRealty Income is only capturing a small slice of the commercial real estate market, due in part to the limitations of the public markets. That's leading the REIT to launch a fund to tap the massive private capital market. This strategy will enable it to grow faster, earn higher returns, and potentially secure a higher valuation. That should help make its investors richer in the future by increasing their dividend income and the REIT's share price. Because of that, it looks like a very smart move by a company that has already done a fantastic job growing the wealth of its investors over the years. Don’t miss this second chance at a potentially lucrative opportunityEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $376,143!* Apple: if you invested $1,000 when we doubled down in 2008, you’d have $46,028!* Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $494,999!* Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.See 3 “Double Down” stocks »*Stock Advisor returns as of December 2, 2024Matt DiLallo has positions in Realty Income. The Motley Fool has positions in and recommends Realty Income. The Motley Fool has a disclosure policy.This Brilliant Move Could Enable Realty Income to Make Its Investors Richer in the Future was originally published by The Motley Fool  View Comments  ", "tags": ["O"]}]